{"rating": "4.6", "based_on": "868", "reviews,useful,rating,date": [["there are a few glitches here and there with the software, but hopefully it will get fixed with a software update\ncamera is best in class\nbattery is average\npure android experience is awesome\ncannot connect directly to a computer since there's no USB cable support (both sides of the cable provided is a type c)\nneeds better memory management for keeping more apps open in memory\nfeels like internal memory is too low(mine already 70% used)", "38 users found this review helpful", "5 stars", "03 Nov 2018,"], ["This phone feels really fast, everything feels buttery smooth, Ram is a little less as recent apps reload again & again. battery life is good for one day of moderate usage. Display is Good at par with Apple & Samsung. The notch is really deep it bothers at first but then you get used to it. \nAs usual camera quality is superb. the front camera can take super wide angle selfies. for more details search for gizmofest on you-tube.", "29 users found this review helpful", "5 stars", "02 Nov 2018,"], ["Delighted to get my hands on the brand new pixel 3 xl bang on the promised date. Couldn't have asked for a better bargain for a globally launched premium branded product. Thank you Flipkart...that's why I always order smartphones through you and only you!!", "20 users found this review helpful", "5 stars", "02 Nov 2018,"], ["Nice Phone", "15 users found this review helpful", "5 stars", "05 Jan 2019,"], ["**Best Android smart phone**\nI have been using pixel 2xl and now upgraded to pixel3xl...\nbiggest difference is screen resolution ...\nif you want to own best Android smart phone this is the one ..nothing comes close to performance and camera of a pixel3xl... use it to believe it .", "8 users found this review helpful", "5 stars", "06 Nov 2018,"], ["So this was delivered yesterday. Here's what I think:\n\nThe build quality is kinda downgrade if you ask me. I am a fan of metal body build and do not care about wireless charging. So this glass build scares me a bit. It is also a tad heavier than OG Pixel  XL.\n\nDisplay is absolutely stunning. Notch doesn't bother me much and I may disable it if Google implements disabling of the notch in such a way that the status bar icon stays there.\n\nCameras (both front and rear) are just awesome. The wide angle front camera helps a lot if you want to fit in more people in your selfies. The camera app still doesn't have Night Sight just yet. Have not played around with it much.\n\nI just missed the stereo speaker from my Nexus 6P and the speaker on this one is quite loud. As reported by many P3XL users, if you play anything with higher volume you can literally feel it's vibration on the back of the device. The speakers are not balanced which is understandable due to the different sized speaker grills. I have no other reported issues with the speaker i.e. crackling noises, buzzing/clicking sounds etc.\n\nThe OS is fluid enough and since I have not used the phone extensively just yet, I am yet to see the widely reported RAM management issues. Right now it's smooth, fluid with zero lag. Surprisingly, the OS is on September patch which is kinda downgrade from my OG Pixel XL which was running the October patch. Don't know why they didn't push the September patch. My guess is they're concentrating more on fixing the bugs.\n\nBattery life seems to decent too. Charged it fully around 10 hours ago. 2 hours of Screen on time with 60% left.\n\nYet to check the audio from USB-C  to 3.5mm dongle but since it comes with the upgraded dongle it should be fine I guess. I do miss the 3.5mm jack though. Also planning to get the Apple USB-C  to 3.5mm dongle as a backup since it is reported to work fine with Pixel devices and is quite cheap for $9.\n\nAll in all pretty satisfied with the device.  I don't think I can use a non Pixel device now.", "8 users found this review helpful", "5 stars", "02 Nov 2018,"], ["Writing this review after 15 days of use. nFirst thing is Google the brand itself is enough to buy this mobile without second thought. Now coming to the pros n cons of this mobile.nPros : nCamera - Just awesome. It works as per the expectation. Far better than any iPhone camera. Landscape mode is superb. And the one of the hidden feature of the this pixel is that it creates AI photo from your gallery by itself. Which is just awesome. ( Attached one sample pic here)nStock Android - Seamless experience. Does everything very smoothly and without any lag.nScreen -  Best in class.nBattery - Lasts almost 24 hrs based on your uses. nExtra feature - You have some extra and cool features like swapping between running apps. Google assistant wakes up by pressing the side of the phone. Works pretty well. Although you can increase or decrease it as per convenient.nLook - Just flawless. Looks awesome. The back side they have one third glossy finish which feels good in hand.nNotch - Looks ok but all the applications don't support this. It happens in all the mobile though.nSpeaker 🔊 - You have got 2 speakers top n bottom. Which works very well. Sound is more than enough for mobile phone.nYou don't get 2 speakers in most of the smart phones. nFinger print scanner- Works like champ. nUnlimited Storage for your pics n videos.nnnCons-n Only C type port for both charging n headphones. So you can't use your old headphones with audio jack. Although you get one C type to jack connector in the box with this phone.", "5 users found this review helpful", "5 stars", "14 Apr 2019,"], ["This comes from a decent gamer, casual photographer and an average phone consumer, who isn't opening 40apps to check the RAM management of the phone. Amazing phone, an upgrade on all levels from the 2XL. Sharp display. A camera that gives you confidence to hand it out to any one at any point to take photos at any moment.  Am sure that there are good phones at a much cheaper price point (one plus), but having this phone is an experience unparalleled by anyone. Amazed in true sense.", "3 users found this review helpful", "5 stars", "11 Nov 2018,"], ["awesome phone for 2018\nbest camera ever in smart phone line\nnight mode awesome\nIf you want to buy any phone mote then 50k them go to for this\nnothing is negative for this only headphones jack is Missing other all are good", "2 users found this review helpful", "5 stars", "27 Nov 2018,"], ["Google gave Quality and performance. Just want to know when will google provide data to Indian telecom operators to add e-sim, and missing Face recognition feature.", "1 users found this review helpful", "5 stars", "25 Dec 2018,"], ["i phone with most features and google branding. Its itself a tank with fire power.", "1 users found this review helpful", "5 stars", "16 Dec 2018,"], ["Great camera, fast smooth operation.stock android experience.great speakers.good design and color.\ncons\nRAM management 6GB would be better\nnotch not a big deal.", "1 users found this review helpful", "5 stars", "03 Dec 2018,"], ["perfect phone with all features ..", "1 users found this review helpful", "5 stars", "27 Nov 2018,"], ["Camera awesome\nBattery average\nPerformance good\nStorage enough\nCamera is worth the hype. Go for it if you are in just for camera. Otherwise better alternatives at cheaper prices are available.", "1 users found this review helpful", "4 stars", "19 Nov 2018,"], ["The best phone money can buy.", "1 users found this review helpful", "5 stars", "15 Nov 2018,"], ["I had pre-order the phone and was received on Nov 1 as per the expected time, was eagerly waiting for this to upgrade my pixel 2 with pixel 3 xl.\n\nI was pretty impressed with the build quality, camera and overall experience with the phone. One of the weird issue observed with me is that it heats up a lot especially when using camera. I hardly use it for 2 to 5 minutes and it's burning hot. This kind of made me switch to pixel 2 within hours of using it. Tried contacting google and is still awaiting a response from them", "1 users found this review helpful", "2 stars", "09 Nov 2018,"], ["Phone is awesome. Did anyone get Google home mini in offer?. Read in news that Google home mini is free for pixel users who are upgrading but I didn't get any.", "1 users found this review helpful", "5 stars", "04 Nov 2018,"], ["best one I liked till now. but I expected gorrila glass with case to keep it secure", "1 users found this review helpful", "5 stars", "04 Nov 2018,"], ["Great, worth, lovingit", "1 users found this review helpful", "5 stars", "04 Nov 2018,"], ["And Once Again Google Proves it-self Top notch. \nHad lot of doubts but money well spent :). \n\nThe phone is as fluid and smooth as it could be.", "1 users found this review helpful", "5 stars", "03 Nov 2018,"], ["Got it delivered in just one day .. amazing", "1 users found this review helpful", "4 stars", "03 Nov 2018,"], ["major issue is e-sim\nbecouse price range Google not given e-sim dual standby \nthat's the biggest issue \n2nd issue is network too much problem is there\n3rd issue is flipkart not change the product \ncoustomer is troubling to much but flipkart not given solutions\nwrost service flipkart\n\ndon't buy this site...\ni am really unhappy", "0 users found this review helpful", "3 stars", "05 Oct 2019,"], ["I have been a great fan of google since many years. Since Android is by google only. So Google's hardware (the phone) and software create an awesome experience together. Very smooth. The camera is literally the best u can get on a smartphone. It's really consistent and gets u best pictures even in very low light conditions. The night sight mode is just stunning. Also you will love the playground mode. Besides that u get every android and security updates first i.e. much earlier than other smartphones. Also Google's new features which are declared at i/o every year are given to Pixel phones first before rolling out to other smartphones. The notch seemed big when I unboxed but now I have become used to it. And to be honest it doesn't seem that big nor ugly. Only thing which might bother you is battery. It's doesn't last that much. But quick charge feature eliminates most of my problem. But be sure to carry a powerbank if u are on a long journey.", "0 users found this review helpful", "5 stars", "16 May 2019,"], ["Superb. Good phone with all round capabilities. Photos taken at night are just so good.", "0 users found this review helpful", "5 stars", "11 May 2019,"], ["Awesome purchase , pure clean android experience, better camera.", "0 users found this review helpful", "5 stars", "12 Apr 2019,"], ["Radiation is very high , cant use the phone for at-least 10 mins", "0 users found this review helpful", "1 stars", "04 Apr 2019,"], ["very happy", "0 users found this review helpful", "5 stars", "02 Apr 2019,"], ["excellent", "0 users found this review helpful", "5 stars", "17 Mar 2019,"], ["Good display with all features. But too expensive", "0 users found this review helpful", "5 stars", "11 Mar 2019,"], ["Best phone money can buy. Some aspects in this Phone in perfect and they are 1.Camera 2. Android 3. Display 4. Speakers and many more which are excellent", "0 users found this review helpful", "5 stars", "09 Mar 2019,"], ["Next level Android experience!!!!.", "0 users found this review helpful", "5 stars", "18 Feb 2019,"], ["Flipkart is one of the most worst sites to buy the phone, got it under pixel power program, and even after 2 months of purchase, I am yet to receive the 2000 RS gift voucher, kudos Flipkart for ensuring you stay ahead of all other sites by not providing the customer care experience one should deserve after dropping 70+ k for a phone..if the voucher cannot be provided, please reply rather than trying to hide behind excuses...", "0 users found this review helpful", "1 stars", "02 Feb 2019,"], ["awesome camera, probably best with first hand Google software. that's all. performance is same in respect to some other flagships. screen is also good. sound very good loud and clear with two speakers.", "0 users found this review helpful", "4 stars", "30 Jan 2019,"], ["Excellent camera phone. Awesome pictures in night mode.", "0 users found this review helpful", "5 stars", "30 Jan 2019,"], ["its a nice phone but the price is way 2 much\nthe camera is amazing", "0 users found this review helpful", "5 stars", "23 Jan 2019,"], ["the best phone ever. excellent camera.superb performance. price is little high though.", "0 users found this review helpful", "5 stars", "13 Jan 2019,"], ["The only negative thing to say about the Pixel 3XL is the battery drain, it's not as bad but a phone so premium we expect a better performance. Another drawback is we do not have dual card slots, even though there is an option for e-sim, we can only use one carrier/one SIM at a time which I think is not convenient. Apart from this, the phone is fantastic.", "0 users found this review helpful", "5 stars", "06 Jan 2019,"], ["This is one of the best cellphones I have come across..The camera is to die for..a bit overpriced but the it seems worth it..", "0 users found this review helpful", "5 stars", "03 Jan 2019,"], ["Fantastic phone received on a terrific deal on Flipkart. Delivery was before time.", "0 users found this review helpful", "5 stars", "28 Dec 2018,"], ["Just awesome.", "0 users found this review helpful", "5 stars", "23 Dec 2018,"], ["The phone is better in all aspects.", "0 users found this review helpful", "5 stars", "19 Dec 2018,"], ["It's a great phone...not for physical features...but for the software....the camera is great ..(may be not the only best...)", "0 users found this review helpful", "5 stars", "16 Dec 2018,"], ["awesome phone from Google.. \nexcellent camera.. such clarity and detail.. \ngreat display..\ngood battery stand.. \nsuperb UI.. \nvery handy even with 6\" display..", "0 users found this review helpful", "5 stars", "14 Dec 2018,"], ["I don't know what happened buty pixel makes noice some time from inside near camera and it is just so annoying. \nthere are many bugs in this phone. it's always not reachable when somebody calls me. please fix this.", "0 users found this review helpful", "5 stars", "08 Dec 2018,"], ["The Notch is definitely a eye sore when you check photos of pixel 3 xl online. But notch doesn't look bad in real. Very good battery backup. Excellent camera. Definitely a good buy.", "0 users found this review helpful", "5 stars", "29 Nov 2018,"], ["Best phone I have ever used, really smooth phone with amazing camera", "0 users found this review helpful", "5 stars", "22 Nov 2018,"], ["better than any other phone at present", "0 users found this review helpful", "5 stars", "14 Nov 2018,"], ["Great buyback offer from flipkart for my Pixel 2 XL  and for the new Pixel 3 XL prompted me to buy the phone.  All in all, this phone has stiff competition from One Plus given the superior functionalities and face ID with the one Plus.  The Pixel 3XL camera is way better and is a key differentiator alongside the unlimited storage as well as the seamless Google experience not to mention the almost immediate rollout of the latest versions of Android and other updates.\n\nGo for this phone if you need the best camera and cannot compromise on the Android experience.  Lack of Face ID is puzzling though.", "0 users found this review helpful", "5 stars", "12 Nov 2018,"], ["World's Best Camera Phone.", "0 users found this review helpful", "5 stars", "11 Nov 2018,"], ["Very good phone from Google. The best stock android experience.", "0 users found this review helpful", "5 stars", "11 Nov 2018,"], ["Fantastic flagship phone. Gobsmacking camera. Extremely satisfied.", "0 users found this review helpful", "5 stars", "11 Nov 2018,"], ["Loving it...", "0 users found this review helpful", "5 stars", "11 Nov 2018,"], ["it is the best no doubt.maybe it's overpriced but worth it", "0 users found this review helpful", "5 stars", "10 Nov 2018,"], ["Excellent product; works like a charm!", "0 users found this review helpful", "5 stars", "08 Nov 2018,"], ["awesome product camera is extremely nice memory management is top notch awesome product loved it too much", "0 users found this review helpful", "5 stars", "04 Nov 2018,"], ["The display is sharper and responsive to touches. The camera is fantastic compared to my previous device Nexus 6P. I need to check other sensors and performances on games. Overall it has a premium feel.", "0 users found this review helpful", "5 stars", "03 Nov 2018,"]]}