{"Apple iPhone 11 Pro Max":{"rating": "4.6", "based_on": "1,104", "reviews,useful,rating,date": [["It’s a beast, what a device... in love with it", "38 users found this review helpful", "5 stars", "30 Sep 2019,"], ["Elegant design..... midnight green colour is so beautiful....actually as they said it’s a premium device.... excellent performance! Cameras are great .... still exploring in camera feature!", "36 users found this review helpful", "5 stars", "19 Oct 2019,"], ["Camera and battery life s the best in this iPhone.. the os 13 very fluid .. one of the best products for Apple", "29 users found this review helpful", "5 stars", "07 Oct 2019,"], ["I had doubts about getting an iPhone from online stores/e-commerce, but bought this anyway on 24/10 and got it by 28/10. About the iPhone ,well there’s nothing new we could say about apple products- High standards,New iOS updates every year,built quality. In 11 pro max Camera, the new A13 bionic chip,Battery are the highlights. I was never worried about the phone or had any doubts about it’s performance. These are few shots that I’ve taken since I got this iPhone. It’s been  only 2 days so couldn’t try other features yet.nnEdit:- I’ve uploaded few pictures that I’ve took using the new deep fusion feature that came with new iOS update.", "26 users found this review helpful", "5 stars", "31 Oct 2019,"], ["Never buy this product from Flipkart. They are  cheating the customers buy showing return policy  My iPhone 11 pro max is over heating from the time of switching on. During the time of charging the heating is unbearable .May be because of over heating the battery also draining fastly. Flipkart not giving a replacement for this product. If you buy this product from Flipkart and if you face any issues you have to approach the apple customer care. After purchasing you can not even contact Flipkart to talk about the issues.", "25 users found this review helpful", "1 stars", "11 Feb 2020,"], ["Wowww..Mind blowing purchase..Camera perfection and detailing no words to say,night mode truely awesome,battery back up outstanding,overall worth buynGuys Go for it if your looking premium handset on your handsnawesome Job Team Apple 😍😍😍😍😍", "22 users found this review helpful", "5 stars", "25 Oct 2019,"], ["Good I live it", "18 users found this review helpful", "5 stars", "02 Jan 2020,"], ["Great phone & thanks to Flipkart for fast delivery... i was using iPhone XS Max & this phone is almost same but camera is awesome so I upgraded to this iPhone 11 pro Max", "15 users found this review helpful", "5 stars", "03 Oct 2019,"], ["Everything is fine but on silver color its logo is also silver that looks disappear", "13 users found this review helpful", "1 stars", "19 Oct 2019,"], ["fast service by Flipkart .  iPhone name is enough.. except price matters..its 1st class performance", "12 users found this review helpful", "5 stars", "30 Sep 2019,"], ["A very nice phone but not value for money.", "11 users found this review helpful", "4 stars", "27 Oct 2019,"], ["Nice", "9 users found this review helpful", "5 stars", "09 Dec 2019,"], ["Just Awesome, For Night mode in camera no one cam beat Iphone, performance super fast, portraits mono mode just ossm, Even in battery backup is now improved than previous iphone,  in the box apple give Fast charger 👌🏻👌🏻👌🏻", "9 users found this review helpful", "5 stars", "06 Nov 2019,"], ["Great purchase, happily upgraded to iPhone 11 pro max and I’m quite satisfied with the performance of the phone :))", "9 users found this review helpful", "5 stars", "30 Oct 2019,"], ["Frustrate by Flipkart😟namazed by Apple😇nnFlipkart took more than four days to deliver the 1.25 lakhs phone !!!!!nniPhone 11 pro max the best phone ever made by Apple it’s camera it’s processor, it’s battery better than ever!nnnI am loving it!", "9 users found this review helpful", "3 stars", "22 Oct 2019,"], ["Superb!", "9 users found this review helpful", "5 stars", "16 Oct 2019,"], ["A fantastic phone overall. Yes it’s expensive. But the phone is pure quality. I agree they need to prove it little better but when you have the phone on your hand then you realise that every corner of the phone is quality. \n\nRAM is one area where I feel compromised bu otherwise everything else. Like camera, display, processing power, battery backup is simply outstanding. \n\nLoving the phone.", "9 users found this review helpful", "5 stars", "09 Oct 2019,"], ["The phone is truly a beast now i understand why apple is calling it pro because it is one hell of a beast. truly iam very much mazaed and satisfied with the device. and delivery service of flipkart was also very fast  I got my shipment delivery within 1 day.", "8 users found this review helpful", "5 stars", "20 Nov 2019,"], ["Superb! 😍", "6 users found this review helpful", "5 stars", "11 Nov 2019,"], ["Nice very good phone", "6 users found this review helpful", "5 stars", "11 Nov 2019,"], ["amazing phone... loved it so much👌🏻👌🏻👌🏻", "6 users found this review helpful", "5 stars", "09 Nov 2019,"], ["Great deal with Flipkart and the delivery is very prompt.", "6 users found this review helpful", "5 stars", "16 Oct 2019,"], ["Amazing phone. This is my first ever iPhone. nNight mode is the best. I have added some night mode sample photos. Take a look, you other stupid Chinese brands and Samsung as well. Thank you Apple for awesome product and Flipkart for awesome service.", "6 users found this review helpful", "5 stars", "02 Oct 2019,"], ["After Apple announced this latest model, I was far from impressed. Compared to the X that this would be replacing, it seemed like a very mild update, and not worth the entry price! However on actual use of this phone, it just shows that all the little improvements taken TOGETHER add up to a brilliant update. First off this just seems much quicker in use, from FaceID unlock to opening apps and swiping, there is no hesitation. I went for the new Forest Green colour also, which is also very nice. The phone feels nice in the hand. Now for the camera:The main reason for upgrading! Just wow! I know other smart phone manufacturers all have great cameras on their flagship phones but again, in use these new cameras and sensors and software on the iPhone 11 Pro, are incredible for taking great photos quickly and easily. The super-wide lens- 13mm (35mm equiv) is great for landscapes and interiors. And the normal (26mm) and \"telephoto\" lens (only 56mm I think) are very sharp and great for taking portraits in \"portrait mode\" where it blurs the background nicely.The effect can be altered post capture amongst many other things in the iPhone camera software. The selfie camera is also updated to 12 MP so much sharper than before. The \"Night Mode\" feature is truly black magic! With only minimal light, this tiny camera/phone that fits in your pocket can take photos at night that it almost makes it look as if taken in day light and is full of crisp detail. Incredible.In a few years there will not be much point in owning \"proper cameras!\" looking at the rate of progression of these smart phone cameras. And oh yes, you can make great phone calls on this device as well as all the other things we take for granted now (internet browsing, social media, online banking which is the most secure on the iPhone). And the battery lasts even longer than before. What's not to like! Slight disappointments- No USB Type-C, still has the \"notch\", no reverse charging, still very expensive.", "4 users found this review helpful", "5 stars", "01 Dec 2019,"], ["This thing is an absolute beast!nBest camera and battery life ever on a smartphone!nIt’s so fluid to use.nAnimations are real smooth.nSo happy to have bought this.n❤️❤️nNo way anyone will regret buying this.nBest diwali for me 🥰", "4 users found this review helpful", "5 stars", "27 Oct 2019,"], ["Battery - more or less 2 days\nCamera - can now perform very good in low light (night )\nHeating- no heating for 15+ days\nCharging- Quick charger ( which now comes in box ) charges 1-80 in less than an hour. The next 20 requires next 25 mins or so.", "4 users found this review helpful", "5 stars", "17 Oct 2019,"], ["I use android devices since 8 year but this year I want to change and I am very impressed to use this beast and I am very happy to invest money in this device.", "4 users found this review helpful", "5 stars", "02 Oct 2019,"], ["if u can't afford it don't hate it \nits best phone", "3 users found this review helpful", "5 stars", "21 Dec 2019,"], ["More than 5 stars", "3 users found this review helpful", "5 stars", "30 Oct 2019,"], ["Superb Apple IPhones 11 pro max i love it. Faster performance, awesome camera. Battery life good.nApple for life", "3 users found this review helpful", "5 stars", "05 Oct 2019,"], ["You can feel premium right from unboxing... rose gold is rich and back glass is Matt finish which is patented by Apple.. fast charger charging 50% in 30 mins and battery life is good as of now ... camera is really a pro feature .. go for it", "3 users found this review helpful", "5 stars", "01 Oct 2019,"], ["Camera is not working properly. I chatted with the apple support people this was an software issue. Looking for software update \nOther than that everything was great.", "2 users found this review helpful", "3 stars", "09 Feb 2020,"], ["I dont know why my phone is getting hot with in 5 seconds of a call.", "2 users found this review helpful", "3 stars", "10 Nov 2019,"], ["fully satisfied....shandar phone...", "2 users found this review helpful", "5 stars", "07 Nov 2019,"], ["I am very happy with this product ..this iPhone is incredible...camera , battery ,display ,etc very things is very incredible and excellent..", "2 users found this review helpful", "5 stars", "03 Nov 2019,"], ["Thank you Flipkart for delivering the product on time ! At first , i decided to get the iPhone 11, but truly, i would have regretted that decision. Bought this finally. I have been using this device for a few days now, and i am writing a review based on what i feel. nnAt first, Getting the device on hand made me feel it’s kind of a bit heavy than the old iPhone 8 plus or the Xs Max. The look and design of the phone gives a premium feel in hand.  The display is awesome, and so is the screen resolution. The three camera module captures fantastic images, and it is great for wide angle photography. Speaking of camera, i have noticed, the camera holds the color of the images both in wide angle or telephoto shots, which doesnt seem to happen with other devices.nnNot to mention, the night mode of the iPhone 11 pro max has been drastically improved and it really clicks great images in low light conditions which is impressive! The iOS 13 adds butter to the phone’s UI. Performance wise, there is no issues which i have faced using iPhones these years. The A13 Bionic chip is super efficient and really consumes battery intelligently. nnI think the phone is little over priced, but its okay when you want to have such a premium device in hand. nI’m satisfied with the performance it provides, and I’m completely fit in Apple’s eco system. nnHope this review helps,nnThank you.. 😁", "2 users found this review helpful", "5 stars", "17 Oct 2019,"], ["had to sell my kidney but you gotta do, what you gotta do!", "2 users found this review helpful", "5 stars", "06 Oct 2019,"], ["Great photos", "2 users found this review helpful", "5 stars", "04 Oct 2019,"], ["Better experience than Andriod, but some things need to be changed. When we are on a call the other sim goes offline, While calling there should be separate buttons to call from the primary or secondary sim so that we can call just by touching that. Speed dial must also be there so we need not search the contact each time we call.", "1 users found this review helpful", "5 stars", "21 Feb 2020,"], ["Since October I have been using the 3 products, i.e., iPhone 11 Pro Max, Apple Watch 5 and the Airpods with wireless charging case without any problems yet...My Apple Family is Smothering in terms of performance and usage.", "1 users found this review helpful", "5 stars", "05 Feb 2020,"], ["It’s an apple iPhone and that too the latest apple iphone 11 pro max.... it’s the best in the world. Period", "1 users found this review helpful", "5 stars", "31 Jan 2020,"], ["awesome delivery experience\ntime to time delivery\nprice little bit high\nbut overall best\ngo for it", "1 users found this review helpful", "5 stars", "19 Dec 2019,"], ["Brilliant camera , but has some hanging problem 😒", "1 users found this review helpful", "4 stars", "10 Dec 2019,"], ["awesome", "1 users found this review helpful", "5 stars", "24 Nov 2019,"], ["impressively Nice......\nOne of the greatest iPhone i ever used ....\nAll was like Never before ...\nit's just Amazing ...\nBattery Life is too good ...2 Days with hevy used\nCamera also like Apple Quality best ever", "1 users found this review helpful", "4 stars", "07 Nov 2019,"], ["Awesome performance of camera & Display. \nI really appreciate to Steve jobs. For I phone products.", "1 users found this review helpful", "5 stars", "06 Nov 2019,"], ["Falling in live with the apple navigation system", "1 users found this review helpful", "5 stars", "25 Oct 2019,"], ["excellent mobile from apple... love it", "1 users found this review helpful", "5 stars", "19 Oct 2019,"], ["Great product from Apple 😘😘", "1 users found this review helpful", "5 stars", "15 Oct 2019,"], ["nothing new. looks like 2 years old", "1 users found this review helpful", "1 stars", "01 Oct 2019,"], ["Beautiful", "0 users found this review helpful", "5 stars", "19 Feb 2020,"], ["Very very good product", "0 users found this review helpful", "5 stars", "17 Jan 2020,"], ["Best if you don’t think much of money", "0 users found this review helpful", "5 stars", "12 Jan 2020,"], ["Fully satisfied.....but Flipkart wants to improve the packing quality ,its too bad", "0 users found this review helpful", "4 stars", "08 Jan 2020,"], ["good", "0 users found this review helpful", "5 stars", "07 Jan 2020,"], ["Great phone & thanks to Flipkart for fast delivery", "0 users found this review helpful", "5 stars", "06 Jan 2020,"], ["It’s my 7 IPhone in row & upgraded it with X & I can say that it’s superb!! Flipkart is awesome provided product before time.", "0 users found this review helpful", "5 stars", "04 Jan 2020,"], ["awesome awesome awesome", "0 users found this review helpful", "5 stars", "14 Dec 2019,"], ["Not bad But iPhone XS is too good", "0 users found this review helpful", "4 stars", "13 Dec 2019,"], ["Wow", "0 users found this review helpful", "5 stars", "02 Dec 2019,"], ["It is not a just a gadget its a universe to explore.", "0 users found this review helpful", "5 stars", "26 Nov 2019,"], ["iphone 11pro max is really a new generation iphone ...camera is amazing", "0 users found this review helpful", "5 stars", "15 Nov 2019,"], ["Apple TV is free for 1 year plus this is a great product especially the camera is legend- wait for it ary!!!", "0 users found this review helpful", "5 stars", "15 Nov 2019,"], ["Phone is superb \nBut delivery is very late", "0 users found this review helpful", "5 stars", "14 Nov 2019,"], ["Out of the world!!  Unique of its kind.. No further review required of it, APPLE defines it all.. 😍💓 Original product..", "0 users found this review helpful", "5 stars", "13 Nov 2019,"], ["Excellent", "0 users found this review helpful", "5 stars", "10 Nov 2019,"], ["super but price over", "0 users found this review helpful", "5 stars", "09 Nov 2019,"], ["if u not have money problem u buy without any singhal thought", "0 users found this review helpful", "5 stars", "08 Nov 2019,"], ["Value for money", "0 users found this review helpful", "5 stars", "07 Nov 2019,"], ["Fantastic phone in every way!", "0 users found this review helpful", "5 stars", "04 Nov 2019,"], ["Excellent", "0 users found this review helpful", "5 stars", "25 Oct 2019,"], ["genuine product from supercomnet thanks to flipkart", "0 users found this review helpful", "5 stars", "25 Oct 2019,"], ["Excellent Value", "0 users found this review helpful", "5 stars", "20 Oct 2019,"], ["Awesome totally happy with it thanks flipkart ✌🏻", "0 users found this review helpful", "5 stars", "19 Oct 2019,"], ["good", "0 users found this review helpful", "5 stars", "18 Oct 2019,"], ["Very good phone and Flipkart did a great job in delivering it in the specified time.", "0 users found this review helpful", "5 stars", "17 Oct 2019,"], ["Best phone ever", "0 users found this review helpful", "5 stars", "10 Oct 2019,"], ["My 10th iPhone and I just can’t seem to get enough of this model. By far the best iPhone ever made, Battery & camera quality is top notch. I’ve always wanted to buy a DSLR but I think I shall pass...", "0 users found this review helpful", "5 stars", "07 Oct 2019,"], ["Very bed delivery person. His behaviour is such that I made very big mistake to buy product from flipkart. A panic experience of logistics ekart.", "0 users found this review helpful", "1 stars", "04 Oct 2019,"], ["Best device ever. Performance is adequate. Only it has minor change as compare to iPhone XS Max like 3 x camera lenses but cost is super expensive", "0 users found this review helpful", "5 stars", "02 Oct 2019,"], ["Great phone!!", "0 users found this review helpful", "5 stars", "01 Oct 2019,"], ["Very good phone impressed", "0 users found this review helpful", "5 stars", "01 Oct 2019,"], ["As usual.", "0 users found this review helpful", "5 stars", "30 Sep 2019,"], ["Excellent pre order buy!", "0 users found this review helpful", "5 stars", "30 Sep 2019,"], ["All I can say is WOW!! nCamera is simply mind blowing!! Night mode is excellent.nBattery backup was a cause of concern on iPhones but this phone washes of that bad reputation. Excellent battery backup. Overall an excellent package.", "0 users found this review helpful", "5 stars", "30 Sep 2019,"], ["All I can say is WOW!! nCamera is simply mind blowing!! Night mode is excellent.nBattery backup was a cause of concern on iPhones but this phone washes of that bad reputation. Excellent battery backup. Overall an excellent package.", "0 users found this review helpful", "5 stars", "30 Sep 2019,"], ["Nice mobile", "0 users found this review helpful", "3 stars", "30 Sep 2019,"], ["Liked the phone’s specifications and definitely the design in midnight green colour.!", "0 users found this review helpful", "5 stars", "30 Sep 2019,"]]},
"Samsung Galaxy Note 10 Plus":{"rating": "4.6", "based_on": "924", "reviews,useful,rating,date": [["awsome mobile. great accuracy and dispaly. everything in that phone is so good.", "30 users found this review helpful", "5 stars", "19 Oct 2019,"], ["ver nice simple super", "16 users found this review helpful", "5 stars", "16 Sep 2019,"], ["my wife gifted me this phone recently.. amazing phone i liked it ..display and camera are its best ..the s pen features are really good like swiping and making gestures in air ..those work really good.", "4 users found this review helpful", "5 stars", "19 Oct 2019,"], ["battery very bad only half a day", "3 users found this review helpful", "1 stars", "20 Oct 2019,"], ["Awesome phone. Smooth. Good Camera. No lag while playing games. Samsung UI as usual best. The best phone you can buy now.", "2 users found this review helpful", "5 stars", "26 Oct 2019,"], ["My self Dr Syed Hasib...i have got my galaxy note 10plus on 12 th of october..delivery was on time...i have got the best handset till now..regarding all conditions...i was an iphone user but shifting to note 10 plus made me more confortable in all aspects...hd big screen...super battery life...user friendly....and above all...the LOOKS ..are awesome🥰..camera quality is great both rear and front...speakers are really stereo...i loved the handset...❤❤", "2 users found this review helpful", "5 stars", "25 Oct 2019,"], ["The best combo available in town. Just feel super awesome writing this review. Let's get into the details.\n\nDisplay: \n1. Super crisp display\n2. Instantly adaptive to various light exposures\n\nOS: \n1. OS is buttery smooth (The main reason I pay premium for Samsung note series)\n2. Practically no lag noticed with heavy multitasking\n\nBattery:\n1. Only Samsung can excel this area. Hugely immersive display juiced up by small battery that stands a full work day with 30 percent left\n2. The speed of this fast charger is like an F1 car\n\nS Pen:\n1. I want to see the day when the tip of the S Pen becomes like a mechanical pencil. Mind-blowing thin tip that feels really like writing with a pen\n2. The gestures work like magic\n\nAura Glow back:\n1. I added a matte finish sticker from online sources to further accentuate the glittery back\n2. With or without the sticker it does the reflections with perfection \n\nCamera:\n1. No comments required since it diligently does what it should be capable of be it night or day.\n2. The ToF camera is used by a native app Distance Measure to measure the distance from phone to the object it's pointed. Practically useful at times.\n\nOverall:\nEvery time I buy a note and use for a month I feel, 'This is it. There is nothing more that can be done by Samsung. They have reached the saturation limit'. Every year round, Samsung beats me hands down with their creativity, technology and perseverance. This is a game I love to lose every year that passes by.\n\n\nPlease note: I have intentionally not added images taken from my note 10 plus like every reviewer does. (It's wrong to ask a fish to demonstrate swimming to be called a FISH). Samsung the world leaders they are.", "2 users found this review helpful", "5 stars", "24 Oct 2019,"], ["Bohot Hard.. Bohot Hard.. It's Amitabh Bachan  of phone-wood..Tall, smooth, future ready and sublime with its performance.. you just ask it and Samsung Genie will be at your doorstep to serve his Akka..No disappointment at all.. Thank you Samsung and Flipkart.. You guys Rock!! Wooo-Hooooh!!", "2 users found this review helpful", "5 stars", "16 Sep 2019,"], ["good phone but samsung should have  provide ear buds as the price is high", "1 users found this review helpful", "5 stars", "23 Nov 2019,"], ["This is my third note experience and i have used each of my note device for atleast 2-3 years. This is the most amazing and refined note experience i have had by far. I am a very heavy business user who uses his phone for note taking, ppts, emails and at the same time i am a cartoonist by hobby which makes this the most ideal device for my use case. Having said that, i believe everyone will find that their unique requirement can be met by this device as it has everything.\n\nKey positives\n1. Great Versatile Camera system with excellent color science.\n2. Note taking with excellent handwriting recognition, Word and MS Office integration.\n3. The best display and multimedia experience.\n4. The smoothest galaxy experience with seamless ecosystem integration (Galaxy buds and watch). Infact the buds and note 10+ are a perfect pair for a business user. This negates to a certain extent the omission of headphone jack which i still dont support.\n5. Bixby Routines is a very very powerful automation tool for the users. I have automated my battery management, screen resolution shifting, device sync operations, location enabling only for select apps and so on. this is a tool which they should advertise more as its a unique feature of One UI.\n6. Battery life is where it this truly lives up to the note name. your milage may vary but easily consider 1-1.5 days of usage. this is based on my heavy use case.\n\nMy one suggestion, get the aura glow color, the color shift is not as aggressive as its visible on certain videos and reviews. Its has a mirror finish with a pleasant shimmer to it.", "1 users found this review helpful", "5 stars", "25 Oct 2019,"]]},
"OnePlus 7T":{"rating": "4.5", "based_on": "3,093", "reviews,useful,rating,date": [["Overall phone is good.... but issue is only one that's we are not carry this phone easily.. \n\n& also colour issue.. like only 2 available hazeblue & McLane which is special edition. \n\nblack is damm good .", "33 users found this review helpful", "5 stars", "14 Nov 2019,"], ["it's too difficult to carry, but the camera, audio, display, performance was good.", "29 users found this review helpful", "5 stars", "01 Jan 2020,"], ["Very pleased with the phone", "10 users found this review helpful", "5 stars", "29 Dec 2019,"], ["best value for money phone", "3 users found this review helpful", "5 stars", "02 Jan 2020,"], ["Very smooth handset..", "1 users found this review helpful", "5 stars", "17 Feb 2020,"]]},
"Apple iPhone 11":{"rating": "4.7", "based_on": "12,796", "reviews,useful,rating,date": [["Check image quality", "388 users found this review helpful", "3 stars", "07 Nov 2019,"], ["It’s been almost a month since I have been using this phone. I upgraded from an iPhone 8. The main issue with my 8 was battery and this phone is just awesome when it comes to battery. It lasts a day and a half for me with my regular use , internet connected always with 4g nCan’t move forward without saying this. Battery of this phone is a life saver when I am traveling or at work when I don’t get the option to charge nCamera is superb. Front cam selfies and back cam photos are just awesome. nSince i came from the smaller phone category which was an iPhone 8 , I found it difficult to adjust first with the size of this phone, but after the days of usage, I got very much used to it. nWatching a video or reading online is awesome with this bigger screen. nI am very much happy with this upgrade nI am adding few photos I have clicked. Night photography is awesome nThe pic in which the guy is stading was clicked at midnight 1.", "47 users found this review helpful", "5 stars", "16 Nov 2019,"], ["Very nice and value for money product bought it for only rs 42300 on flipkart using Hdfc bank credit card", "29 users found this review helpful", "5 stars", "08 Oct 2019,"], ["Better than my Pixel 3 XL", "22 users found this review helpful", "5 stars", "04 Oct 2019,"], ["Amazing!!!\n\niPhone 11 is love.", "16 users found this review helpful", "5 stars", "17 Nov 2019,"]]},
"Nokia 9":{"rating": "4.2", "based_on": "29", "reviews,useful,rating,date": [["So far good.i expected more,", "20 users found this review helpful", "5 stars", "03 Mar 2020,"]]},
"LG W30":{"rating": "3.6", "based_on": "1,976", "reviews,useful,rating,date": [["Better than this range mobiles. Screen resolution and performance are more than expectations. High Value for money.           ", "332 users found this review helpful", "5 stars", "06 Jul 2019,"], ["Beautiful phone at best range           ", "330 users found this review helpful", "5 stars", "05 Jul 2019,"], ["Value for money....Best camera phoneSuperb lookingLight weightAmazing performance.....           ", "315 users found this review helpful", "5 stars", "05 Jul 2019,"], ["I always check for the battery first and 4000 mah means more game time , more taik time more browsing , more music and vedios. Feeling crezy!!!           ", "312 users found this review helpful", "5 stars", "13 Jul 2019,"], ["Lovely phone, Camera quality is awesome, Nothing is bad.           ", "307 users found this review helpful", "5 stars", "07 Jul 2019,"]]},
"Blackberry Evolve":{"rating": "3.6", "based_on": "3,611", "reviews,useful,rating,date": [["Can't even imagine I bought blackberry evolve for Rs16990...blackberry has done a wonderful job with the product. it looks so classy and yet so stylish..                    camera- I was surprised with the camera performance..dint expect it to be so perfect..                        battery- good enough to keep you engaged whole day", "109 users found this review helpful", "5 stars", "25 Feb 2019,"], ["very poor quality", "46 users found this review helpful", "5 stars", "25 Feb 2019,"], ["blackberry always good.", "44 users found this review helpful", "4 stars", "26 Feb 2019,"], ["the Best value for money product with unparalleled Blackberry security, extensively using for last 72 hours and it has performed way beyond expectations.  at this price it is steal and suggest not to go for any local Chinese brand and best part MADE IN INDIA", "42 users found this review helpful", "5 stars", "27 Feb 2019,"], ["Phone that I got is way beyond my expectations,this would be my 3rd phone in BlackBerry, All three gave me different experiences, like an iPhone ,BB stands out of the crowd ,Touch of the phone is very sensitive compared to all other phones, phone is just amazing .", "30 users found this review helpful", "5 stars", "11 Mar 2019,"]]},
"Blackberry Priv":{"rating": "3.5", "based_on": "1,343", "reviews,useful,rating,date": [["Welcome back BlackBerry!nnOther than the Indian price, everything about this phone is worth talking about. Wait for a price cut and get it, totally stylish slider with substance, power specs, Got mine from the US.nnAnd they added their own nice touches to make it the best Android interface view, even better than stock Android - pop up widgets, Hub, productivity edge, battery indicator along the edge. Virtual keyboard's intelligent suggestions is way better than Swype. You can also use the physical keyboard as a trackpad.nnHigh end, really liked it and am happy that I switched from the iPhone.", "79 users found this review helpful", "5 stars", "15 Feb 2016,"], ["This pricing itself denotes end of BB era in near future. BB missed their last chance to stand in market because of this pricing.nEven 007 features is not so important when it comes to affordability. Some BB fans will claim BB is not for all. Yes! not for all so only they are having a drop down in sales.nPricing around 30-35k will hold good.", "37 users found this review helpful", "1 stars", "08 Mar 2016,"], ["I am using priv from March.. With MM update the phone is more stable and great productivity gadget. use it you will not regret it. I was moved from passport and other blackberry flavors. Little disappointed on during change. Now its works like anything,no lag and with Asus zenwatch2 all hub notifications works perfectly. Great combo now. BB the Best. Frankly its meant for Enterprises and who really wants the productivity+ organized. Now mobile hardware is common and cheaper, Software makes the difference with USP(tailor made android). Hence it is pricey.. nPros:nBattery stays full day with moderate usage( mail,browsing)nDisplay claritynVolte SupportnBB software Ecosystem nCons:nNo blend( u have use Air droid)nAccessories are costly and not available in India. Need to get from US.nNo ad by blackberry to increase sales..", "24 users found this review helpful", "5 stars", "14 Apr 2016,"], ["Dear friends,nnBlackberry, this is a wonderful smartphone. Fantastic and fabulous one. Excellent and exceptional one. Hope many people assumes that blackberry is tough to handle and it is only for certain segment of people. No. Its a jinx created. nnThis phone is above all and exceeds the expectation on all aspects. Those who claimed that they are advanced in smartphone technology, I believe, those features are inherited from blackberry.nnBLACKBERRY is the best.", "22 users found this review helpful", "5 stars", "11 Apr 2016,"], ["If u are a Android fan go for BlackBerry privnThis is a best Android phone in the world.. worth to buy it..", "18 users found this review helpful", "5 stars", "04 Sep 2016,"]]},
"Sony Xperia XA1":{"rating": "3.6", "based_on": "6,253", "reviews,useful,rating,date": [["Guys belive me this is the best phone at this price. Using from 1 week n1.Camera quality is best of best. n2.Battery may be 2300 but feels like 4000mah.n3.The design of the phone is best. Feels like Samsung s6 edge. nn4.Phone is super fast .nnYou will never feel regret for paying 20k. I am just enjoying it. Believe me go for it guys.", "357 users found this review helpful", "5 stars", "04 May 2017,"], ["I love this mobile very much... Sony has given a very good product but it has failed to update the new features... Camera was ok but doesn't. Meets the expectations... Phone getting hanged... Overall good one but not upto the level", "76 users found this review helpful", "3 stars", "28 May 2017,"], ["Too many problems with mobile ..n1> Touch screenn2> Performance issuen3> Camera will shutdown automatically n4> Mobile will get heated after couple of hours nI'd suggest that people/ customers don't buy this mobile and that too from Flipkart retailer .. As i mentioned that , started facing the issues from the 11th day onwards but when i called to fliplkart looking for help . Fliplart customer executive said that \"sorry we won't help since it crossed the 10 day return policy\" .. nStill, if you're planning to buy the xperia XA1 mobile then please check out in other retailer sites .. They support until customer get satisfied with the product either by contacting the vendor/manufacturing", "71 users found this review helpful", "1 stars", "08 Jun 2017,"], ["Camera performance is goodnBattery 🔋 backup avgnnnWhat's the worst mobile ever seen,touch is not working properly, plz solve my issue, i want to complaint on Sony and flipkart in consumer Court", "66 users found this review helpful", "2 stars", "02 May 2017,"], ["Little highly but worth it because Sony never compromises in quality.also don't worry about hd display because it looks good than any other smartphone with full HD display, because Sony are so good in displays and camera and also don't bother about battery and processor because battery is so efficient than any phone with 5000 mah battery and processor is just awesome in performance and no heating .so mediatek now a days is just better than all worst and heating processors snapdragon.so mediatek processor is better", "51 users found this review helpful", "5 stars", "28 Apr 2017,"]]},
"Lenovo Z2 Plus 64GB":{"rating": "3.5", "based_on": "11,282", "reviews,useful,rating,date": [["Superb Phone. loved it. nnExcellent screen, compact size, fast n furious, good sound, Mind blowing battery back up. nnOnly concern is camera quality.", "95 users found this review helpful", "5 stars", "27 Jan 2017,"], ["The phone has everything an average smartphone user needs today starting from 4G, sleek finish, fingerprint scanner, camera, huge battery backup etc. It is the best deal one can get under Rs 20000/- today. Go for it.", "69 users found this review helpful", "5 stars", "19 Jan 2017,"], ["Every boy has some dreams that they know will never come true.Like dating deepika, driving a hot red ferrari or owning a flagship phone of a reputed company under 15k. But thanks to flipkart one of them has come true!!nIn a time where phones can be mistaken for TV, the compact form is a breath of fresh air. Fits snugly in one hand and in pocket. The black model is really elegant in a quiet manner.The matte back cover provided actually enhances the beauty of the phonenNot much to say about performance....snapdragon 820+adreno 530 really breezes through everything 130000 antutu score testify to thatnThe home button is truly unique with multi gesture support, takes a little time to master it but after that you wont want to use anything elsenBattery is adequate for 1 day of heavy usage....may drain a little quickly when the phone is newnCall quality is crystal clear..data speed is excellent. Even my old 3g sim is giving 500kbps speeds....just think what this beast will do with 4g nBut everything in life has some cons, so does this phone nCamera while good in day light , really struggles in low light no OIS, laser autofocusnNo fast charger in box though it supports fast chargingnPhone gets a bit hot while doing extensive heavy gaming nAll in all after exchange price of 14k, there is hardly any better phone for people who likes compact sizes.And with nougat update in the horizon, reasons for not opting for this monster are really very few.", "29 users found this review helpful", "4 stars", "21 Jan 2017,"], ["The phone is great when i compare to my previous Lenovo k5 note this Z2 is awesome but the phone will overheat soon ! But the performance is excellent and sound quality is very good. Speaker output is low but headset is very good. Good bass and clarity than compared to Lenovo k5 note . No doubt go for it guys!", "28 users found this review helpful", "5 stars", "03 Feb 2017,"], ["Amazing phone, the software has some issues , it is very clumpsy in terms of layout.nPlus camera isnt great i have heard ...i dont use camera much so i feel it is good for normal pictures ..in good light it took phonts beter tham my friends moto G4Plus ...nEven design some people dont like ...but i love the simple design .. this phone blends in ...so well ...nIts not so.ethig you show off ...it is something that performs !!!!!nOther than these 2-3 problems ...which did not bother me but can bother you ...everything else was flawless ...nIt doesnt get more heated than 42 degree no matter what you do ...nPerforms flawless ...nSpecs are over the top notch for the price they are giving it off for ...nAmazing stuff ...", "21 users found this review helpful", "5 stars", "23 Jan 2017,"]]}}