{"rating": "4.6", "based_on": "395", "reviews,useful": [["Got Huwaei P30 Pro aurora 8GB/256GB yesterday with GT sport watch.The phone- It is beyond camera.Zoom ultimate, as good as you got hold of moon. Super night photography the sky comes on ground with normal stable hand stars gets captured in your phone. Performance unmatched, speed excellent super fast, battery powerful. In totality this is the world's best and top most mobile ever launched and used. 100 out of 100. Rest you need to try on your own for sure!           ", "186 users found this review helpful"], ["Got Huwaei P30 Pro aurora 8GB/256GB yesterday with GT sport watch.The phone- It is beyond camera.Zoom ultimate, as good as you got hold of moon. Super night photography the sky comes on ground with normal stable hand stars gets captured in your phone. Performance unmatched, speed excellent super fast, battery powerful. In totality this is the world's best and top most mobile ever launched and used. 100 out of 100. Rest you need to try on your own for sure!           ", "121 users found this review helpful"], ["Awesome phone. Stellar battery life. Excellent low light photography.Only major con for me was emui.           ", "88 users found this review helpful"], ["Awesome phone. Stellar battery life. Excellent low light photography.Only major con for me was emui.           ", "78 users found this review helpful"], ["Best camera phone in the market. Low light photography is magic. So is zoom on a phone.Design of the phone is top notch.Feels and looks like a flagship.Battery is amazing. Lasts two days on normal usage.Cons: edge display makes accidental touches. EMUI is not as good as stock Android.           ", "68 users found this review helpful"], ["Best camera phone in the market. Low light photography is magic. So is zoom on a phone.Design of the phone is top notch.Feels and looks like a flagship.Battery is amazing. Lasts two days on normal usage.Cons: edge display makes accidental touches. EMUI is not as good as stock Android.           ", "54 users found this review helpful"], ["Wanted a new phone,so went through lot of tech articles and YouTube reviews. Finally it boiled down to 2 phones that being S10+ and Huawei P30 pro.Finally decided on buying P30 pro as it had better battery.So I bought it.Now the issues(After a few hours of recieving the phone)- Wireless charging- when I placed the phone on my fast wireless charger, it showed charging. Then after 1 hour, no charge at all. Instead it dropped a level!! 16% charge became 15% after an hour. I was little confused. So I changed my charger brick and decided to use the charger given by the company. Same result, no charge.Then I used cable charging with a fast 2.0 (Qualcomm certified) charger. Same result. Negative charging.Now I changed my charging brick to one given by the company. Finally it charged.Then again when the level fell below 18%, tried wireless charging. Same result. No charging/negative charging.I am really confused as to what is wrong??Have called for an engineer from Amazon.Then when he checks for the problem,will order for a replacement.One more thing. Auto mode takes better picture than Night mode.(My unit).Will keep this review updated till my issues are solved.           ", "39 users found this review helpful"], ["Product arrived as promised one next to next day of ordering.On opening the box, seriously I was stunned.It took some time to get knack of it. But once I used it, I loved the emui.Design is superb,Display is awesome,Feel is premiumIt's not slippery, though use the case provided.Battery backup is great.Camera is all rounder. Sample shots attachedCharging is crazy fast.No lag issues.And the more you use it, more you gonna love it.           ", "38 users found this review helpful"], ["User experience is worst , i hate the emui os , heating problem trash phone                                       ", "37 users found this review helpful"], ["I've been debating over buying a phone for quite a while. I saw that this phone was not due to be released till the 15th. I couldn't wait, I had ordered it from aliexpress. There were delays in shipping them out so I ordered one from Amazon. I personally don't like Samsung phones. I've been using pixels since they were launched and I was amazed by the low light shots it could take. The huawei phones pretty much flew under the radar and didn't seem much of an upgrade.This phone changed everything.The camera is good, low light shots are incredibly detailed. I can see the freakin moon with the craters (almost) without my telescope (celestron astromaster 130eq Md). The ai scene identification is accurate. Videos are average though.  The camera has tons of modes and a very customizable manual mode.The UI needs a little getting used to from a stock android user perspective.  The voice call quality for both the acoustic display and the microphone are very good.Gaming is a blast, I could game for 3hours of Pubg before the phone needing a recharge. The 4200mah battery and the supercharger make life so much better.The display is fhd plus. You should have no issues playing 4k videos downloaded from anywhere.You can connect the phone to the TV using a USB 3.1 to hdmi adapter and use it as a chromebook. Wireless also works but there is a little bit of latency, which is to be expected. You can also game this way.Overall I'm very very satisfied with the purchase. Its and blind buy. Multi tasking is a breeze.To get most of the battery, use a dark theme and a black wallpaper as this is an AMOLED display.           ", "31 users found this review helpful"]]}{"rating": "4.4", "based_on": "438", "reviews,useful": [["Great Great Great in all department. Speed, camera, battery, design, and look.           ", "12 users found this review helpful"], ["Wow worth it, even though I was using iPhone 8 before this           ", "5 users found this review helpful"], ["Wow worth it, even though I was using iPhone 8 before this           ", "5 users found this review helpful"], ["This phone is the best in market right now. Using it for past few months no problems whatsoever. No glue gate nothing.Service is excellent.I was not finding smart cover for the fone anywhere in my city, I came across guys working with Huawei who were on a visit in a Croma store and told them this problem. One of them took my no and to my surprise I got a call today saying they have got the genuine phone case all the way from China.What could be better service than this?Amazed.           ", "5 users found this review helpful"], ["This phone is the best in market right now. Using it for past few months no problems whatsoever. No glue gate nothing.Service is excellent.I was not finding smart cover for the fone anywhere in my city, I came across guys working with Huawei who were on a visit in a Croma store and told them this problem. One of them took my no and to my surprise I got a call today saying they have got the genuine phone case all the way from China.What could be better service than this?Amazed.           ", "5 users found this review helpful"], ["I ordered the product twice during two sales and I received a defective product on either purchase. I also sought a replacement device during this 3 day sale and the replacement also had the same issue. The issue seems to be persisting in devices manufactured during March 2019 (as my devices were found to be done during that time). The seller should probably separate out the products manufactured during that month and return it back to Huawei center..           ", "4 users found this review helpful"], ["Good           ", "4 users found this review helpful"], ["Good           ", "4 users found this review helpful"], ["Worse brand to buy.. within a week the price drop.. worse than Samsung.           ", "4 users found this review helpful"], ["Mate 20 Pro is an ultimate multiuse mobile phone.Amazing camera, good stabilization and low light photos,Beautiful quad HD OLED screen,Superb battery life,Audio quality is also better than most flagship phones, but little low.Very handy,Beautiful color.My only gripe is that it is available only in Twilight colour and not in Emerald Green which has a vinyl like texture on the back which might have given more grip to the phone and also less fingerprints on the back.I've been using it's iphone like Face ID more than it's optical fingerprint sensor inside the screen, as it is more accurate, quick and easy to use and unlock the device.Even though it had curved edges, no functionality and usability like Samsung Galaxy Edge quick app launchers, etc.Kirin 980 maybe better than Snapdragon 845. I've two SD 845 mobiles, one is LG G7 4GB version and the other is Vivo Nex 8 GB version. Mate 20 Pro is better than both, at least more snappy than G7 and some times better than Nex. It's a performance beast with 6 GB RAM, wish they've given 8 GB RAM though.Overall, a very well balanced feature rich mobile.It took me a while to get convinced to buy this, instead of Galaxy S10. Indian version of Galaxy S10 models have Exynos chips, which aren't that great compared to its Qualcomm Snapdragon counterparts.So, whoever are planning to buy any Galaxy S10 models consider this instead.Thank you Amazon for the next morning delivery.           ", "4 users found this review helpful"]]}{"rating": "4.1", "based_on": "3,460", "reviews,useful": [["nice product           ", "3 users found this review helpful"], ["It   s value for money but audio quality is not up to the mark.           ", "1 users found this review helpful"], ["This mobile is very stylish and fast processing           ", "1 users found this review helpful"], ["This product only better in memory it's battery life is very pathetic condition while is not even using           ", "1 users found this review helpful"], ["Phone has hanged many times and once it gets hung, it will take 2-3 hours to restart the phone. We will be helpless during this period.           ", "1 users found this review helpful"]]}{"rating": "4.5", "based_on": "844", "reviews,useful": [["A good gift for my wifenTOP 1: Leica Certified Lens nLeica, known for fine German craftsmanship and reliable quality, has been held as a legendary brand in the world of photography. Fans of the brand praise these lenses for blowing life into photos. When describing excellent lenses we use phrase like “high permeability” or sentence like “capture the sense of airiness in the picture.” High permeability here is easily understood while “airiness” takes time to come across. nAiriness refers to unparalleled resolution and restoration capability that Leica lens possesses.nLeica lens captures micro details in dark areas, with no overexposure in bright areas, and presents richer and smoother color saturation, bring airiness to photos. nLeica uses low-contrast lens, giving photos more details in tonal value. An additional advantage of shooting with a Leica is that there’s more room for editing even though in the same RAW format. Leica RAW format photos have greater tolerance than RAW photos shot by any other brand’s camera on the market, hence greater color range to adjust in post-production.nLeica lens’ color performance and capability to suppress high brightness gives photos richer details and greater color saturation. By reducing the high brightness, Leica lens captures richer colors than human eye. The optics and coating technologies of Leica lens ensures greater light control, thus details can be preserved and photos are more color dynamic.nP9 features the Summarit camera lenses from Leica, subject to stringent quality screening by engineers at Leica in accordance with the most demanding quality criterion. nTOP 2: Leica Picture Quality: Clarity, Details, Color & SNRnRGB camera (color) is for recording color information, and the monochrome camera (mono) is for capturing silhouettes and details in high resolution. The light sensitivity and resolving power of monochrome camera are superior due to the absence of color filter. Dual camera solution combines strengths of monochrome camera and RGB camera that lead to better image quality. nEvery Picture output can Produce Signature Leica Color and Monochrome sharp Outputs for every Click , With a merging Algorithm running on QUAD Core ISP.nTOP 3: Dual CameranTwo Customized 12-megapixel sensors – one RGB color and one black and white – allows the P9 to capture up to 50 percent more detail and 300 percent more light than conventional single-camera smartphone designs. nP9 Features Pixel size of 1.25 µ m, Dedicated QUAD Core ISP, Virtual Aperture up to F0.95 , Better Bokeh effect than entry level DSLR.nnTOP 4: Image algorithmnHuawei’s proprietary IMAGESmart 5.0 algorithm, designed to work seamlessly with the dual-camera architecture to create pictures with enhanced color and detailnnTOP 5: World First Smartphone with Dedicated Depth Sensor nWorld’s first smartphones to ship with built-in depth measurement integrated circuits, resulting in faster image focusing and processing speeds. nDedicated Depth Measurement chip also helps improve power consumption and smartphone performance by reducing the workload of the central processor (CPU).nnTOP 6: Hybrid Focus Technology nHuawei’s proprietary Hybrid Focus technology, Leverages three sensors – laser, depth and contrast – to determine the best focus for each photo taken and to yield the highest-quality result. nnTOP 7: Large AperturenLarge-aperture photography function on the P9 and P9 Plus enable users to experiment with innovative imaging effects, making the background appear out of focus while accentuating the main object.nnTOP 8: Leica Film modenThree Leica film modes for their cameras: Standard, Vivid Colors and Smooth Colors. Each film mode faithfully reproduces the authentic colors of Leica, capturing the unique style of LeicannTOP 9: Better SelfiesnAutofocus in the front camera for better selfies , Instant Preview.nnTOP 10: Industry DesignnSuperior-grade 2.5D glass and an aerospace-class aluminum unibody, featuring diamond-cut edges rounded out by carefully balanced curvatures, 6.95mm in thickness.", "136 users found this review helpful"], ["Amazing phone, with the most beautiful camera! One of the finest I've used on a phone.. Not even a single complaint so far.. Simply amazing!", "98 users found this review helpful"], ["Super mobile...", "81 users found this review helpful"], ["Ordered it from Flipkart on the day it was launched. Have to say, the screen is awesome (even though its 'only' 1080p). Did some indoor shooting. Camera is comparable to S7edge - both have their pros and cons. Selfie camera is awesome though - nice balance between making the selfie look unnatural and hiding very obvious blemishes of skins. UI is good and easy to use. No issues encountered till now. Battery easily lasts a day even on heavy usage (no gaming though).", "77 users found this review helpful"], ["Received within 24hrs from ordering the product.nPackaging was done very well!nGreat seller!nGreat phone!nVery comfy to use.nVery smooth.nCheers Huawei!nVery good pace for a wonderful mobile phone company!", "66 users found this review helpful"]]}{"rating": "4.3", "based_on": "17,592", "reviews,useful": [["I have got hands-on experience with this phone, I would urge you to take my review just as an opinion. However please do not come to a conclusion on my review.Pros:   Great EMUI SKIN, looks fresh and neat   Great Multi-Tasking performance   Great Style and lightweightCons:   Lacks L1 Support   Bad Battery Life   No 4k Video recording   Bad Camera's with bad picture quality(forget about low-light)Verdict:The phone manages to handle productivity tasks with ease and can also hold its own when it comes to gaming. EMUI is loaded with features, which offers some value over stock Android. The cameras take a hit though. It's your call regarding a purchase decision.           ", "69 users found this review helpful"], ["Awesome product           ", "36 users found this review helpful"], ["Iam giving it only 3 stars, because there is no slow motion and image stabilization in video           ", "33 users found this review helpful"], ["Camera quality is not good and amazon is not ready to return the honor 20i so that i can buy another mobile, i had wasted my money on this mobile and amazon too           ", "32 users found this review helpful"], ["See the product in description and see the product photo the seller has provided.Honor 20i comes with 3 Rear camerasBut the phone he is showing has only 2 camera           ", "26 users found this review helpful"]]}{"rating": "4.4", "based_on": "61,888", "reviews,useful": [["Very good classic           ", "29 users found this review helpful"], ["Best mobile           ", "10 users found this review helpful"], ["Super Mobile phone number is not working properly and I will be there at the same time I don't and           ", "10 users found this review helpful"], ["excellent phone!           ", "7 users found this review helpful"], ["Good           ", "7 users found this review helpful"]]}{"rating": "4.4", "based_on": "779", "reviews,useful": [["It was my right decision to buy this phone. Its size and build is perfect to hold. I just wanted to get rid of notch. Feels premium. The case given is awesome. Battery charger very fast. Best flagship Killer...Puch hold looks 😘.", "5 users found this review helpful"], ["overall value for money device. Camera quality is really good.", "5 users found this review helpful"], ["The performance of this product is good but after update it will getting to much heat and lost some features from camera like stage lighting. I will totally disappointed from this product I think that Redmi k20 pro better than this device and the cost of redmi phone is low then. honor 20.  That's why I will give 2 Star in review of this product.", "4 users found this review helpful"], ["EVEN I THOUGHT WHICH ONE TO BUY WHETHER,nHONOR 20/K20 PRO/ONE PLUS 7.nBUT THIS IS BETTERnAUDIO - 9nDISPLAY-10nPERFORMANCE-10nDESIGN-10nBATTERY-9nCHARGING-9nCAMERA-9 nThese ratings are based on my view.", "3 users found this review helpful"], ["It's a superb phone so far( I have used it for 3 weeks), performance superfast, camera is very good, no lags, build quality is superb and call quality and the network reception is best so far, Charging is super fast takes around 80 minutes from 10 to 100 %, best part is that its good to hold in hand and super feel...", "2 users found this review helpful"]]}{"rating": "4.3", "based_on": "66,733", "reviews,useful": [["Best performance and camera quality best money of vailue are good and battery is good so all is the best           ", "1 users found this review helpful"], ["The camera quality is not good           ", "1 users found this review helpful"], ["NICE PRODUCT           ", "1 users found this review helpful"], ["Finger print prb           ", "1 users found this review helpful"], ["Worst phone I have ever used. Waste of money. Product screen quality is extremely bad.. To delicate to handle.. Screen quality too bad           ", "1 users found this review helpful"], ["Best           ", "0 users found this review helpful"], ["really Good  Mobile           ", "0 users found this review helpful"], ["Must be with you (honor)Just love it           ", "0 users found this review helpful"], ["It's a very good smartphone with good price. I take it in 9500 only. I thank to Amazon to provide good service.           ", "0 users found this review helpful"], ["Good mobile  .  It's plenty  star.           ", "0 users found this review helpful"]]}{"rating": "4.3", "based_on": "464,187", "reviews,useful": [["Video calling not supported  waste of this product           ", "48 users found this review helpful"], ["I doubt i recieved the duplicate item.I compared with another honor 9 lite and there is a slight difference in the display and speed of the system. I think this product is a clone of the original one.           ", "47 users found this review helpful"], ["very good", "46 users found this review helpful"], ["received the open box item. The phone box was opened previously. See the pictures attached.", "36 users found this review helpful"], ["Ok", "7 users found this review helpful"], ["Best phn in the china and india battery backup is good and gaming graphicsYou should buy this no without doubtI guaranteed", "7 users found this review helpful"], ["Worst phone of the year. Never expected this type of camera from this phone. It's worst. Never buy if you want a good camera phone.           ", "7 users found this review helpful"], ["Don't buy this phone. Has many issues. Hangs a lot. Security settings automatically change and have to be reset manually. I had contacted amazon at first to return it but they redirected me to their technical support team who were not at all ready to accept that there is a problem with the phone. Their tests were however running successful. I faced a loss of Rs.12,500. I bought moto g5 s plus for my dad. It is cheaper than this and much better in performance and functionality. Honor 9 lite only looks cool, nothing else. Dabba phone hai bhai           ", "7 users found this review helpful"], ["Nice mobile & good looking           ", "5 users found this review helpful"], ["Plz don't buy the video recording camera quality is so bad I  dark even in flash only 2 days happened I might suffering plz don't buy wastage of money           ", "4 users found this review helpful"], ["Fantastic... Cheaper and worth your money... Of great quality... I'm writing this review after 3 months of using this phone...  I would recommend this to my friends...           ", "2 users found this review helpful"], ["***WORST CAMERA***WASTE OF MONEY***  Received mobile and unpacked and tested for camera quality.... Image quantity is worst... Going to Return the product... Primary purpose for buying this is for taking good pictures... Not even inserted sim card to test the sound quality....  *** RETURN TO SUPPLIER***           ", "2 users found this review helpful"], ["Perfect phone for this budget.           ", "2 users found this review helpful"], ["Nice", "2 users found this review helpful"], ["I am using this mobile.. Really its not satisfying me...  Completely Battery charging  its taking up to 3hr.. So worst phone.. And after taking a photo.. Upto 10sec it showing loading.....", "2 users found this review helpful"], ["Do not buy thid Chinese item, they are worthless.Cons..1Battery is not that good2Second sim supports only 2G major drawback3 network problem - checked with other mobile4 hybrid slot-so dont go for it.. Apps uses lot memory so need memory slotPros1 camera is good but not best compare to mi2 build is good", "1 users found this review helpful"], ["Dislike this", "1 users found this review helpful"], ["Overall awesomeness.. I've never been this happy with any other phone. I usually kept changing handsets, happened to be an iPhone user for years. After they spoiled it with new updates, almost every one in my group is now an honor user.. We all love the variants we have. Although 9 lite is my fav. Its almost a year now, never been disappointed with it. Beautiful body built, cam, hd, volume, ram management etc", "0 users found this review helpful"], ["Awsmm phone... i'm vrry hppy.thnks amazon            ", "0 users found this review helpful"], ["phone is completed I want to speak customer care", "0 users found this review helpful"], ["This phone is hanging many times when picking the calls, unwanted apps appears automatically even when locked.Contact cannot be sent as attachment in SMS.Many Problems with this Phone.           ", "0 users found this review helpful"], ["Camera is excellent clean and clear pic", "0 users found this review helpful"], ["All the specs are same as described but i received a blue one", "0 users found this review helpful"], ["Very stylish and good display.", "0 users found this review helpful"], ["I was using moto g 4 plus, this product is very slippery and doesn't come with gorilla glass it fel from not more than 2 feet and display got broken, Don't go for this , Also i came to know that dsiplay cost is around 5K which is half the price of the mobile.  I was using the back cover that comes with the moble, still it broke,You shouldn't at all go for this mobile.", "0 users found this review helpful"], ["Perfect rear cam but frod front camra", "0 users found this review helpful"], ["Wo awesome       ", "0 users found this review helpful"], ["Nice oneGood experience with it", "0 users found this review helpful"], ["Camera amazingBut not happy with battery", "0 users found this review helpful"], ["i like this his product i am so happy this is a best phone i am so lucky for this phone", "0 users found this review helpful"], ["Bakwas mobile hein ye .. it a bakwass aur waste mobile Hain I suggest to not buy. . as tht is plastic ... If u drop it it bends n screen will come out by c curve .. I sold it after 2 months buying ..it .. waste mobile ...            ", "0 users found this review helpful"], ["NIL", "0 users found this review helpful"], ["Ok but not upto the mark. ..", "0 users found this review helpful"], ["Exchange with Black Color", "0 users found this review helpful"], ["Nice", "0 users found this review helpful"], ["Well first of, the camera sucks. That was a major letdown. Coming to the other hardware, it was decent for its price. What made the phone good was the Huawei OS, which I must say is the best I have ever seen. Probably the only reason to buy the mobile. I would also advise going for a higher model for the best experience.", "0 users found this review helpful"], ["Face sensor is there", "0 users found this review helpful"], ["Excellent Mobile.Fast and HD Screen.", "0 users found this review helpful"], ["It is good product", "0 users found this review helpful"], ["Amazing phone processor too quick no lags battery life could have been better but last whole day without gaming and videos camera too sharp and vivid images capture too light too handle and jio supported", "0 users found this review helpful"], ["No problem only  problem is when the cover gets inserted on device air is in presence as I uploaded a photoBut still the phone has no matters no complaints gets scratch fast....", "0 users found this review helpful"], ["Key Features    Review Price: 13,000    5.65-inch HD+ 18:9 FullView screen    Kirin 659 CPU    3GB RAM, 32GB storage    13MP + 2MP front and rear dual cameras    Android 8.0 OreoPros    All-screen design for less than 13,000    Crisp 5.65-inch 18:9 display    Camera reasonably proficientCons    EMUI doesn   t show Android at its best    Glass back questionable design decision    Second camera only partially successful    No NFCHonor 9 Lite     DesignSimilar to the Honor 7X that came immediately before it, the Honor 9 Lite seeks to provide the bezel-light appeal of modern flagship phones but at a more affordable price. Honor calls its approach FullView, which basically refers to devices with a higher screen-to-device ratio.Honor 9 Lite     ScreenMaking the front of your phone even more about the display than usual places extra pressure on the quality of the screen itself. Thankfully, the Honor 9 Lite isn   t found wanting in this respect.This is a nicely sized 5.65-inch IPS LCD screen, with decent viewing angles, contrast and strong brightness when you need to crank things up. You   d need to spend considerably more money to find something much better. Meanwhile, a 2160 x 1080 (FHD+) resolution ensures that individual pixels can   t be picked out, to the tune of 428ppi.Honor 9 Lite     PerformanceOne of the reasons Honor phones can often appear to offer more features than many of their budget rivals is because they have access to the cheaper processors of HiSilicon, which is owned by parent company Huawei.In the Honor 9 Lite   s case this means the 2.36GHz Kirin 659 CPU, which is the same chip that powers both the Honor 7X and the Huawei P Smart. It   s accompanied by 3GB of RAM, which is 1GB less than the 7X.The Kirin 659 is a lower-mid-range chip that appears to sit in the middle of Qualcomm   s entry-level offerings. An average Geekbench 4 multicore score of 3644 pitches the Honor 9 Lite well below the slightly more expensive Moto G5S Plus (with its Snapdragon 625) on 4460, but well above the similarly priced Moto G5S (packing a Snapdragon 430) on 2294Honor 9 Lite     SoftwareJust like the similarly specced Huawei P Smart, the Honor 9 Lite runs the latest version of Google   s mobile OS, Android 8.0 Oreo. This is a good thing.Honor 9 Lite     CameraRather impressively for a budget phone, Honor has managed to follow the Honor 9 and Honor 7X and equip the Honor 9 Lite with a dual camera setup. In fact, it   s gone one step further and provided a similar provision for selfies.Both the front and rear of the device play host to one 13-megapixel and one 2-megapixel sensor. Just as with the Honor 7X, the smaller secondary sensor is there purely to provide depth information for the included wide aperture and portrait modes.Honor 9 Lite     Battery lifeThe Honor 9 Lite comes with a 3000mAh battery, which is pretty typical for a phone of this size. It   s a little smaller than the 3340mAh battery of the similarly specced Honor 7X, but that phone has a larger and more demanding 6-inch display.Perhaps as a result, Honor claims that you can get an extra hour of offline video watching out of the Honor 9 Lite   s battery (13 hours rather than 12). In practice, we found that it ate through a similar amount of battery (14%) when watching a 50-minute downloaded TV programme with the screen brightness bumped right up, which isn   t great.Why buy the Honor 9 Lite?The Honor 9 Lite offers a number of strong features for a 13,000 price tag. Its all-screen design is something we still aren   t used to seeing at this price point, while general performance is reasonably snappyScore    Performance7    Camera7    Design7    Battery Life6    Value8    Software5    Calls & Sound7    Screen Quality8VerdictThe Honor 9 Lite   s bezel-light design and twin-lens camera tricks are eye catching, but it   s perhaps too quirky to fully take on the Motorola G-series at the top of the table.Honor 9 Lite (3 GB 32 GB) Blue", "0 users found this review helpful"], ["Waste of money...dont buy this phn...mi is much better than this", "0 users found this review helpful"], ["Very nice prodect ..", "0 users found this review helpful"], ["There's no headset in the box", "0 users found this review helpful"], ["Weight less and good battery back up and speedy....", "0 users found this review helpful"], ["Worst camera.. Ever seen..Otherwise nice", "0 users found this review helpful"], ["Thank u", "0 users found this review helpful"], ["Super", "0 users found this review helpful"], ["Loved ...got good mobail after nexus 5", "0 users found this review helpful"]]}{"rating": "4.4", "based_on": "222,458", "reviews,useful": [["Good mobile value for money           ", "7 users found this review helpful"], ["Good           ", "4 users found this review helpful"], ["Everything seems to be awesome.. For 10k you get face recognition, fingerprint and a top quality iPhone styled notch. Picture and Ai is awesome... Smooth doesn't lag at all in high end games like Vainglory, Pubg and asphalt 9. All the games are playable just a bit let down is that it's 3000 Mah battery eventhough it doesn't feel like it drains fast unlike an iPhone 6 or 6s which I have been using so far.i would rate 9 out of 10.. For this phone.           ", "3 users found this review helpful"], ["Worst           ", "2 users found this review helpful"], ["Full satisfaction got once i got a product....because i got a nice product ...thanks for Amazon team           ", "1 users found this review helpful"], ["Good           ", "1 users found this review helpful"], ["Like the full screen of the phone battery life super Like the fingerprint lock version.This phone is very help for the people the cash budget is good           ", "1 users found this review helpful"], ["DON'T BUY . BECAUSE BACK CAMERA IS VERY BAD I MEAN WORTHLESS. WORTHLESS CAMERA . FRONT OK BUT BACK IS NOT GOOD.           ", "1 users found this review helpful"], ["looking very nice , battery life , picture quality looking goodcamera very nice , overall performance very good for us           ", "1 users found this review helpful"], ["It   s ok not a better may be mi phone is good better than honor phone  Camera quality is over only better is better           ", "1 users found this review helpful"], ["The phone is owsome           ", "1 users found this review helpful"], ["For the price this is a really good bargain.           ", "1 users found this review helpful"], ["Product of Amazon worth for money                        ", "1 users found this review helpful"], ["Battery life 5 stars..display 4 stars...it's wow           ", "0 users found this review helpful"], ["Good ! I am using OnePlus 6This was my secondary mobileWorth for money    Camera , speed , build up all over niceWith free back case           ", "0 users found this review helpful"], ["Simply superb           ", "0 users found this review helpful"], ["Worth buying.. Sleek design... Smooth performance... Loved it           ", "0 users found this review helpful"], ["Like           ", "0 users found this review helpful"], ["So, budget friendly phone1.Valuve for money.2.battery is average .3.camera quality is good.If i say all over review then ,I will say its is very good phone for benginners...and budget friendly also           ", "0 users found this review helpful"], ["Good phone for this price           ", "0 users found this review helpful"], ["GOOD QUALITY PRODUCTNO LAGGING IN GAMEPLAY AND CLEAR CAMERA THAT GIVES ME A BETTER QUALITY OF PHOTOS.ALSO KIRIN 659 PROCESSOR GIVES YOU A BOLD & SMOOTH GAMEPLAY WITH LOW BATTERY CONSUMPTION, BUT SOMETIMES THE BATTERY MAY SLIGHTLY EFFECTIVE IN GAMEPLAY. FINGERPRINT RECOGNITION IS ALSO TOO GOOD. ALL OF THIS , IT IS A BETTER QUALITY SMARTPHONE WITH SUCH A FEATURES IN THIS RANGE.           ", "0 users found this review helpful"], ["Battery week           ", "0 users found this review helpful"], ["Nyc phone at reasonable prices           ", "0 users found this review helpful"], ["Avarage battery is week mobile is over heating           ", "0 users found this review helpful"], ["Camera PhonePost processing requireBattery not so goodFast charge not availableDisplay quality is very goodNice phone           ", "0 users found this review helpful"], ["she loves it.           ", "0 users found this review helpful"], ["Very good           ", "0 users found this review helpful"], ["Camera and battery were very poor           ", "0 users found this review helpful"], ["Looking is verry good and phone is comfortable, but pura paisa basool to nahi kah sakte           ", "0 users found this review helpful"], ["The product is great as per the price point however the seal was already broken when i received it           ", "0 users found this review helpful"], ["its a good phone. good fot its price but honor 6 has a better camera. the camera of this phone absolutely sucks but itherwise the phone is pretty good           ", "0 users found this review helpful"], ["Delivery issue           ", "0 users found this review helpful"], ["Just okay           ", "0 users found this review helpful"], ["At that Time This Phone Price and Brand Better for that Specification           ", "0 users found this review helpful"], ["2 months working fine in displayed side corner displayed yellow line ..Don't buy this product ..           ", "0 users found this review helpful"], ["Fantastic product with in the budget. Kudos to HONOR !!!!           ", "0 users found this review helpful"], ["Mast automatically           ", "0 users found this review helpful"], ["Very bad quality. Within 5 months, lot of yellow patches on the screen and we can not read letters. Went to service center but no use. Service and call centers are worst people. adamant people.Now within 6 months, this mobile become useless and I am buying a new one           ", "0 users found this review helpful"], ["Jst buy...killer in its price range.. I hav done all r n d.. So dont hesitate..all specs r true.. Bache ki jaan loge kya itne me..           ", "0 users found this review helpful"], ["Amezing           ", "0 users found this review helpful"], ["Vettery Time very Short           ", "0 users found this review helpful"], ["Very good battery life. Very good camera quality. Bought it for my mom. She is really happy           ", "0 users found this review helpful"], ["best price and performance           ", "0 users found this review helpful"], ["Value for money           ", "0 users found this review helpful"], ["This is low price but charge will not stanfing for long time           ", "0 users found this review helpful"], ["Working totally fine.           ", "0 users found this review helpful"], ["Nice phone. Value for money. Touch response could have been a bit better.           ", "0 users found this review helpful"], ["Battery           ", "0 users found this review helpful"], ["Best budget phone ever     ( I bought during offers )Best battery life                   ", "0 users found this review helpful"], ["Material quality is good and its valuable under Rs10K....Picture quality is not bad....but atleast the rear camera should have 16MP or 20MP as well as the front camera have!! But still better than Redmi!           ", "0 users found this review helpful"]]}{"rating": "4.3", "based_on": "218,346", "reviews,useful": [["Merits - Premium and Beautiful looks.  If you hold this phone in hand, people will notice and enquire about it.  Processor - Very fast and responsive.  Camera- Sharp, vivid, crisp pictures even in low light.  Size - Apt size, easy to hold unlike other 6\"-6.2\" phone.  Ideally phone should not be so big and so small.  This is the perfect sized phone.  Display - So bright and real led quality phone. now if I look my previous phone I find the difference same between conventional TV and led TV.  Battery - Honor declares 3000 MAH battery capacity but it is equals to 4000-4500 MAH of other brands.  Battery last long.  Truly the best looking and smart featured phone.  I am very happy to buy it.  It will fashionable even after 2 years.  It is very good looking phone.  Market value - With all such features price of this phone 128 GB is so competitive.  I am sure no brand will offer such features like this phone.Demerits - Missing Fast charging - you can't charge this phone so quickly.  Speaker phone - I had lenovo K5 note, it had Dolby atoms feature.  But the speaker phone of Honor is not so impressive.           ", "32 users found this review helpful"], ["I WANT HONOR PLAY           ", "20 users found this review helpful"], ["Value for money purchase           ", "15 users found this review helpful"], ["Dilike           ", "14 users found this review helpful"], ["Except the front camera, there is nothing that is good about the mobile , charge doesn't stay for, the screen is too bad screen touch is bad, 128 gb space but still phone hangs several times, having issues to answer calls, waste of money....           ", "13 users found this review helpful"], ["battry power super           ", "11 users found this review helpful"], ["Awesome.... Just go for it . Don't think...           ", "10 users found this review helpful"], ["Battery, camera, graphics super charging.... Etc etc all are superb                    ", "8 users found this review helpful"], ["Go on           ", "6 users found this review helpful"], ["Excellent set           ", "6 users found this review helpful"], ["phone camera is awesome           ", "5 users found this review helpful"], ["Do not support dual volte active standby. No updates also making this product obsolete. So no point in purchasing as the cheaper ones support that           ", "5 users found this review helpful"], ["Stylish look and  performance is superb. NO headphone.....           ", "5 users found this review helpful"], ["I purchased honor 9n 4 gb ram and 64 gb internal storage phone in rupees 8550 during the summer sale.Friends the camera a quality is very poorBut it is a very good product and great value for money.           ", "5 users found this review helpful"], ["Great value for money at a price point of 16k           ", "5 users found this review helpful"], ["I have nothing to dislike this phone except if it gives more battery back up. And I hate Amazon for delivering me the malfunctioned phone. Not just this one, last year too I recieved Nokia 6 with the same problem.           ", "4 users found this review helpful"], ["Average           ", "4 users found this review helpful"], ["Excellent Mobile...At 8550 4gb rab 64gb internal memory           ", "4 users found this review helpful"], ["Nice pick under this price range. Finger Print Sensor and Face Unlock Feature are very fast and accurate. Even works in low light. Camera Quality is also very nice. Please go for the product. 5 Star from my side.           ", "4 users found this review helpful"], ["Very nice product           ", "4 users found this review helpful"], ["Good           ", "3 users found this review helpful"], ["Good phone using frm last 6 month           ", "3 users found this review helpful"], ["My OpinionCamera= just an average clarityDisplay = honor 9n's display is good and very brighten.Sound = Speaker is very good and decent quality.Battery = the battery backup  is very bad.when i am browsing the internet using via wifi. but i got just few hours backup only able.so the battery of this phone is very poor quality and not any of fast charging mode. its the main problem.i will give the \"zero\" star rating.OS=is good and easy to use but some of the functions are confused.All 3000 mAH smartphones backup are minimum will get at least one day but this is not perfect. and notch is just for a good design its not better to use.           ", "3 users found this review helpful"], ["Like my dream phone, perfect phone that i was looking about, no cons exept one, and that is battery, it could be more powerful. Overall perfect phone for everyone wants the phone for daily purposes. No major flaws           ", "3 users found this review helpful"], ["supper           ", "3 users found this review helpful"], ["Meri life ka sabse ghatiya phone ,ghatiya processor , don't by this plSS ,Mai to pachta raha hu ye phone lekar                                   ", "2 users found this review helpful"], ["value for money           ", "2 users found this review helpful"], ["Good           ", "2 users found this review helpful"], ["All in all the phone is a good buyPros:Excellent Picture quality,Resolution of mobile is charm with Notch displaySound Quality is fine considering location of speaker on device.Battery is the only Con for this as due to high resolution display and background app power consumption drainage is quick.Overall a good buy !!           ", "2 users found this review helpful"], ["Too good but time take process in delivery product           ", "2 users found this review helpful"], ["Nice           ", "2 users found this review helpful"], ["Good phone           ", "2 users found this review helpful"], ["Supern phone in this price range best camera best processor and good battery life and h h h h h           ", "2 users found this review helpful"], ["Simply superb except the battery life. Battery life is only 3000mAh. I find only this drawback. Otherwise, the Honor9N mobile is good to buy.           ", "1 users found this review helpful"], ["1.Battery charge losing fastly.2.Camera quality is excellent.3. Price s are different from diff merchants.Will get confused about its price .           ", "1 users found this review helpful"], ["Like my dream phone, perfect phone that i was looking about, no cons exept one, and that is battery, it could be more powerful. Overall perfect phone for everyone wants the phone for daily purposes. No major flaws.Stylish look and performance is superb. NO headphone.....           ", "1 users found this review helpful"], ["Excellent           ", "1 users found this review helpful"], ["I like material quality           ", "1 users found this review helpful"], ["Good           ", "1 users found this review helpful"], ["Nice           ", "1 users found this review helpful"], ["Superb product feom huawei . Doesn't hang at all... Battery life is decent and overall a nice deal           ", "1 users found this review helpful"], ["Good           ", "1 users found this review helpful"], ["Immpro the battery           ", "1 users found this review helpful"], ["I love it and it's very good phone           ", "1 users found this review helpful"], ["Good product           ", "1 users found this review helpful"], ["Good phone           ", "1 users found this review helpful"], ["It's feature are very good. If you give more load it take some minutes. On my test its battery life without stand 6 hours while continues working. With Internet connection.           ", "1 users found this review helpful"], ["Good phone in best price... delivered on time.. Thanks Amazon!!!!           ", "1 users found this review helpful"], ["I've been using this ph for 6 months now and it's just amazing. The highlights are as follows:1. Display & Build: probably the biggest highlights of the phone. A metal frame with glass on both sides and a gorgeous display. Honestly the only display which can give AMOLED display a run for it's money.Software: Runs on EMUI 8 based on Android 8 and is scheduled to get EMUI 9 based on Android 9 by June 2019. This is a super feature rich UI and will give u a tonne of feature that do not exist in Stock Android.its very well optimized too. Honestly I like EMUI over a lot of other UIs. It's mature and feature rich. Plus honor has been good with software updates. My pH is running the April Security Patch update.3. Processor : For today's standards the processor is definitely slow. Kirin 659 is almost a Snapdragon 630 equivalent. However u will feel that only if ur a gamer. Daily tasks r a breeze. So gamers stay away from this mobile. Others, PL go ahead and buy it. It's still a very good processor.4. Camera : it's got a superb pair of dual cameras which can click awesome pics is natural lighting and we'll lit artificial lighting conditions. The only place it struggles is low low lighting conditions. But then at this price u can't complaint. Same goes with the selfie cam too.5. Battery: Another con in the pH is it's battery. It's not pathetic, but definitely not for heavy users. It will easily last 1 working day for moderate users,but heavy users will have to top it up again in the evening and unfortunately no fast charging is supported. In fact takes quite a bit of time to charge.Verdict : go buy this pH if ur looking for an awesome looking devices with feature UI, good build, good cameras and a decent processor with decent battery life.Heavy users and gamers, stay away.           ", "1 users found this review helpful"], ["I bought this phone on june2019, I come to know that google has banned honor mobiles. Whats the solution for it ? will honor come back with android/google or it will create a new software ? Hope Honor won't fail to support. Shall I return(not replace) the product ?           ", "1 users found this review helpful"]]}{"rating": "4.7", "based_on": "4,555", "reviews,useful": [["I purchased the tencent version and it's awesome blazingly fast with tons of features.           ", "6 users found this review helpful"], ["One of the best phone in the world           ", "4 users found this review helpful"], ["High quality           ", "4 users found this review helpful"], ["Very slim if you are a gamer it is a dream come true . Truly mesmerised.           ", "1 users found this review helpful"]]}{"rating": "4.2", "based_on": "121,895", "reviews,useful": [["Received faulty and damaged charger . Phone look used don't buy phone has heating issue...           ", "25 users found this review helpful"], ["Veery nice product,only thing is battery is low,camera and other features are very good,it good for those who dont use internet more.           ", "21 users found this review helpful"], ["Average product but good in its price range. One of the least popular phones by Asus. It's over priced here on Amazon as it's available for 4.5-5k on Flipkart.           ", "12 users found this review helpful"], ["GOOD ONE           ", "10 users found this review helpful"], ["Get wrong charger in box so replace.           ", "7 users found this review helpful"], ["It's really worthy for the price. Got it for    4850 during offer period. Each and every aspect of the phone is good. Snapdragon 430 octa core processor makes the phone really snappy.All other phones at this price offers Mediatek quad core CPUs. The performance difference between the closest competitor Redmi 6A with a quad core Mediatek Helio A22 and this phone is very evident. Also Redmi 6A costs around    1000 more than this one.Playing asphalt 9 on the weak mediatek processor on Redmi 6A is like watching a slideshow even in low settings. But the Lite L1 handles it with ease. Pubg is also smooth on this phone than 6A at lowest setting.The Lite L1 has a great display, it's light weight and easy to handle. The camera quality is good for the price. Battery easily lasts for a day with moderate usage. The build quality is also very good. It's back panel is made of hard plastic with a smooth finish. Coming to security, it has camera based face unlock feature. It works well even on moderately low light indoor conditions. But on very dark conditions, it won't.It's the best choice for anyone who wants to use smartphone for social media and web browsing and even some serious gaming without breaking the bank.Overall it's a WoWsome phone at this price and it would be difficult to find another phone at this price point with an octa core processor and such great performance.           ", "5 users found this review helpful"], ["Veery nice product,only thing is battery is low,camera and other features are very good,it good for those who dont use internet more.           ", "5 users found this review helpful"], ["Very handy mobile.           ", "4 users found this review helpful"], ["Worth and valuable for the rate           ", "4 users found this review helpful"], ["Average product but good in its price range. One of the least popular phones by Asus. It's over priced here on Amazon as it's available for 4.5-5k on Flipkart.           ", "4 users found this review helpful"], ["Good m o b I l e and v a l u e  m o n e y  best .           ", "3 users found this review helpful"], ["Ok for money..           ", "1 users found this review helpful"], ["Good m o b I l e and v a l u e  m o n e y  best .           ", "0 users found this review helpful"]]}{"rating": "4.3", "based_on": "4,048", "reviews,useful": [["this phone is garbage. let me explain. it has flagship features, awesome camera, perfomance beast, superb battery. everything. but one problem. sometimes it will turn itself off for 6 hours. no matter what you do, it won't turn on. then later after struggling hard it will turn on again. i made a huge mistake buying this phone and regret that i lost money and stuck with this unreliable garbage for the next one year. it can turn off anytime and gives me a panic attack. never ever ever again ASUS! lesson learnt.", "10 users found this review helpful"], ["A friendly advice to people who are planning to buy this device. This a substandard product from Asus. I have been sent 2 Asus 6z till now. First one was faulty out of the box and the second one became faulty after just 4 months. This device has a faulty motherboard and Asus has declared it earlier as well. My second device that has been sent to service center has a faulty motherboard which was confirmed by the service center.", "5 users found this review helpful"], ["no words to say .......each and every aspect of this marvelous creation (6z) is awesome...I'm loving it...", "5 users found this review helpful"], ["So i am reviewing this after usage of 15days! \n\n1.Performance is beast & better than any phone of this price range.\n2.Battery last for whole day with a heavy usage of gaming and browsing If you are moderate use it will last for one and half day or 2days.\n3.WHAT I CAN SAY ABOUT FLIP CAMERA? It is mind blowing\nStability-5/5\nQuality-5/5\nDay Mode- 5/5( Class apart)\nNight Mode- 3/5(Yes, it lacks here)\nCamera Features- 5/5( Specially Panorama Mode and Motion tracking)\n4.Full Screen display- 4/5( have some trouble in sunlight but manageable)\n5.What i like the most is 3.5mm Jack and dedicated Memory card slot.\n \nConclusion- this phone is a complete package & have everything which we required for use. If you are planning to buy one plus than i must say you should go for this phone.it value for money.\nThanks.", "4 users found this review helpful"], ["It's motherboard is automatically crashed just within 8 days of use. very pathetic experience i had with this mobile. I am so disappointed", "4 users found this review helpful"], ["1 Star for flipkart fraud and Asus 6z multiple time motherboard failure", "3 users found this review helpful"], ["I ordered this product on 25th October and got it on 28th October as promised. So, no complaint in that department. I know its a bit early to write a review, but believe me, I spent a month to decide between One Plus 7 and Asus 6z. \n\nSo let's get started. It's going to be a bit lengthy so please have patience.\n\nThose who are looking for a short answer - Just go for it without a second thought (but be careful).\n\nIf you are reading this then the chances are you might be confused between one plus 7 and 6z. Let me just fractionize the pros and cons with details.\n\nWhy I chose this device over OP7.\n\n1. Better battery backup.\n2. The secondary camera in OP7 is a depth sensor on the other hand 6z has a wide-angle aperture.\n3. Infinity Display (not everyone's choice).\n4. Durability (It survived many drop tests against OP7).\n5. Your main camera is your selfie camera (so great clarity).\n\nPros.\n\n1. Great Camera, hands down to that. Low light photos have some grains but much better than OP7.\n2. I was a bit skeptical about the flip camera but since it is made with the liquid metal it's more durable than you think.\n3. Infinite Display.\n4. Powered by snapdragon 855 offering awesome speed and smoothness.\n5. Navigation is superb just love the smoothness.\n6. Even though it runs on zen UI 6, you will not see any bloatware like Mi (I hate MiUI). Stock android like feeling with some additional features. \n7. GPU is Adreno 640, making games like PUBG and COD buttery-smooth (back might get warm after a while but it's common with every device, even with Samsung S10 and iPhone 11).\n7.  HDR 10 + (will speak about this in the latter part).\n8. The front is protected with Gorilla glass 6 and back with Gorilla Glass 3.\n9. Customizable function button (I am using it for torch).\n10. 600 Nits of luminosity (in simple terms awesome daylight readability). FYI, iPhone 11 has 610 Nits.\n11. Massive battery 5000 mAh. (Now it might look like your battery is draining fast but with moderate use, it will last for a day and a half.). To conserve more battery you have to stop playing around with the flip camera as it runs on a motor and motor consumes a lot of power.\n12. Plus point, a headphone jack with and high res earphone. (By the way, a good High res earphone comes around 2k).\n13. Awesome sound especially through earphones. Now I am Dolby Atmos guy and I had my doubts with DTS X, but it turned out to be amazing.\n14. Dedicated memory slot expandable up to 2 TB.\n15. Physical fingerprint sensor (I trust this more than in display).\n\nNow the cons.\n\n1. Its IPS LCD and not AMOLED (Now this has HDR 10+ which means the colors and display is as good as Amoled, plus no dead pixels like AMOLED. I think that's why Apple is sticking with LCD's).\n2. No in-display fingerprint (for some people it is a con).\n3. No  IP rating (but can handle some splashes).\n4. Even though Asus claims it has stereo speakers but the earpiece acting as a secondary speaker is not as good as OP7. It's more muffled and too low.\n5. Bit heavy and bulky 201g to be precise (but fits really well in hand).\n6. No depth sensor (Hey, what else you need in 28k).\n7. No pre-applied screen protection (But GG6).\n8. Since its flip camera, you can't take selfies while the phone is on a flat surface. But the camera is auto-retractable if it experiences some hurdle.\n\nNow you might ask Nikhil if the pros look like pros and the cons look like pros; what's the problem, why 3 star?\n\nNot everything with the device is roses and rainbows.\n\nThis device has a problem (not every device but mine has). I first noticed this on the second day, when I kept my phone to charge. The device rebooted itself and I wasn't even using it. At first, I thought it might be a glitch because not every device is perfect. Then the same thing happened again when I was scrolling through Instagram. The screen froze and restarted. \n\nYesterday  I was in my office and the phone was beside me, again the same thing happened, an auto reboot. Then I thought this thing is serious and I googled about the same and came to know that I am not the only one who is facing this issue. Even the negative reviews over here are filled with the same. When I spoke with ASUS representative he told me that this is a hardware issue and I have to go for a replacement.\n\nBefore that, I thought its just a glitch and can easily be resolved with an OTA update but things went south. Sadly you can't tell whether your device is faulty or not but you can run few tests to determine the same.\n\n1. Play high-end games like PUBG or COD for at least 60 minutes.\n2. Or download the Antutu app from playstore and do a stress test.\n\nIf any these test fails or your system restarts then it's faulty. As of now, my device is under the return process but it's a bit hard over here. They rejected the request 2 times. Has a window till 7 Nov. Hoping for the best.\n\nSorry, I didn't take any images to post.\n\nIf you still have doubts go with OP7 you will not regret it.\n\nHappy shopping. Chao..!!", "3 users found this review helpful"], ["Phone is hanging..  Its automatically go switch off and then on then again off..  Received defective mobile.. Not expected in this expensive phone..", "3 users found this review helpful"], ["Most of the things which were expected as innovation form Asus are met.The device functions smoothly except one Software Bug I guess as the Phone on its own goes to silent mode though the do not Disturb function was not on.I have personally checked most of the probable causes still this annoying problem continues.But otherwise Innovationwise ASUS scores full marks.People in many reviews raised about IPS display but  no issues here.\nDisplay: Brilliant\nBattery Life: Excellent\nFast Charging: Excellent\nSpeakers: Excellent\nNet : Excellent Speed {Though Depends on Carrier}\nCalling Quality: Excellent\nOS Customisation: Excellent ( Though Native Music Player in Zen UI is Missing)\nThe Camera Innovation regarding Flipping Entire Camera Unit within a very limited Space full marks to you Asus.( Though 48 MP sensor does not mean Excellent True to Life Images.Image processing still a lot of Scope.)\n                      Overall Thanks to Asus for making such a Masterpiece My Best Wishes to you on your efforts on Innovation Front.Thanks are due to Flipkart also for bearing with me on really Flipping the Cart about Asus 5Z purcahse.Quick service by Flipkart.Happy Diwali to entire Team.God Bless.", "3 users found this review helpful"], ["i got this phone delivered on 22nd October. Thank God my unit works awesomely fine. display is crisp and sharp but not so bright in outdoor. camera rocks in daylight but really need improvement in night mode. batter as expected 5000mah lasts long enough. performance wise 855 shows its class no lags or glitches. zenUI is perfect.\n\nAs many complaint about the ear piece i don't find it odd it sounds good for me but ya could be little more sharp to listen. \n\nspeakers, headphone jack and the earphones in the box is soooooo good...!!\n\non the I'd rate this mobile a good 4.7/5", "3 users found this review helpful"], ["i order asus 6z bigbillion day offer , i received mobile has restarting problem, with in two days flipkart give new mobile under replacement policy, thank you so much flipkart, Really worth for money to buy this mobile go for it, This mobile is a all rounder mobile. Mainly i love this mobile for its battery backup and performance,", "3 users found this review helpful"], ["Awesome Quality Asus 6z 😍", "3 users found this review helpful"], ["I am writing this review after using this mobile for 3 months. Let me tell cons first: Hanging of GUI, all the 'on screen' buttons frequently stop working or hang and they re-start working only after pressing power button. The GUI is not very freindly. Pros: Build quality is good and camera is very good even in low light conditions. But these things become irrelevant if phones GUI  does not respond making the user frustated. Despite updates the issue exists. Please try to resolve it.", "3 users found this review helpful"], ["The features are good, the camera is perfect. The flip camera is good technology but it's not perfect because many a times it does not flip.nThere are bugs in the phone due to which it slows down in apps especially games.nThere are issues with my alarm and auto-rotation.nAnd recently the phone gets restarted automatically.nAnd now, I don't know why but three phone is dead, the battery was around 40% when I was working and now it is not starting.nI bought Asus for the first time and will never purchase a low brand name phone ever.nNever heard a lot about Asus regarding phone but will puche only high brand valued phones.nnREGRETTED", "3 users found this review helpful"], ["i am using this phone since one month. Though flip camera is good, my phone got problem with retracting. often i have to physical push flip camera back to its original possible and it's loose also not fitting well. It often gets out and hangs around", "2 users found this review helpful"], ["Amazing phone, it's a true mixture of brilliant technology with thoughtful design.ncamera is brilliant, very very similar to stock ui( was MI A1 user so no change for me in terms of UI )nscreen is good.nbattery is brilliant but extra battery does bring some weight. but no complaints.nAt the price range of 25k, I feel it's a true value for money.", "2 users found this review helpful"], ["got a  update and upgraded to Android 10.\ngreat going.", "2 users found this review helpful"], ["I've purchased it from the seller the mobile was defective(not switching on, seal was opened ). then I replaced it another mobile was also is in the same state .very disgusting product .dont buy this mobile ever from Flipkart.really worst", "2 users found this review helpful"], ["Have been using this for one week. No issues found. No Lag and awesome sound+ Video clarity. However, on sun light the panel is dim and brightness has to be tweaked.  Camera is awesome and mobile aesthetics are super cool. Thanking Asus for retaining 3.5 MM Jack and giving a mammoth Battery. half screen time 1 day Solid! Finger print scanner is smooth and Sound clarity stands apart. Best in its breed and the only flagship with 5K Mah Battery. Go for it!", "2 users found this review helpful"], ["Master of selfie than Back camera but still the best camera phone Asus has ever made!full happy", "2 users found this review helpful"], ["Bought Asus 128GB variant. Phone is awesome in all aspects. You'll never be let down in any aspect of a mobile. Silver colour variant is so stylish in look. This mobile has everything a user expects. Sound quality is fabulous. Camera is so good, anyways that's subjective. Battery, needless to say. Performance is mind blowing. Motorized camera is the catchy part of this machine. Innovative work. Asus is the only brand that understands the Indian flavour in stocking the features like FM, jack, notification LED,etc. Thanks to Asus for such a complete mobile phone in this price range. Keep rocking Asus!!", "2 users found this review helpful"], ["Post 1 month of usage ... my attached pictures speaks lot about 6z ... Am impressed .... world's best flip 48mp camera ever with SONY senor 🤩 Especially it captures natural tones than any other phones ... excellent video quality with stabilization .... don't look for much comparison with any other phones .... No competition for this selfie shot of 6z until now .... as per specs 6z battery + snapdragons chipset + mind-blowing speakers output + features all are outstanding for this price range ...  handling camera always with lighting matters before we shot any pics or videos ... even during night lights it's performing well .. it's not about how many cameras phone has ... it's all about how the provided better in all the situation .... fully satisfied with 6z .... I also checked all the durability tests of 6z it clears n rocks ....", "2 users found this review helpful"], ["The phone is amazing.\nI am going to write cons only :)\nScreen edges are curvy and hide corners of some apps.\nSilver back gets fingers print marks easily, but still looks unique.\nI did soft drop test on pillow; camera retracted , but it stopped opening full 180 degree for next 20-30 attempts.\nI tried various work around and later it automatically got fixed.\nI also tried to switch to front camera while phone was on table; the motor tried hard but failed , and I had to retract camera.\nCamera flip metal body is not having much finish and its bit uneven. Its probably only in silver model.\nThe camera options automatically pops up in apps which use camera (camscanner,whatsapp, etc) , but it takes few seconds to flip the camera.\nPlastic back cover is stiff and very hard to remove.\nSlo-mo video is too dark when set at high frame rate (screen shot attached )\nScreen display software is not up to mark , need to change the brightness manually some times for better viewing.\nSince the camera auto retracts when it feels like its gonna falls, we cannot make selfie videos while paragliding :-\\\nI tried making selfie video and shook my phone downwards , and it retracted back to rear camera.", "2 users found this review helpful"], ["Asus 6z dead after receiving . not charging, can't switch on... I don't know what happens with this phone...", "2 users found this review helpful"], ["Good overall system.nnPro:n1. Good camera.n2. Almost stock UI.n3. Smooth.n4. Stylish.n5. Full display. No notch.nnCons:n1. Bugs. A lot of bugs. Like flip camera inverted after flip. Bad touch detection. Needs to be fixed.n2. Flip mechanism feels a bit loose. Could have put a locking mechanism on retracted mode. Makes bad noise on placing on hard surface.n3. Thick.n4. Gets hot.n5. A bit more costly.n6. No AMOLED or in-display fingerprint like competition.", "2 users found this review helpful"], ["3 reasons why I choose the Asus 6z..nn1. Full Screen Display and no notch.n2. Seperate Memory Card slot and no hyber sim slot.n3. 5000mah battery. nnGood things I loved about this device..nn1. The battery life is awesome. And inbox 18amp fast charger is a plus point.n2. It's silky smooth with the latest Snapdragon 855.n3. Feels extremely comfortable and premium in hand.n4. It's one hand mode is different from all other devices bcoz you can actually manually resize and relocate the one hand mode window. n5. The rotating camera is awesome and the wide angle and slow Mo are perfect. n6. The company's decision to use physical finger print scanner over in display is a good one as it's still faster. nnThings the are negative..n1. Ips display is great and lasts longer then amoled but outdoor visibility is an issue and that display is reflective which adds up to the issue. (Yes there is an outdoor mode but it improves the problem only 20/30%) ... I won't have minded an extra 2 to 3k on its price for a better display. n2. There are issues with Pub G the phone freezes somtimes in heavy settings.", "2 users found this review helpful"], ["Nice mobile....value for money", "2 users found this review helpful"], ["Perfect Pics!", "2 users found this review helpful"], ["Got fed up of this mobile. Display goes to black very frequently, especially after charging. Atleast for 30 mins, we could not use the mobile. Tried with all posible ways like safe mode check, factory reset etc, but problem didn't resolved. Asus is not even releasing any update to fix this issue. Didnot expected this kind of stuff from ASUS👎👎", "2 users found this review helpful"], ["The very USP this phone has of a flip camera is aweful\ncamera stopped flipping twice in a month and now the service center has asked me to format the phone.\nRegret my decision ,very disappointed by the product.", "1 users found this review helpful"], ["Asus 6Z is way better than the phones in its league. \n\nCons first: \n1. Casting to TV is problematic. My earlier Moto g5s plus used to be so smooth. \n2. Some basic Google controls like 3 finger touch for screenshot is missing. \n3. Voice reception is little weird. It's not a clarity problem, it's more of placement problem. \n4. This is generic to all phone with fingerprint sensors at the back - When the phone is on the table and you want to work, you have to lift for unlocking only. \n\nPros\n1. 5 star battery\n2. 5 star camera and the mechanism\n3. 5 Star build and ease of using the OS. Coming from Moto, I was apprehensive of bloatwares. There are a few - not distracting though. \n4. Overall, signal reception and netwrok response is very good.", "1 users found this review helpful"], ["after 2 days use i feel like sheet, because phone was not up to the mark , i face mejar issue when i trying to play game the screen was behaviour wierd , if I don't tuch screen the controls move automatically, don't know y this happens, I thinks I got damage pic or something another reason but seriously I am not happy to buy this phone....", "1 users found this review helpful"], ["One word.. Awesome!  Very good product completely fits my need. Camera was my first priority. it gives me the expected results on primary as well as selfie camera.\nlow one less star for the low light. it could have been little better. I hope Asus will improve the low light camera performance in upcoming updates.\nother wise it's a complete value for money phone.", "1 users found this review helpful"], ["Everything is good about the product except the mic. The sound output from the in-built mic is not clear and not upto the mark for a flagship device. You will face difficulties to hear the other person clearly in noisy and crowded environments.  After recent software update by asus the issue has been resolved a little bit but still the sound output from the mic is not of good quality. Above 60% of volume level the sound quality of the mic is unpleasant, noisy and crackling.  One more issue in this phone is sometimes screen flickering happens and the screen becomes complete white for few seconds, then it comes to normal.nnThe two major issues of this phone are :n1) Quality of sound output from mic is not pleasant and not upto the mark for a flagship device.n2) Sometimes screen flickering is happening followed by complete white screen for few seconds.nnMy suggestion to Asus to provide better mic in its upcomming phones and rectify the screen flickering issue.nn Buyers please check the mic quality before you buy. If you are ok with it then you may go for it.", "1 users found this review helpful"], ["I bought the phone on August 8, 2019.. the phone awesome... but came can be improved better.. Battery backup was too good even after Android 10 update.. so far I didn't face any issues... Nice value for money but can improve camera and provide AMOLED display.. nndraw back - if camera broken, you need to replace at the cost of 8000 Rs. and in some mobile, we have mother board issues in some mobile.. we can identify it via software update only...nin this case, please replace the mobile in Flipkart or service center...", "1 users found this review helpful"], ["Very strongly built body. Just feels like designed for army. Nice look. Battery life, hats off, excellent. But camera images not up to that mark which this flag ship phone boosts of giving 48 megapixel camera. Still testing for other functions. I will give detailed review after using for month or more.nNot at all satisfied with delivery. Took more time to deliver than the given estimated date. Had to wait for long time with tension of getting stones instead of phone. But atlast got it. Thank you very much Flipkart.", "1 users found this review helpful"], ["After using for almost 4 months, there's actually nothing to complain about this particular device.\n\nOS is very raw and totally stockish than the oxygen os. I really loved that very much.. No bloatware or customization. Its almost android out of box.\n\n\nBattery is show winner of this mobile. It lasts longer, 2days to say with best ram management still you won't miss even a single notification. Trust me.. \nThere's also notification lit.\n\nI really miss AMOLED panel in this stunning mobile but the provided ips panel have super contrast ratio and bright enough for outdoor use. \n\nCamera is standard on par with other mobiles in this price segment, and the flip mechanism practically works wonders. \n\nPerformance is typical flagship level as it has SD855.\n\nIts super durable.\n\nUpdates are constantly receiving mostly for camera improvements and security patch. \n\nI have lot to say about the good things in the mobile, will edit if get free time after.\n\nNow about cons:\nBack glass is somewhat slippery \nNo telephoto lens \nNo AMOLED screen, and that's the big hit for this mobile.\nNothing to say over this.", "1 users found this review helpful"], ["the camera and battery bis awesome, no extra apps installed earlyer, and eye catching", "1 users found this review helpful"], ["It's been 3 weeks now i am using this phone. This is my 3rd asus phone. I really like asus phones because of thier features they bringing each time on thier new phones. This time obviously the flip camera. Definitely redefining ordinary phones. After a long wait finally i got this phone in 26000rs during this big billion days. :)\nA quick comparison with new one plus 7 is - it don't have that liquid cooling feature which is somewhat helpful if you are a big game lover. I played pubg in this phone, it's heating little bit. But not like hot pan like heat. And not completely water resistant like oneplus. Other than this i didn't feel any other major draw backs when compared with oneplus. But have more common features like radio, microphone jack etc.\nCamera is really good. Low light photos could have been little more better. May be with upcomming update s this may solve. Battery life is really good. Fast charging is really helpfull to fill this 5000mah massive battery very quickly. \nThe main missing factor in this phone when i compare with my zenphone 3 is Asus's kids mode. That was really helpful for parent like me. And adaptive sensor need some adjustments which also required some improvement and it's little heavy because of that massive battery. If you are watching movies by holding in your hand, you may feel pain. But again it's not a big issue. My Zenfone 3 was so light.\nOther than these this is really a super nice solid phone guys. With lot of other Asus's good customized features and this time they brought near stock android ui. That's also awesome. Asus's customized features and Google features made this phone really incredible.\n Don't under estimate asus. They are really far far better than other cheap but high features offered phone available in today's indian market. Believe me it will not disappoint you. Go for it.", "1 users found this review helpful"], ["I bought this mobile bcoz of unique camera. Having dedicated memory Card slot is very useful and we can extend memory as we wish. Headphone jack is also there who loves to hear music with Dolby Atmos sound. Very decent mobile. Display is extraordinary. Having market's most valuable processor so no need to worry abt performance. Excellent battery backup. For selfie no one beat this. I strongly recommend who loves to buy a decent mobile with good camera, battery backup and excellent performance.", "1 users found this review helpful"], ["I purchased this phone back in June this year when it got launched in the country for the first time. The choice was to be made between this and the similarly priced Oneplus 7, but I chose the 6z for the features it was offering at the same price point. The main thing that turned me off from me purchasing was the fact the Oneplus 7 missed the headphone jack and I am not really a fan of Bluetooth headsets. So, I decided to buy this device in the flash sale that took place. \n\nMy initial impressions regarding that device were rather good. I was drawn into the flip camera the most since it really offered some cool ways in which one could make use of the mobile camera. The performance of the device was also pretty neat with all the games running smoothly. But after 2 months of the purchase, the device started to behave abruptly. It started restarting on its own randomly and sometimes it turns itself off and won't start. After an hour or so I tried again to boot the device and I was successful this time which left me a bit confused on why didn't start earlier. On researching in the Asus forums, I found out that it was not only me who was facing this issue but a bunch of other people were also facing the same issue, which supposedly is related to some hardware problem. \n\nHighly disappointed by Asus, that such a reputed company can come out with a flagship having hardware problems. I seriously doubt that I will ever buy another Asus smartphone.", "1 users found this review helpful"], ["Writing this review after usage  of 2 weeks & facing horrible experience initially.\n.\nWithin first hour of usage my phone crashed 3 times & next day again few times giving me jitters . I recorded the restarts/crashes through other phone as proof. I requested replacement in haste as I had heard the restart/crash issue with this phone before buying but without any resolution mentioned anywhere. Flipkart supported me & from Asus/Seller side third party agent was sent to inspect the phone. As expected phone behaved normally during inspection/restart. The agent left saying he saw some issues & assuring case will be forwarded. He however gave clean cheat & I received message from seller stating my replacement request cannot be processed. Annoyed I made few calls to Flipkart ,where representatives helped me again to take up the case. Again Seller sent 2nd agent for inspection. This agent also did not find issue but found another upgrade was just available on my phone. He just upgraded the phone. He did not note any issue in phone as expected again. I had already found 2 upgraded earlier & I completed them but still issue persisted. After this upgrade the crashes/restart stopped. I tested the phone thoroughly  for audio,video,net connection & all aspects , but found everything satisfactory.\n\n   Those were scary days for me as 26K new phone was behaving like corrupt & it was recorded well in Asus foum, Flipkart reviews. This is something Asus should have handled before certifying/dispatching the product. Total 3 upgrades took 700+MBs of space.\n\nMy observations,\n - Camera quality is good as mentioned everywhere here. Same 48MP front & back side. I did not test night quality much.\n - Battery backup is excellent. Charging of 30 min gives initial 40+% recharge. Quite fast & little bit of heating but after initial heating I did not sense same.\n - Screen quality is OK , may not be like A50/A70 Amoled display but not bad at all\n- Speaker volume is good enough , did not see any call quality issue.\n- Body is strong material but back cover is simple plastic\n- Sim tray is very delicate ,have to be careful while inserting back\n-  After start I could see 3GB of free Memory of the 5.8 GB available for use. However now I am seeing less than 1 GB available although I am using less applications.\n- No unnecessary applications provided like Samsung phones\n\nOverall worth a buy but definitely somewhat expensive.", "1 users found this review helpful"], ["gud performance", "1 users found this review helpful"], ["cool product", "1 users found this review helpful"], ["ASUS LOVER 😍♥️", "1 users found this review helpful"], ["If you are a normal user then go for 6/64 variant. Its worth every money u spend. Buy a 128 gigs sd card if u want.I got 1 for 1200. and u r good to go. The inbuilt camera app gives u and option to save pics in sd card so will not hv to wory about space any more. UI is simply awesome. Very simple to use and is customisable.\n\nBuild quality is great. \n\n1 pro which is not covered in many reviews is the audio quality. its simply mind blowing. u get to create your own listening profile and with a good pair of earphones, sound is treat to your ears. Go for it", "1 users found this review helpful"], ["i have been using this month for a month. \n\ncamera and bettery is good. but we can redmi k20 pro which has same specifications and price is low when we compare to asus 6z. it has 64 gb internal only.  i expected more from Asus because of this price 28k.", "1 users found this review helpful"], ["This phone is very awesome...Now its my favourite phone...\nDisplay is Good\nBattery is also good...it stands minimumbone day for heavy usage...\nCmaera is good...mainly selfie\nonly one disvantage is call quality...\nramaining all r okey...my wish..its the best choice for this rate", "1 users found this review helpful"], ["Awesome device...fully satisfied..u can go for it without any hesitation.. awesome camera and features...no issues at all..", "1 users found this review helpful"], ["Masterpiece, ultimate performance, smooth features, grate display, one of the best device i have ever used. i was using the Samsung note 8, but asus 6z is unbeatable with the given price range. 9 out of 10.", "1 users found this review helpful"]]}{"rating": "4.3", "based_on": "91,174", "reviews,useful": [["OK           ", "1 users found this review helpful"], ["Nice phone           ", "1 users found this review helpful"], ["This mobile is lit AF           ", "1 users found this review helpful"]]}{"rating": "4.3", "based_on": "239,279", "reviews,useful": [["The phone is good, good speed, good storage, good battery. Only problem is the useless good for nothing stupid annoying audio jack. No earphone sets work with this phone. NOTHING. So if you listen to music a lot or watch a lot of videos, buy bluetooth earphones along with it or don't buy this phone.           ", "5 users found this review helpful"], ["Lots of bug in software... Android update.. pie is incomplete... Lots of features of andriod p is missing don't buy any asus mobile           ", "3 users found this review helpful"], ["its fast and trouble free with ample memory           ", "2 users found this review helpful"], ["omg           ", "2 users found this review helpful"], ["Good           ", "2 users found this review helpful"], ["Good           ", "2 users found this review helpful"], ["Good phone value for money           ", "1 users found this review helpful"], ["its fast and trouble free with ample memory           ", "1 users found this review helpful"], ["Lots of bug in software... Android update.. pie is incomplete... Lots of features of andriod p is missing don't buy any asus mobile           ", "1 users found this review helpful"], ["The phone is good, good speed, good storage, good battery. Only problem is the useless good for nothing stupid annoying audio jack. No earphone sets work with this phone. NOTHING. So if you listen to music a lot or watch a lot of videos, buy bluetooth earphones along with it or don't buy this phone.           ", "1 users found this review helpful"], ["Don't go for this please           ", "1 users found this review helpful"], ["Best mobile for costAll about battery it's amazingZing zing           ", "0 users found this review helpful"], ["Like it           ", "0 users found this review helpful"], ["Like this product           ", "0 users found this review helpful"], ["The product is really good.           ", "0 users found this review helpful"], ["battery backup for 2 days,camera is good,Audio quality is loud enough, fingerprint scanner is fast.overall nice package in this price range.           ", "0 users found this review helpful"], ["i ordered black colour and i got blue also not able to return back ... Bettery is not 5000 as it show its only 3000 may be .. picture quality is also bery bad ...          Don't buy this phone ..           ", "0 users found this review helpful"], ["Good           ", "0 users found this review helpful"], ["Good           ", "0 users found this review helpful"], ["I like this phone           ", "0 users found this review helpful"], ["I like this phone           ", "0 users found this review helpful"], ["Excellent mobile but no Dolby surround sound effects, dual camera is just a marketing gimmik.Camera 5/10Sound 7/10Screen 9/10           ", "0 users found this review helpful"], ["Excellent mobile but no Dolby surround sound effects, dual camera is just a marketing gimmik.Camera 5/10Sound 7/10Screen 9/10           ", "0 users found this review helpful"], ["Without pressing button I can open and close screen. It has good battery. It won't heat much, almost cool most of the time. Good battery, screen, processing, web browsing. Image processing is not so top of the world. There are delays [ maybe sort with setting]. Really nice for me, everything in just 8.5k.           ", "0 users found this review helpful"], ["Without pressing button I can open and close screen. It has good battery. It won't heat much, almost cool most of the time. Good battery, screen, processing, web browsing. Image processing is not so top of the world. There are delays [ maybe sort with setting]. Really nice for me, everything in just 8.5k.           ", "0 users found this review helpful"], ["Battry power superb           ", "0 users found this review helpful"], ["Battry power superb           ", "0 users found this review helpful"], ["After long search, i bought this phone, battery is extremely best, camera, sound quality is average, but the most troublesome thing is that it lost network very often, and internet speed is like 2g or 3g. I have changed my jio & idea sims, even i have checked in another mobile and at another location but i lost networks many times and after restarting mobile it connects. I have contacted technial person on toll free and did all they said but problem not solved, i am extremely disappointed. I will never try for asus. Dint buy this please.           ", "0 users found this review helpful"], ["I became a fool ordering this phone and gifting to my mother.. The phone was faulty .. getting swiched off automatically and not getting charged.. Neither Amazon nor Asus gave any support even though i reported it to amazon in next 4days..The phone is of no use to me now.. lying somewhere at my place .. just wasted Rs.10180  .. forget amazon im ashamed of myself using this platform to order", "0 users found this review helpful"], ["Good", "0 users found this review helpful"], ["This phone is really great but since few days (after update), I am facing some problem like:-1) Not connecting to the Wifi properly and showing 'No Internet Access'.2) Fingerprint Scanner speed has decreased marginally.3) I have stopped using the face unlock as it just sucks and most of the time, doesnot recognises your face.4) Camera Performance is not upto the mark and is just below average.....    Now coming to the pros:-1) The Screen Quality is really nice. Also, according to me, it has the strongest build quality (of the screen) as I have dropped the phone many times directly on the screen and nothing happens *Note that I have not applied any Screen Guard or Protection, just it's cover (provided in the box) is enough to keep it safe* ...... So the inclusion on Gorilla Glass 6 will make it 5 to 6 times stronger..!!2) Ram Management of the 6gb ram varient is also the best in its price bracket (compared to RN5 pro and RN6 pro).3) Speaker Quality is             .4) Last but not the least, I have played PUBG continuously for 6hrs and 18mins and still, the battery percentage degraded from 100% to 18%. (On Low Graphics and High FrameRate)In short, *Asus Zenfone Max Pro M1 'was' really the best smartphone in its price bracket cause 'now', its successor (M2) has come in the market.*", "0 users found this review helpful"], ["loved this phone very much .... battery backup is 100 percent which was my main concern.... everything is excellent about this phone", "0 users found this review helpful"]]}{"rating": "4.5", "based_on": "21,103", "reviews,useful": [["when i pudchused it for first time i was too happy but te to time this phone's quality is reducing first its speakers which was the keyooint of this phone but its not that good at all and secondly its rear cemara there r soo much grains in a photo i am soo sad to purchase this product", "6 users found this review helpful"], ["its 1 and half year old and i will tell you this is best piece of machine i have ever purchased in my life . anything is solid just except the battery , now it is draining more rapidly but anyway i play heavy games and do all other stuffs so thats okay. its sexy too by the visuals.", "3 users found this review helpful"], ["today 3.11.19 till date best processor at this price.", "3 users found this review helpful"], ["znui with android 9 is great. very vivid screen as equal as apple xr..no lag noticed. for moderate user battery in not not not any problem.one and half day with all time on mobile data connection with all day rutine i.e. calling, messaging, social media and playing songs...sd845 great conservator of power... gamer may consider 3.30 hrs on pubg..", "3 users found this review helpful"], ["The Phone is really awsum, not a single problem faced through mobile till now..\nCharger cable and headphones can only be supportive till one to two months and after that its not going to work.\nTherefore, you have that much capibility of taking risk then its gud to go with it.", "2 users found this review helpful"], ["3300 mAh is not good enough for sd845 soc. Otherwise the phone is awesome.", "1 users found this review helpful"], ["very nice phone by Asus only battery is average but everything else is just awesome 5 🌟.", "1 users found this review helpful"], ["Asus Zenfone 5z I buied for 15999 in this price segment this smart mobile is better than any other even poco f1 also not compitetior to Asus Zenfone 5z. value for money build quality, multi tasking , performance, every thing superb. 9.0 updates came and also some camera improvements updates also camed. superb mobile.\nsome pics with out any light in room only using flash.", "1 users found this review helpful"], ["I purchased this mobile after much study of all mobile s in market up to 30000. And finally selected this based on, flagship model, mid range price @17000 and my last Asus phone experience (M1 Pro)\n\nBest things in these are.\n1. Camera. Even if this is just 12 MP camera but its way better than 30MP etc.\n2. Sound out from phone speakers. Its clear and sterio sound. There are two speakers.\n3. Network receival. This phone always have one bar extra network than all others.\n4. Storng specifications make this faster.\n\nFair things are.\n1. Very silky back finish due to glass. its get slips from any surface where u put it. \n2. Big Notch, however you can hide it", "1 users found this review helpful"], ["Good, but not as good as xiaomi.", "1 users found this review helpful"], ["Display not working within one Day... not happy with flipkart", "1 users found this review helpful"], ["best phone under 18k", "1 users found this review helpful"], ["the phone is really good and it has the if you are a gammer than  my openion is that you should buy it rather than vivo, oppo, mi", "1 users found this review helpful"], ["aesome camera and performance.\nthanks to flipkart for on diwali delievery instead of 31 oct...", "1 users found this review helpful"], ["Awesome phone better than other flagships.... Front camera only disappointed but I cleared that problem thru gcam", "0 users found this review helpful"], ["Good flagship killer", "0 users found this review helpful"], ["the 4 star is for performance...and camera is average...in this price segment (16k) everything is ok ...", "0 users found this review helpful"], ["Real Flagship. I am happy to have this.", "0 users found this review helpful"], ["Superb product for 16k if you're looking for raw performance. Snapdragon 845 coupled with UFS 2.1 storage makes it snappy to use. Camera is a disappointment. It's better that Poco F1 in terms of design. I personally hate the big chin on it.", "0 users found this review helpful"], ["still worth a buy in 2019... it can easily lasts for atleast 2 years... it's a beast in performance... for 15k it's a pure steal... go for it", "0 users found this review helpful"], ["The back of this mobile is very fragile. My device fell from a height of just 0.4 m (without cover) and the whole back shattered to peices. Very poor build quality.\n The performance is very good. \nCamera is great.\nDisplay is average.\nBattery is average.", "0 users found this review helpful"], ["Good phone", "0 users found this review helpful"], ["battery back up is not and why'll calling if use 5mints mobile is heating don't by this Asus Mobil phone s", "0 users found this review helpful"], ["everything thing is perfect on this phone except the battery it drains faster , after 30min on screen usage it drains 10% on power saving mode.", "0 users found this review helpful"], ["Masterpiece @16k\nBought this phone at only 15500 with 10% HDFC discount.\n+ About this phone.\ncamera is very good.\nscreen quality and viewing angle is great.\nbuilt is superb.\nhand feel and look of this phone is really great.\ngood optimization of software.\nfingerprint works lighting fast.\nsounds from speaker is awesome.\nheadphone Jack output is mind-blowing.\n\n- About this phone \nbattery is only 3300 mah so not great but not bad.\nfront camera is 8mp and photo quality from front camera is not great it's good only.\nbigger chin at bottom but better than many phones.\n\nAT LAST.\n@16k this phone is great value for money.no phone can beat this masterpiece at this price range.", "0 users found this review helpful"], ["voice break during call. I repaired in Asus service center but problem not solved..I face same problem..some time during call voice is clear but sometimes voice is very low.", "0 users found this review helpful"], ["camera quality doesn't match with price standard (high). some apps dysfunction just within 24 hrs of usage (easy mode in advanced setting gets automatically applied sometimes). some apps hang i.e. you can't get exit or close the app. few other small issues. not expected such problems considering the price of the phone.", "0 users found this review helpful"], ["performance .. really good . camera is something extra ordinary.", "0 users found this review helpful"], ["the best phone you can get right now for under 20k", "0 users found this review helpful"], ["nice", "0 users found this review helpful"], ["awesome camera quality, overall performance also too good.", "0 users found this review helpful"], ["awesome phone with awesome specs at this price range", "0 users found this review helpful"], ["Asus zenfone 5z have a decent camera with great details.", "0 users found this review helpful"], ["the phone is best in this price segment but when comes to gaming battery performance is not good", "0 users found this review helpful"], ["value for money good product", "0 users found this review helpful"], ["overall great smartphone", "0 users found this review helpful"], ["very nice product I am happy thanks Flipkart", "0 users found this review helpful"], ["True value for money product from ASUS.", "0 users found this review helpful"], ["Display is pathetic....have to keep the brightness to 70% to be visible in daylight.\nnetwork reception is not good....I was using Moto G5 it had have better network reception on same place.\nEntire day heavy usage battery remains 40%\n\nI don't felt any more difference compare to Moto G5", "0 users found this review helpful"], ["mind-blowing Camera Quality", "0 users found this review helpful"], ["Good.", "0 users found this review helpful"], ["Best in this price range", "0 users found this review helpful"], ["The phone hardware wise is good. But the software is super buggy. Sometimes the power button wont work. Sometimes the phone won't show signal for long", "0 users found this review helpful"], ["Hi guys.... this phone is ultimate phone\ncamera is good\naudio is mind blowing dts X is amazing.\nperformance mind blowing", "0 users found this review helpful"], ["This is a great phone under 19k", "0 users found this review helpful"], ["awesome phone... better than i thought", "0 users found this review helpful"], ["The only pons is the battery, otherwise the phone is superb", "0 users found this review helpful"], ["if any query regarding camera pls. see image\nand other things mind blowing.", "0 users found this review helpful"]]}{"rating": "4.3", "based_on": "242,111", "reviews,useful": [["Worst phone. A box of bugs.do not buy it you will repent.i have bought it now I am repenting....do will you           ", "8 users found this review helpful"], ["Over all good           ", "4 users found this review helpful"], ["Just ok           ", "4 users found this review helpful"], ["Dont buy this asus phone it has alot of bugs which asus dont care about the sound output from the earpiece is horrible it cracks even in 50% volume and the fingerprint scanner does not work most of the time the camera app crashes half of the times .           ", "4 users found this review helpful"], ["I don't like camera result.I don't like company's surivice. Phone is Very heavy. Bettry is only 1 day continue run.           ", "3 users found this review helpful"], ["So for going great .. thanks           ", "3 users found this review helpful"], ["Nice           ", "3 users found this review helpful"], ["Pros:Good battery backup for two days.Two sim slots with sd card.Camera quality s not bad. But not the bestCons:Never touch colour correction in settings,it LL change original colors and u will hate that for sure.i thought some problem with phone.           ", "2 users found this review helpful"], ["Mic are not working good condition, receiver complaint your voice not clear please rectify the complaint. Urgently clear my complaint.           ", "2 users found this review helpful"], ["Very good           ", "1 users found this review helpful"], ["Goof           ", "1 users found this review helpful"], ["Very reliable and battery backup is very good           ", "0 users found this review helpful"], ["I am recently using this phone and overall it is quite good in this prise range it has good processor and have good batter capacity but some of more Asus phone are better than this and also efficient to..Some of the discription are-DescriptionThe Asus Zenfone Max Pro M1 has everything to keep you entertained and connected - it has a 15.21 cm (5.99) FHD+ Full-view Display that delivers stunning visuals, a dynamic 2nd generation NXP Amplifier and a 5-magnet Speaker that offer crystal-clear audio, a powerful Qualcomm Snapdragon 636 Kryo Octa-core processor for glitch-free multitasking, and a 5000 mAh Battery that keeps you going for up to 2 days.           ", "0 users found this review helpful"], ["This phone is extremely slow. The screen freezes.i even doubt if it has 5000mah. It's been hardly 3 Months using this. I won't suggest this product. If you want to but second hand let me know :P           ", "0 users found this review helpful"], ["Good battery camera is not that good. Compared to price it's good.           ", "0 users found this review helpful"], ["Good product...           ", "0 users found this review helpful"], ["Defected product supplied by supplier. Also pick up denied quoting wrong reason.", "0 users found this review helpful"], ["Battery great.. picture clarity ok sound better .product getting heat while charging. And little bit lag spotted while playing pubg", "0 users found this review helpful"], ["Network strength not good very poor connectivity not without net video calling and pre installed app go2pay is froud app", "0 users found this review helpful"], ["Delivered refurbished item, front camera is bad. Used phone.", "0 users found this review helpful"], ["Good", "0 users found this review helpful"], ["Value for money", "0 users found this review helpful"], ["I am using started now review will send later, but this purchase not getting headphone it's not happy", "0 users found this review helpful"], ["But I have not received Headphone with mobile, pl arrange it", "0 users found this review helpful"], ["BAD CAMERA , LOW SIGNAL STRENGTH, STOCK ANDROID NOT USER FRIENDLY, HANGING PROBLEM IN 4 GB RAM !, FINGERPRINT SENSOR VERY BADALL OVER \"NOT SATISFIED\".", "0 users found this review helpful"], ["Product seems refurbished and no accessories are available inside. One more bill is there inside which has west bengal address on it.", "0 users found this review helpful"], ["Best Phone under 15000.Battery back up so good and video quality so good and not fast  charging and also is a good phone.........Ok........ok", "0 users found this review helpful"], ["Value for money", "0 users found this review helpful"], ["Why this phone is costlier on Amazon", "0 users found this review helpful"], ["You get the same phone in Rs 12999 at Flipkart. Please do the proper research before buying any product.", "0 users found this review helpful"], ["Display and performance", "0 users found this review helpful"]]}{"rating": "4.3", "based_on": "169,781", "reviews,useful": [["Phone is overall good.. and amezon service is excellent", "0 users found this review helpful"], ["Products available at flipcart at Rs 14999/-", "0 users found this review helpful"], ["The built quality is nice of this product.also battery is very nice 5000mh extends full day along with internet usage.Rare camere is very nice ie. 16+5mp and 16 mp front cam.. camera has Bokeh effect to give best quality dslr picThe display is full HD with 1080 pixels resolution 5.99 inchIt has Qulacomm Snapdragon 636 processor for heavy gaming and lightning speed while using itLooks are awsome as it has full displayIt has 5-magnet Speaker with SMART AmplifierAndroid oreo is given to it with octacore processorIt doesnt hangs istead of opening multiple windows..The phone has no hybrid slim slot.. 2 simcard and 1 sd cardAlso has finger print sensor . A quick charger is given for fast charging64 gb ROM and 6GB RAM ..expqndable upto 2 TB best storage capacity..Its the best satisfied product..", "0 users found this review helpful"], ["The free combo is not worthwhile.....the product is available for 14999/- on Flipkart", "0 users found this review helpful"], ["Good", "0 users found this review helpful"]]}{"rating": "4.1", "based_on": "123,665", "reviews,useful": [["Best budget phone at cheap price. An awesome deal. Worth the money paid.  Price is nominal as compared with other brands.           ", "9 users found this review helpful"], ["So many problem after 7day used. Call notification not showing, lacking and hanging, after open the camera picture not taken by pressing shutter button. Wrost fingerprint senso.           ", "8 users found this review helpful"], ["Nice phone in this budget, camera quality is good, battery backup is good, it having face unlocking also. I think its good one           ", "7 users found this review helpful"], ["Bought this for my father...one of the wrost cellphone...add mai bolte hai suggested by tech guru...pata nahi koun aise chutiye log hai Jo suggest karte hai           ", "7 users found this review helpful"], ["Good           ", "5 users found this review helpful"], ["phone superb please buy it hurry up nice piece           ", "5 users found this review helpful"], ["I liked the cellphone, however it had problems with gyroscope sensor and i had to return it.           ", "4 users found this review helpful"], [" ", "3 users found this review helpful"], ["Very bad           ", "1 users found this review helpful"], ["Sometimes while receive incoming calls, not pick phone on due time phone rings repedeatly, then only option is to restart.           ", "1 users found this review helpful"], ["Bad phoneI am unable to play even freefireMy contact number delete automaticallyFront camera is good & rare camera is not good,it's potrait mode is not functioning properlyI am not able download app from play store,I am trying to download cyber Hunter for many times.It cancel download automaticallyThe phone get heated fastlyCharging is very slowFinger print reader is also not working properlyFace lock is goodSound quality is good           ", "1 users found this review helpful"], ["camera is totally waste...  mobile is over costly it's worth 6000 only... overpriced as compare to features           ", "0 users found this review helpful"], ["There is no tower like other models. Battery problem is there.           ", "0 users found this review helpful"], ["Superb           ", "0 users found this review helpful"], ["Good. Buying it           ", "0 users found this review helpful"], ["Phone size is apt for single hand operation...and screen ratio is best in class..stuffs you wouldn't find on other up to 12k phones- bokeh mode selfies- a range of battery saver modes- reverse charging- longer battery life...I don't play games..so we don't know it's peak performanceI like this phone..", "0 users found this review helpful"], ["Bakwas everything. Camera audio video ram battery picture quality video call bakwas bakwas bakwas. Nothing ealse no one but. Bakwas", "0 users found this review helpful"], ["no native video calling feature. worst both camera. sometimes lagging . network stability problem.regret to choose it. hate this     ", "0 users found this review helpful"]]}{"rating": "4.3", "based_on": "21,754", "reviews,useful": [["Superb Phone.", "118 users found this review helpful"], ["using it from 8 hrs after delivered best mobile in this budget great battery backup with good charging speed \nDisplay is excellent best mobile at 12k", "15 users found this review helpful"], ["looking nice  value for money", "10 users found this review helpful"], ["EVERYTHING IS GOOD EXCEPT THE SPEAKER POINT AND TGE HEADPHONE JACK..", "10 users found this review helpful"], ["nice mobile, paking good", "7 users found this review helpful"], ["Awesome Phone", "7 users found this review helpful"], ["Mobile is good charging time 2hrs and continous usage 7 hours performance nice I loved it", "6 users found this review helpful"], ["Very good Phone for low budget\nEnjoyed playing pubg on this. It was bit heated but didn't lag at any time\nIt has a fast recognising finger print and face unlock very fast \njust go for it", "4 users found this review helpful"], ["nice phone", "3 users found this review helpful"], ["battery back up is low when compared to other mobiles with same as 4000mah battery", "3 users found this review helpful"], ["is not good", "3 users found this review helpful"], ["nice product", "2 users found this review helpful"], ["nice mobile phone 😘", "2 users found this review helpful"], ["it's very good", "2 users found this review helpful"], ["camara is performing good, in picture taking time image is not perfect but after processing of shot the picture turns to good blurring effect and more    .in performance wise mobile is great.tell about the battery I feel some sadness ,it's not matching 4000mah capacity  any wise this one is super except in battery case", "2 users found this review helpful"], ["owseme productnbest phone go for it ..nlong lasting battry nno heating at allnbest camara 👌👌nupdate came just after starting phone at first time", "2 users found this review helpful"], ["phone is value for money but camera is average. Asus have to send update to improve camera performance", "2 users found this review helpful"], ["I own a Samsung note 8. however i carry 2 phones. So i bought it. I bought it for 11249. Thanks flipkart for quick delivery i.e. within 48hrs. Display is great, Camera is okaish, battery is great. overall 4/5.", "2 users found this review helpful"], ["Awesome great performance.", "2 users found this review helpful"], ["I forgot to apply accidental cover pls help me how to go for it", "2 users found this review helpful"], ["superb phone", "2 users found this review helpful"], ["good phone", "2 users found this review helpful"], ["everything is good except screen quality is full colourless....", "2 users found this review helpful"], ["supper mobile", "2 users found this review helpful"], ["so looking nice phone", "2 users found this review helpful"], ["Good", "2 users found this review helpful"], ["camera is very bad", "2 users found this review helpful"], ["nice product .camera and battery is good", "2 users found this review helpful"], ["Best very good", "1 users found this review helpful"], ["Very good", "1 users found this review helpful"], ["excellent product", "1 users found this review helpful"], ["good quality price and and flipcart  is speedy delivery", "1 users found this review helpful"], ["everything above question..but guys who need selfies 20 times fairer than the actual skin tone, go for other china phones with 'fair-n-lovely' camera :D", "1 users found this review helpful"], ["Just an awesome smartphone at such a unbelievable price thanks Flipkart", "1 users found this review helpful"], ["Some extra features not available in this.\nBut it is compatible", "1 users found this review helpful"], ["Just awesome..", "1 users found this review helpful"], ["nice mobile", "1 users found this review helpful"], ["nice mobile ..I like it.", "1 users found this review helpful"], ["very good at first after 3mnth it showing it bad performance", "1 users found this review helpful"], ["Soon nice", "1 users found this review helpful"], ["don't purchase any Asus product \ncheap service center and service", "1 users found this review helpful"], ["worst service ever from Flipkart , disappointed with the device , sent me faulty device which is not charging at all . Never ever gonna use Flipkart for any purchase. Fraud Flipkart and seller too. Guys don't order any phone from Flipkart they are just fooling around people. I sent this phone to my sister in a different state as birthday gift and she received a faulty device . I feel so terribly embarrassed. 😢", "1 users found this review helpful"], ["Very poor performance. Couldn't attend and decline the call initially but works okay after resting the phone and now there is no gallery and can't find the apps that are installed in the phone unless I go via playstore to open those apps.", "1 users found this review helpful"], ["amazing phone... thanks Asus...", "1 users found this review helpful"], ["This phone is not refundable so make sure before you buy it... Not got at all.. Go for honor 8x", "1 users found this review helpful"], ["it's one of a kind with the most smooth performance which comes with a powerful snapdragon chipset. This handset is basically a full fleged beast, so without wasting anymore time buy this beast as soon as you can.", "1 users found this review helpful"], ["camera quality does not meet the expectations\nworst quality sound \nbetter options already available in market.", "1 users found this review helpful"], ["awesome", "1 users found this review helpful"], ["Bihar camera performance", "1 users found this review helpful"], ["Total Waste of Money,\n1.Very Poor Vedio Quality, even Chines Phone have much better Vedio Quality.\n2. No in Built Apps even phone don't have its own photo gallry you have to buy thirty party app to store and see camera photos.", "1 users found this review helpful"]]}{"rating": "4.1", "based_on": "542", "reviews,useful": [["awesome phone thanks flipkart", "37 users found this review helpful"], ["pros: nawesome os, nnicely blends into the handngreat lookingnvalue for the money (paisa vassol)nncons:nterrible graphics card (to check simply open YouTube videos on this and on another phone)", "31 users found this review helpful"], ["superb Mobile...All must buy ....", "14 users found this review helpful"], ["best mobile in this budget...slim & light weight...edge cutting quality & performance", "12 users found this review helpful"], ["good", "8 users found this review helpful"]]}{"rating": "4.1", "based_on": "300,930", "reviews,useful": [["Thanks           ", "1 users found this review helpful"], ["value for money           ", "1 users found this review helpful"], ["Good set but not much user friendly as my old k5 note, basic options are not available, even v can't share one contact as an sms, long/crop screenshot option not available... But good cam,sound, performance.           ", "1 users found this review helpful"], ["Grt           ", "1 users found this review helpful"], ["I'm in love with this product...           ", "0 users found this review helpful"]]}{"rating": "4.1", "based_on": "13,673", "reviews,useful": [["This product is v good           ", "2 users found this review helpful"], ["Good           ", "1 users found this review helpful"], ["I like features and performance of the phone.           ", "0 users found this review helpful"], ["Camera pixels quality is low but overall the budget smart phone in low price           ", "0 users found this review helpful"], ["Good product           ", "0 users found this review helpful"]]}{"rating": "3.9", "based_on": "61,088", "reviews,useful": [["A very bad experience from Amazon... Delivered a faulty mobile phone which keeps restarting..Does not work at all           ", "1 users found this review helpful"], ["Superb product with low price           ", "1 users found this review helpful"], ["Better           ", "1 users found this review helpful"], ["The phone is really awesome..           ", "1 users found this review helpful"], ["The phone is too bad at camera quality, display,battery and everything else.I didnt like the phone so i tried to return it but amazon is not allowing us to proceed.They did not accept my reason for returning the phone.Amazon betrayed me           ", "1 users found this review helpful"]]}{"rating": "3.9", "based_on": "32,761", "reviews,useful": [["Using it since april 2016, No problem at all #touchwood     ", "0 users found this review helpful"], ["Bad product and service also bad keyboard board is not operate and sensor is not working I am not happy with this product", "0 users found this review helpful"], ["Excellent product. Nicer to have one.", "0 users found this review helpful"], ["Good", "0 users found this review helpful"], ["The main concern with this phone is that the processor gets hot too often", "0 users found this review helpful"]]}{"rating": "4.1", "based_on": "542", "reviews,useful": [["awesome phone thanks flipkart", "37 users found this review helpful"], ["pros: nawesome os, nnicely blends into the handngreat lookingnvalue for the money (paisa vassol)nncons:nterrible graphics card (to check simply open YouTube videos on this and on another phone)", "31 users found this review helpful"], ["superb Mobile...All must buy ....", "14 users found this review helpful"], ["best mobile in this budget...slim & light weight...edge cutting quality & performance", "12 users found this review helpful"], ["good", "8 users found this review helpful"]]}{"rating": "4.2", "based_on": "1,854", "reviews,useful": [["The product (Moto g8 plus) is satisfactory to me at this price. \n\nLikes: Outer look, display, sound quality, processing speed and definately Moto action features.\n\nDislikes: Camera picture quality at x46 is not satisfying and heavier.\n\nThis was my basic inhand experience with this mobile. For more information on this product you can see YouTube. - Vikas", "183 users found this review helpful"], ["worth buying amazing specs..", "154 users found this review helpful"], ["Great specs at a reasonable rate! \n\nIn the first look itself the phone feels premium though they have used a bit of plastic/fiber for this one different from the previous models ( I've been using Moto G5S Plus till now, which still runs fine). \n\nNot too sure about the camera, I'm yet to see the actual performance yet. But on every other aspect, this one lives upto my expectations. The thing I liked the most is the display and the Dolby audio feature. If you are a person who watches movies or listens to songs on phone be sure not to miss this one! And also kudos to Moto team for a genuine stock Android experience!! \n\nBattery performance is just fine for a 4000mah. Moderate usage will get you through a day.\n\nFinger print scanner works fine, but I felt that the face unlock feature misses to recognize face at times and only if we keep the phone at a certain angle. Apart from this I don't have any cons for this phone as of now.\n\nNot sure about people having issue with the charger in below comments, but the one I received is working fine, hopefully!\n\nFinal verdict, if u are looking for a phone for social media, movies, listening to songs and all other purposes except for heavy gaming, go ahead and buy this one. But if you are mostly into gaming, Redmi note 8 pro or any other phone with. better chipset would be ideal.\n\nIf I was helpful in assisting you with your buying decision, please do like/ mark helpful.\n\nThanks!", "65 users found this review helpful"], ["loved the moto stock android experience work smoot as butter", "36 users found this review helpful"], ["I've owned Moto E, Moto G, Moto X and Nexus devices from Motorola prior to this purchase & all purchased on Flipkart. I'm a pure Android fan. Never appreciated the bloatware that many manufacturers include with phones. Hence it was very easy for me to go ahead with this purchase. This phone is for those like me who understand you can't have everything by paying nothing; You need to compromise somewhere. I use phones mostly for Calls, Messages, WhatsApp, Online Shopping, Travel Bookings, YouTube, Netflix, Hotstar and other OTT Apps. Not a photography enthusiast, So camera is not a priority to me. \n\nAnd I'm into PC Gaming more than mobile so even this doesn't matter to me. If you're a serious mobile gamer, Consider phones with better CPU; Like Poco F1 which has a Snapdragon 800 Series at a great price point. If not, XiaoMi RedMi K20, Blackshark 2, OnePlus, ASUS ROG, Nubia RedMagic etc.,\n\nI'm rating 5 stars since there aren't many pure Android phones at this price point excluding XiaoMi A3. It was a tough call to pick this over A3, But the FHD+ display on the G8 Plus was the sole reason. If you don't prefer a Motorola then XiaoMi A3 is a good phone to consider. XiaoMi A3 as a part of Android One offers better timely updates as well.\n\nFeature Ratings:-\n\nOS Experience - 8/10\nBuild Quality - 7/10 \nDisplay - 8/10\nSound - 8/10\nCamera - 7/10\n\nDisappointed with Flipkart delivery experience. But it is a part & parcel of online shopping. Sometimes you need to be very patient. Took 5 days to deliver in total despite the package being in Hoskote Warehouse. 2 days for 2 KM radius coverage which was shocking.", "34 users found this review helpful"]]}{"rating": "4.1", "based_on": "7,459", "reviews,useful": [["Good           ", "25 users found this review helpful"], ["Awesome mobile with amazing camera and features. it's 10/10 you will not regret spending for this handset.           ", "23 users found this review helpful"], ["Good           ", "18 users found this review helpful"], ["U can't believe how good in night mode picture.....           ", "18 users found this review helpful"], ["This phone is good, but flipkart is selling this product at 14,999 where as I ended up buying at 18,999. Ended up paying Rs.4000 etc for Motorola One Vision (Sapphire Gradient, 128 GB)  (4 GB RAM). There was no return option available.           ", "14 users found this review helpful"]]}{"rating": "4.2", "based_on": "9,597", "reviews,useful": [["I'm writing this review after using Motorola One Action extensively for last 10days. \nPROS:\n1)Android One device with 128gb storage under 15K-This is the biggest plus for this device.\n2) Phone is very slim in width so one handed operation is very easy.\n3)Camera-In camera department, it can shot RAW images in manual mode! picture quality is not the best in the market but most of the users are generally casual users, so it'll not be a problem for uploading it social media. Action camera is not tested enough to give a review. Though photos can't be clicked using Wide angle camera but while using it for taking video you can use the option of screenshot button to click photos. \n4) Performance is fast and smooth enough for doing all the day to day works.\n5) USB type-c port, it's pretty useful these days.\n6) Speaker is at the bottom and decent enough.\nNEUTRALS:-\n1)21:9 aspect ratio-it looks good when you play a supportive video but most of the time you'll find it useless bcoz maximum videos are not available in this aspect ratio including YT, Hotstar, Prime Video etc.\n2) Hardware- Backside is glossy plastic and it can't be used without the silicon cover provided with it or any other similar back over.\nCONS:-\n1)Battery backup is woefully low in comparison with any other similar device.. atleast 4000mAH battery is basic. If you are staying outdoor for long hours you have to keep powerbank with you. Also the charger provided with the phone is a slow charger not a turbo or fast charger, it take ages to charge the device specially if you are in a hurry.\n2) Display is the second most disappointing issue in this phone. You have to increase the brightness to atleast 40% -50% to be able to see anything in daylight. Also normal 15% 20% brightness is pretty dark and not suitable for watching movies or anything unlike other similar devices.\n3)Big round notch in the front screen for front camera looks very very ugly. it should have been much smaller. Due to this notch it's very hard to get a proper tampered glass for this phone.\n4) Gaming is not much tested in this phone but from whatever I played (NOT PUBG) though it handled well but device gets very hot in short period of time also you have to keep the graphics to low/medium for best results. So if you are planning to play Pubg look for other device not this one. Also the big camera notch is very problematic while gaming.\n5)Very difficult to reach contents which are in top of the screen as most of the time top notification bar will come down.\nFINAL WORD:\nIf you have budget of less than 15K and not an avid gamer this phone is made for you. Not only it has Google's Android One version also 128gb storage device under 15K is impossible to find. With few cons I'll still recommend this device just for the price.\nPlease give a like if you find this helpful! Thank you!", "21 users found this review helpful"], ["Searching over the last one day on the internet, I found myself very impressed by this one. I placed an order and It took me three days to receive. I'm writing this review after one and half day of use. I'm listing out the Pros and Cons of Motorola One Action that will helps you out for making choice:-\n\nPros:-\n1. 1080x2520 Screen Ratio, Full HD+ display and Dolby Sound takes you to the next level of watching movies or songs.\n\n2. Video shooting with ultra vide camera is like a in build Go-Pro camera in your phone.\n\n3. Android 9 Pie is very user-friendly and keeps you faster while ,Android One keeps you always updated before everyone else. Android also promised for Android ver 10&11 can be updated to this device.\n\n4. 4GB Ram & 128GB inbuild Storage capacity not needs to tell.\n\n5. 2.2GHz Octa Core Samsung Exynos 9609 processor is performing so well.\n\n6. I got this on Rs. 13,999/- on special offer.\n\nCons:-\n1. No turbo charging facility but still a good battery life. will not recommend to PUBG users.\n\n2. Front Camera Black Dot circle little bit highlighted for their size. but still manageble.\n\n3. Temper Glass not available in the market at the moment, you have to buy it online as of 14 Sep 19.\n\n4. Only launched in two colors but Denim Blue is still a killer one.\n\nConclusion:-\n\nI would strongly recommend to those users who like Motorola Brand because the facilities provided by Moto in this range is truly value for money. You can still find much more better specifications to other mobile phones bundle up in plastic cases but this one is brand Motorola. So I suggest end your search here and buy it immediately.\n\nThanks", "14 users found this review helpful"], ["Phone looks really stunning in the 21:9 Display. Viewing angles are good. Camera could be better. Battery lasts a day. Gaming is a pleasure on this phone as the display is really good. Phone is quite handy and you'll definitely love the display on this one. An absolute bang for buck.", "7 users found this review helpful"], ["very poor battery backup. Battery doesn't last long for 24hrs as it says in specifications. And charging the battery takes long time with provided 10w charger.\nAnd it heats up when we use large apps like PUBG, YOUTUBE FOR LONG TIME, ETC .. HEATING ISSUES. I WOULDN'T RECOMMEND FOR HEAVY USERS & MODERATE USERS. THIS PRODUCT IS FOR ONLY LOW USERS.", "6 users found this review helpful"], ["normal camera option. need more option for camera.\nbetter video quality.\none day battery life.\nlook is v v good. easy to hold and handle.\nandroid one is amazing.\n\ngot mobile within two days from ordered\na special thanks to flipkart", "6 users found this review helpful"]]}{"rating": "4.3", "based_on": "123,243", "reviews,useful": [["Although u can get this product cheaper on Flipkart but if u are buying in exchange, Amazon will be cheaper.Camera is osm... I have seen reviews about average camera, trust me all those test were worng, since camera is default setuped at low camera resolution, change settings to high and thn judge ur self.           ", "40 users found this review helpful"], ["Gud phone under the 15k below price...All are saying about camera issues but in my point of view it's gud...gud picture quality.... worth of money..And battery backup is extremely superb....and one more thing is that phone have more weight...bcz of this 5000mah may b..and overall it's cool...and nice           ", "35 users found this review helpful"], ["Straight to the point:Gorilla Glass, LTE, 16 Million colors IPS Display, Latest Android Pie, Snapdragon 636 Processor,.Important : Buy from this seller, i had very fast delivery:  https://amzn.to/2VsiyKm4GB Ram and 64 GB internal memory, Dual Camera, Selfie flash, Very tough body.And MASSIVE 5000 MAH Battery with the brand of Motorola. All in 14k, Best Deal in sub-15k range.           ", "18 users found this review helpful"], ["Few issues were there I listed below..1.Battery drain is more in pie version please fix this issue.(battery specification only makes me to buy this but now I'm very disappointed. )2.Fuctionality of Autobrightness sensor is very bad.3.Camera quality is very bad when compared to others medals with same specifications.please fix the issue..this very annoying.           ", "15 users found this review helpful"], ["Face reader feature not available, phone size same as 5.5 inch, colour options not available.  Earphones not given. Weight is heavy.           ", "9 users found this review helpful"], ["This phone is definately not worth any price. There is simply no volume at all to be able to hear a conversation. The phone does not come with headphones. And lastly isn't able to connect properly in areas where the signal strength is even slightly week.I sincerely do not recommend this phone to be purchased at all.The battery life is the only saving grace. Other than that. It's a waste of money           ", "6 users found this review helpful"], ["I was replaced my screen 2 times ..... its a very bad thing from motorola .... i was spend 6500 for the replacement of glace .... guys plzz trust me all over performance is awesome but the screen is very bad ...... for small falls only its damages full screen and totally screen will not work...... even my friend is not face the same issue ..... and i request to motorola company to do this service on free of cost..           ", "5 users found this review helpful"], ["Totally use less item, too slow, some time I don't here sound during call, takes too much time to search a name from dictionary, also camera quality not up to the mark,           ", "5 users found this review helpful"], ["Worth the price           ", "5 users found this review helpful"], ["A good phone. Delivery speed was just good. the material was safe when reached in my hand.           ", "5 users found this review helpful"], ["Worst mobile  touch is not working and there are network issues like call drop and data connection related do not go with this mobile it   s my request to everyone.           ", "4 users found this review helpful"], ["My charger is not a turbo charger...I would like to replace it. .it takes a lot of time charge my phone           ", "4 users found this review helpful"], ["Battery back is good.           ", "4 users found this review helpful"], ["I don't know why everybody on YouTube dislike it's cameraAfter update camera is doing wellI love         this product           ", "4 users found this review helpful"], ["Loved it.!!           ", "4 users found this review helpful"], ["Great phone. Has a very good camera and the battery backup is excellent. Many great Moto features are present which help a lot, like unique gestures and Google lens. The only downside is that it's heavy. Everything else seems perfect! Very happy with my purchase           ", "4 users found this review helpful"], ["After a heavey usage of 2 months this phone is working fabulous, lots of gaming this phone is working properly,no lagging while playing asphalt 9 and pub g in normal mode.battery performance is awesome,sometimes I charge this phone while once in two days.Superb money saving device.           ", "4 users found this review helpful"], ["Moto is finally back to it's USP, good quality phone. Moto One Power has everything you need for a modern user. It would have been great if they have given Face Recognition.           ", "3 users found this review helpful"], ["I really don't like the picture quality           ", "3 users found this review helpful"], ["I have purchased Moto one power  before2 months but I am very unsutisfy it has no call  recorder that very important app and the marpho finger divice is not supported.i am  Very harresed.           ", "3 users found this review helpful"], ["I bought this phone 2 months ago till now there is no trouble with this phoneAnd I getting updates frequently           ", "2 users found this review helpful"], ["Camera is not good. Battery backup is just wow. Appx 2 days with normal use. Good product from motorola and good delivery service from amazon           ", "2 users found this review helpful"], ["The portrait mode in the camera needs to get updated... it says within 2 mtrs or bad light...           ", "2 users found this review helpful"], ["Really very good product...as like as new           ", "2 users found this review helpful"], ["All updates are done...But only Google play store app is not working properly , Troubleshooting in updating & downloadi  all apps           ", "2 users found this review helpful"], ["Good Phone           ", "2 users found this review helpful"], ["Product is very wright but performance good           ", "2 users found this review helpful"], ["Miracast is a bit complicated           ", "2 users found this review helpful"], ["By far best moto phone i have used           ", "2 users found this review helpful"], ["Good product           ", "2 users found this review helpful"], ["Good product           ", "2 users found this review helpful"], ["Good           ", "2 users found this review helpful"], ["Really amazing phone with excellent battery life and good display! System is quite fast with no lag observed during the past one month of use. There is no heating issue during phone charging as well. The best part is that it's Android One device, with almost stock Android system.The only flip side is weight of the device, which is slightly on the higher side.           ", "1 users found this review helpful"], ["Best           ", "1 users found this review helpful"], ["Good           ", "1 users found this review helpful"], ["i want to replace my phone. because this phone is opened           ", "1 users found this review helpful"], ["In this budget best one           ", "1 users found this review helpful"], ["Notch is not working in apps like Facebook, pubg, insta. It's is only available to see the network or what? Arrange to.replace           ", "1 users found this review helpful"], ["As a Motorola phone user, I brought this phone after a long wait. But I have to say.. I am not feeling comfortable using it, it's way too big. There is always this odd white gap when you surf the internet coz there's too much screen space. That is the moment when you realize that we don't need giant phones. 5 to 5.5 inch screen is enough. Battery life is good but could have been little bit more better. Work wise it's very good, smooth and easy to use. Thanks for the free soft back cover and the plastic screen cover. There was no headphone but glad I have the previous Motorola phones headphone which fits. But it's a very good looking phone for sure. I will say, go for small phones, big phones are not comfortable.           ", "1 users found this review helpful"], ["Nice phone to use this price           ", "1 users found this review helpful"], ["This original Android moto phone           ", "1 users found this review helpful"], ["Take 2-3 attempts to slide open screen to unlock many times           ", "1 users found this review helpful"], ["GREAT PHONE FOR THIS PRICE           ", "1 users found this review helpful"], ["Good product value 4 money           ", "1 users found this review helpful"], ["Good           ", "1 users found this review helpful"], ["Good, v.good, v.v.goodWorthy           ", "1 users found this review helpful"], ["Best phone           ", "1 users found this review helpful"], ["Good interface           ", "1 users found this review helpful"], ["Cost of repair your screen cost 9500 rs. Best avoid such a bad pricing service for your mobile. Use less if anything happen to your screen. Obviously you have to throw away.           ", "1 users found this review helpful"], ["Nice phone, a bit heavy, no face recognition. Overall value for money                ", "1 users found this review helpful"]]}{"rating": "4.2", "based_on": "2,026", "reviews,useful": [["If you like the design and you want a big screen, the Moto G7 could be your best bet at this price. It   s also a great choice for anyone upgrading from older Moto phones, assuming you liked them. If you can scrape together an extra rupees go for other..CAMERA, BATTERY, SCREEN, CHARGING           ", "75 users found this review helpful"], ["Camera supurb campare than Samsung A50 and Redmi note 7 proDecent look and primium design and best hardware quality           ", "73 users found this review helpful"], ["Moto G7 is a decent mid range phone with all the required utilities. Go for it without any doubt. I am writing this review after purchasing and exploring this phone.5000 mah battery and 4 Gb RAM that is what makes it even much better.           ", "54 users found this review helpful"], ["Excellent phone, great display and great camera. The colors are very vivid and sharp. Sound quality is very good. The back is made of very hard polycarbonate. The camera sensor is Omnivision and even low light shots turn out good. If Apple's share in the US is slipping very fast and this phone is a hot seller in USA, then Motorola must have read what people really need. Mainly we Indians are obsessed about the useless aspects of a phone. First of all it must be reliable and not let you down. Then comes camera sound etc which is also great. Just go for it!           ", "41 users found this review helpful"], ["Moto G7 Power is a beautiful phone, in its price range with amazing features.The phone has incredible battery life which is compared to any other flagshipAs per camera It's fine and rather than much.. it can capture good day photos and not likely useful for low light photos.Screen resolution is amazing and display is beautiful.Overall I would rate this phone a good in its price range.           ", "38 users found this review helpful"], ["I purchase this phone, work properly without hanging and lacking, but camera quality is low compression other phone,All features are good,left camera quality.           ", "16 users found this review helpful"], ["Very good phone, i m using since one week no heating noticed, display and sound is very good. Battery back is 2 days under normal uses.           ", "14 users found this review helpful"], ["Excellent service by Amazon.The phone is also having lot of juice(power) in it.           ", "9 users found this review helpful"], ["I am very pleased with this set           ", "6 users found this review helpful"], ["Good           ", "5 users found this review helpful"], ["User friendly,had no problems since it's my third Motorola phone in last 5 years           ", "4 users found this review helpful"], ["Battery life is amazing. I have literally forgotten to charge my phone. Good phone at a decent price           ", "4 users found this review helpful"], ["Super phone, super battery backup. 2 days charge for regular use with videos, music and calls. Worth it..           ", "3 users found this review helpful"], ["Positives - Great batter life, built quality superb, works seamlessly, decent photos (need to explore more)Negatives - little heavy because of the battery but it was anticipated, face recognition doesn't seem to work at times           ", "3 users found this review helpful"], ["I am not a gamer so this phone suits me. Great battery life (3 day). Great OS.           ", "2 users found this review helpful"], ["AFTER CHARGING 100 PERSENT END OF THE DAY STILL 80 PERCENT. ITS REALLY POWER FULL BATTERY.  IM ALWAYS MOTO LOVER BCS OF STRONG BATTERY AND BUILD QUALITY. WHO WANT A SOLID BATTERY AND BUILD AND QUALITY OF PHONE  U CAN CHOOSE moTO G7 POWER.  LOVE U MOTO..              ", "2 users found this review helpful"], ["I don't have any problem with phone configuration, but the Amazon replacement service and call centre guys are pathetic. They forced me install app and continue with troubleshooting when they realised that technical team not available at my address. Also, I have already spent 45 mins talking to them on phone and on top of that they want me to install app and work with them to identify problem. Why I should invest a time when bought a new phone . If they don't have technical team to check phone then must cancel my order and initiate refund. Call centre guys was so rude and hang up the call when I was talking. This is really cheap and worst my first experience with Amazon, Amazon business team must get involved here and work on how this replacement gap can be fulfilled. Call centre guys are like handicapped and unable to take decision really they like helpless. I again request to cancel my order so I can buy another phone if you don't have technical team in my area.0 ratings for pathetic call centre guys who talk to me today on 30th March at around 11 AM for 45 mins, please check entire recording if you fell I am laying.           ", "2 users found this review helpful"], ["Superb mobile..loved it..           ", "2 users found this review helpful"], ["Very very good           ", "2 users found this review helpful"], ["The features it provides are available at other mobile brands with a much cheaper price           ", "1 users found this review helpful"], ["One of the best Stock android phone in the market .....which Is filled with poor UI ,, RECOMMEND FOR EVERYONE           ", "1 users found this review helpful"], ["I was misled by the phone name and brought this mobile. I was hoping to buy G7. Its actually g7 power and not g7.Other than camera all features remains same.           ", "1 users found this review helpful"], ["Only 2 days. Working fine. All features adhere to specification. However, the USB c turbo charger is specific to this model. E.g. charger of moto g5s+ won't work or vice versa. Size different.           ", "1 users found this review helpful"], ["I loved the handset               ", "1 users found this review helpful"], ["Nice product           ", "1 users found this review helpful"], ["Not yet           ", "1 users found this review helpful"], ["It really is a good phone.The phone was packed and delivered decently and in a good condition.Battery life is working excellent.And definitely is a value for money.           ", "1 users found this review helpful"], ["Best value for the price of 12.5K.The battery is lasting me nearly 3 days, i.e., over 65 hours of regular usage, including about 10 hours of hotspot/WiFi.Turbo charges from 5% to 100% in under 2 hours - roughly 1% per minute, if not used at all during charging.Both photo and video capture is good.Moto addon features are useful.           ", "1 users found this review helpful"], ["Gud one           ", "0 users found this review helpful"], ["All good bout it           ", "0 users found this review helpful"], ["Last week i got MOTO G7 Power .  As usual Moto is hard and strong and good for power back up . Sound quality is good . Camera is ok ok . Overall happy with the mobile.           ", "0 users found this review helpful"], ["Too much havy           ", "0 users found this review helpful"], ["Its camera is awesome, image stabilization feature make it happen, even better than my Samsung M40.           ", "0 users found this review helpful"], ["Good product but cost must 12000rs           ", "0 users found this review helpful"], ["Camera batter than price           ", "0 users found this review helpful"], ["     clarify of photos are not good. It has heating issue, doesn't support all types of network, slow processing rates. Amozone custame did not helpAlways excusing very bad websiteTeam leader also not mainar to tlakSo many issue this productDo not like this product and websiteLast time talk to custame and she said tomorrow will return today call and said not returnPlease I saggeaed that can not buy this product  also did not support           ", "0 users found this review helpful"], ["The worst phone i ever brought, it does not hook up to the network, please don't buy           ", "0 users found this review helpful"], ["Tuch not working in good conditionSpeaker are also not work 100%           ", "0 users found this review helpful"], ["Good product           ", "0 users found this review helpful"], ["value of your money           ", "0 users found this review helpful"], ["One of the Flagship mobile variant of 4 ram 64 rom. Latest pie operating. Boom sound.Feeling owesome . Single camera is very bad to say.  Im very                ", "0 users found this review helpful"], ["First thing I noticed is that the phone OS is slower than I expected. There are lags while using apps and it is not very fluid overall. Additionally, my microphone stopped working in 1-2 months, making it impossible to attend calls with using the headset microphone. Overall disappointed with the experience. Have been a Moto fan but this one was a let down. I would recommend other phones with better specs in the similar price range.           ", "0 users found this review helpful"], ["Though it has 5k mha battery but it drains very fast and charge very slow, and it's very heavy , and no screen protection like gorrilla , so disappointed           ", "0 users found this review helpful"], ["Battery and Performance at its best           ", "0 users found this review helpful"], ["Awesome phone..           ", "0 users found this review helpful"], ["Light weight and elegant look           ", "0 users found this review helpful"], ["Good product, like it           ", "0 users found this review helpful"], ["Have been using this phone for over a month now and found that it's an average phone. I bought this as a back up phone,  as my Moto G4 Plus started having battery issues. At first the sound of 5000 mAh battery sounded amazing!In the first week,  the battery stayed up for 37-40 hrs with minimal to no usage. Now with some use the battery lasts 24-25 hrs.The camera is decent, the UI is good. Fingerprint sensor is ok. Face detection is amazing and very good. The battery drains out pretty fast if you use the WiFi hotspot. Phone doesn't heat up that bad but still gets warm. I really hope that the charger lasts as it seems like if the charger falls it would be very expensive to replace.There are other phone options out in the market that one can choose from and you would only buy this for the brand name. But then, Motorola service is really pathetic too.           ", "0 users found this review helpful"], ["Little issue with calling, may be due to sim card.           ", "0 users found this review helpful"], ["Using for  past one week. No issues. Working as expected. Didn't find any fault in terms of performance. Like all other phones in the simil budget , ear phones given are of normal quality.           ", "0 users found this review helpful"]]}{"rating": "3.9", "based_on": "51,401", "reviews,useful": [["Phone is good. Performance of phone is also good. But while charging phone gets too hot but it also comes to normal after some time.", "4 users found this review helpful"], ["I did not like the product ....Because ....It gets heated up while charging .....n the battery also drains v soon.", "4 users found this review helpful"], ["Fantastic phone having sparking speed of processor this,phone does,not lagging during heavy game playing , camera is awesome in this range , battery backup is good, and the most important is the response of touch is owesome it take just twinkling of eye speed to change from one to another app .great I but this at very affordable price of 7250 during exchange period include 10% to I fully satisfied with this hand phone and recommended to all to go through ....", "4 users found this review helpful"], ["The phone is amazing. Early delivered by Amazon. Nicely packed. Light weighted phone, no lagging issues, camera is good, built quality is also good, class phone at this price. Thanks Moto & Amazon     ", "3 users found this review helpful"], ["I have been a Motorola loyalist and was very excited to buy this phone.. ordered the phone on the day of it's launch.. the delivery was delayed , amazon to blame!The phone is disappointing.. the metal is peeling off from all edges.. It has been only a month and I feel like giving up on this phone. Not a recommended one!", "3 users found this review helpful"], ["Good in overal performance but below thinks are still note able1. Camera quality is not much better,2. Camera application crashs very frequently.3. Getting heat while charging with power Banks4. Display flickr when phone is battery saver mode5. Contact seen only after importing to phone memory6. Ringtones setting limited to folder access.7. 24Hrs idle backup with 4G connect.8. Mobile network going down (not sure network or mobile issue)", "3 users found this review helpful"], ["Using from 15 days...when we use one sim network is fine but when i use 2 sims... network fluctuate too much between 4G and 3G.Its very irritating.", "3 users found this review helpful"], ["I had buy this in prize 13999/- with discount (10% dis.) using HDFC Card. Amazon gives such surprizes I like that.# I am writing this review after 1 month using.   It's premium look great.   Light weight & comfortable while using.   Battery performance is good.Minor heating issue while charging, because of Turbo Power charging.   Camera is good,but not upto the mark.Gives 13+13 rear camera for Depth effect.    one day when I click some pictures, camera does not get responded, it has suddenly stopped & close the camera app.when I  Restart the phone camera gets work. I request for Moto plzzz..give camera updates for such kind of problems. Rather than camera is well.   Storage capacity is great on this prize.   Finger print sensor is good but not scratch proof.   Sound quality is great.                Well.... If u have Moto lovers and want great experience.and your budget is in this prize range then go for it.            ", "2 users found this review helpful"], ["Bought this phone and sold it within the same week! I was at my friend's place and it would not connect to the TP-Link router. I did some research online that there's a known issue with this phone that it does not connect to certain routers from TP-Link! How ridiculous is that? Not buying another Moto phone again.", "2 users found this review helpful"], ["Good camera.No hang while playing games.Accepting high graphics games.High sensitivity finger print sensor.Quick charging.Little heat during charging. But that's due to turbo charger (fast charge). No heat while using normal charger.", "2 users found this review helpful"], ["Phone is good, Sound quality is awesome , feature is nice, camera quality is better  but only one sim having 4 g and another having 3 g , when I returned my phone cause of display issue again I got scratch cell phone from Amazon. I am requesting Amazon whenever return initiate please make sure that you are giving nice and new things to customer instead of used .I noticed one more thing which is my back side cover of cell phone was rubbed.", "2 users found this review helpful"], ["I have  been using this mobile for 2 months. But i am not satisfied with the over all performance.The USP camera is average the professional mode is good for nothing.Sime times while switching b/w d apps it gives black screen as if got hanged.. but manages to come out.Plz check other options before buying it.", "2 users found this review helpful"], ["Contacts can only be saved to Google mail I'd. There is no option for saving the contact on phone memory. There should be an option in the hands of user where he/she wants to save. It should not be forced which is not customer friendly. Rear camera output is not that good as said or publicised. Front camera output is still better. Processing is not that fast. Only plus point is 64gb internal memory. Overall it is just a normal phone. Cost seems to be bit on higher side. Buying Moto g 5s with external memory card can b better option at much lower cost.Think twice & compare fr better deal. Company is just twisting & presenting things differentlyThanks", "2 users found this review helpful"], ["I used many brands like sony,asus, Lenovo,Lg, Samsung but this moto g5s plus is one of the best phone i ever have !This phone has 4gb of ram ,which make it like  butter smooth,never hang I watched Full hd movie ,play high end games like asphalt,open many app in background but this beast performs very well.Now come to camera ,camera is double with dual flesh led.No doubt picture is decent and selfie camera also has led so in night no need to worry can click photo in power cut too ;)Latest nougat and waiting for oreo update soon.Guys go  and buy it without any second thoughtyou will never regret .Motorola name is enough.", "2 users found this review helpful"], ["Build and design are awesome, in terms of camera it dont satisfy my expectation , i dont know may be i expect too much?. I  was using moto g4 plus , as compare to it moto g5 s plus doesn't  beat  in terms of camera, i think g4 plus does better in front cam. Still good phone though.", "2 users found this review helpful"], ["Battery  -  9 hours of full usage from 100 percent to 0 percent when brightness is on 50 percent  ( gaming + webrowsing )sound quality nd loudness - perfect for me.camera - not as cool as it should be (keeping it mind that it has dual camera)turbo charging - amazing ( keep in mind that as phone heats up  turbo charging slows down automatically . I noticed 20 -25 percent increase in battery level in 15 mins, after that phone heats up so charging slows down .", "2 users found this review helpful"], ["Gets heated for some time , mostly in charging time....Used for over three weeks but didn't got any issues with the usage , battery power is not so good as it gives around 16 hours backup when using internet for around mostly goes whole day....", "2 users found this review helpful"], ["I have used Redmi Note 4, and then this one. Camera seems to be Good compared to Redmi...Battery should have been given more capacity it's just 3000 mah, if used little more, would only last half a day...Further, the options given in Redmi are more compared to this Moto...Finding this to be Hopeless in front of it...It doesn't have Call Recording, still pressing of buttons for Screen shot, Felt like going back...The thing which I like the design of Moto Phones...Everything else is Very Well Screwed by LENOVO..!! You don't get to  next level OS..!! Many More to List.!!", "2 users found this review helpful"], ["Hi..the phoneis fine but the charger is making quite a loud hissing sort of sound while charging. Please help it feels pretty unsafe charging it anywhere around you. I used a Moto phone with turbo charger earlier but had no sound. Please help.", "2 users found this review helpful"], ["Disappointed. Expected it to be an upgrade from Moto G4S plus.The back of the phone is very slippery ... your only choice is risk breaking it or get an ugly cover to make it thicker and heavier.Weight is more than G4S+Voice quality on phone call is poorer as compared to G4S plus.Camera is superior to G4S+Overall not very pleased with the performance.", "2 users found this review helpful"], ["It's been 15 days that i am using this phone, first 10 days battery performance is okay but i have noticed from last battery reducing very quickly even phone on stand by. it' really not good :(Camera performance : while clicking picture outside in sunlight, photos are good but not up to mark. i think this happened because of now moto has owned by Lenovo :(In low light picture are okay from primary camera but in want to take selfies, it's not good.Multi tasking on this phone is really good.Games are work well on this device.Turbo charger is good. 0 - 100 % charge in 1 hr 40 min perfectly.With single speaker, sound is really good. but headphones are one of the worst i have ever used.Even speaking on call while using headphone sounds comes very low.", "2 users found this review helpful"], ["BEST IN CLASS (WORTH IT)Some imp points to be noted: ( FOR PEOPLE USING THE DEVICE NOT FOR FLAUNTING BUT TO  PUT EVERY BIT OF TECHNOLOGY TO USE)1.Heats during charging but also cools fast.2.dual camera ( 2nd monochrome camera is not accessible separately.3.Dual camera system good..but sometimes it fails (very few times negligible)4.Noise cancellation  (camera picture noise cancellation is too strong it removes the details)not alarming but can be problematic for people buying only for camera purposes5.NO MAGNETOMETER (magnetic compass) only a hint to navigators rangers etc (who go all terrain voyages)", "2 users found this review helpful"], ["Great for the budget . Can consider mi a1Again writing after 2 months great phone although the dual camera setup could not justify itselfAgain after 1 year still not able to get Android update ......Damn what is is lenovo doing to moto lineup wish google would buy it back", "2 users found this review helpful"], ["Superb PhoneThere is no depth mode adjustment bar missing as given in previous reviews.Overall Nice , handy, classy, sexy phone.Just go for it without thinking.Moto is way far better than mi, coolpad or any other chinese devices.", "2 users found this review helpful"], ["Using phone since 18th Dec. Phone is good but charger is taking more than 5 hours in full charging. Moreover, while charging if I touch the phone, charging stops and I have to connect the charger again.", "2 users found this review helpful"], ["Though it is a Motorola device which was known for it's blazing fast SW updates but that's not the case with this one anymore. It has been a year now since it was launched into the market but no Android 8.1 till now. It runs on Android 7.1.1 which still is very buggy. Battery has not been optimized well, as it shows falls battery percentage. I would not recommend this phone at this point now. You can have a look at the new Nokia devices. They are actually doing what Motorola was suppose to do. Or even Xiomi phones are giving a really very good value for money. Which is not the case with Motorola.", "2 users found this review helpful"], ["The phone is truly efficient and has amazing features. The camera, display and other functions are superb. It is totally worth the price. After getting some system updates, there are no further heating problems while charging or using it. Love this phone. <3And I received the phone within two days of ordering, and in perfect condition. So kudos to Amazon.in!", "2 users found this review helpful"], ["I m not satisfied your this product because I have many issues facing in my handset. Charger Cable is Not Working from phone purchased 2 month after, Finger Print is Not Working properly , Network issues in my handset, Some time Phone systems stopped automatically, heating Issues etc . I really tell you dear when I look for advertising that time I'm very happy to see Motorola G5s plus is very nice handset but I tell you that time I m very frustrated & I have very nice experience im used many Motorola phones.Please do the reply I'm waiting for your good Answer.ThankAnurag9821206243", "2 users found this review helpful"], ["Hi guys, I'm giving this review after usage of 6 months.* Fast Charing is not happening.* Mobile getting switchoff with out any action.* Too much heating if you are not using the  mobile also.*  Even if you put charging also after one hour it  was getting charge only 10%*  Even 4gb ram is waste because mobile is  getting stuck for every action.In my point of you please don't buy this mobile. First 3-4 months it works properly but after that performance is nothing. Not a worth of money.", "1 users found this review helpful"], ["The Phone is awesome.I bought it for 14000rs from Amazon it worths every penny.Pros:Ram Management is goodExcellent build qualityNice Gaming experience- no lags or no frame dropsFaster finger print sensorAwesome displayGood Cameras-Use Professional mode you will get best resultsBattery performance is decentFast chargingCons:Portrait mode is not working perfectly in low light", "1 users found this review helpful"], ["Not at all up to the expectations. The phone has serious design flaw. The protruding camera is a real pain. You have to be very careful while placing the phone anywhere.3 weeks of usage:Battery is drainingDust getting inside the sealed packed camera lense, no idea howI have already been to service center twice for charging related issuesNOT WORTH 13-14k range[UPDATE]Rear Camera quality keeps deteriorating", "1 users found this review helpful"], ["awesome product ever used ,,,earlier i was always using and also suggesting every one for samsung  only...but latter on i changed my opinion as my younger brother suggested me about moto products,in fact in moto brand i am satisfied with the moto g5s+ the brand and model is outstanding... and readers i hope that you all will aso would like to give feedback after using the brand.. ***********and again i would say that in this price range you wont get so better product.", "1 users found this review helpful"], ["I have used both the g5 plus and the g5s plusIn first lookThe g5s plus is just same as g5 plus apart from the build quality and the larger screen sizeThe performance is also the sameBut these time there is bloatware includedAnd the colour for the moto display is fixed to blue and that was quite disappointingThe battery is capable for a day just like g5 plusAnd the turbocharger sure helps a lotThe camera is not what i expected it needs improvments on both front and the rear .Images from the Front camera gets dark when its exposed to light which many other camera in price bracket does but it was absent on the g5 plusAnd the low light capability is horrible .While the rear camera is more sharper than g5 plus but it lacks the brightness of g5 plus and the rgb sensor only works the other one is only for depth measuring .I believe that these issues could be solved by updatesApart from the camera this I a solid product", "1 users found this review helpful"], ["Good looking phone, but back of it is very slippery. Have to be extra careful in handling.Also what I didn't like is, there was no instruction manual in it. Not even starting up the phone.", "1 users found this review helpful"], ["One star less for the disappointing camera.Dual camera doesn't work much good even in proper lighting. Depth effect and single camera also not great in comparison to other phone(Redmi A1)If dual camera is your main factor to buy this, please avoid this one", "1 users found this review helpful"], ["Using from 6 month. No issues as of now.Battery charges very fast. Also sustains for 12 hours on 4G data.Not happy with Battery life. other then this everything is good.Screen is very clearCamera is goodTouch button is fancy and overall good look.", "1 users found this review helpful"], ["Good phone at this price range. (I am writing this review after using it for 3 months and I know I am late :p )Pros1. Fast charging2. Memory managementConsCamera is okay kind. My expectation was little high because of dual rear camera feature.Thanks Amazon for swift delivery.Happy customer here:)", "1 users found this review helpful"], ["Good build qualityNice fingerprint sensor and oneway navigation buttonTurbo charging support (Great)Very decent camera performancePowerful 2GHz octa-core processor.4GB of RAM and 64GB of internal storage - Added advantage.3000mAh gives long lasting battery!Getting regular security updates!", "1 users found this review helpful"], ["The product was good and looks awesome. But the mobile was too slippery and the dual camera wasn't the best. At this price range they should have provided more", "1 users found this review helpful"], ["Solid device. No heating.nice camera and good battery life. Screen is bright and nice color reproduction. Cam clarity is good but colors are bit saturated and not much use of dual cam setup.performance is okay for day to day use.fast charging is really fast until 90% then slows down.battery lasts a day and half.", "1 users found this review helpful"], ["Solid device. No heating.nice camera and good battery life. Screen is bright and nice color reproduction. Cam clarity is good but colors are bit saturated and not much use of dual cam setup.performance is okay for day to day use.fast charging is really fast until 90% then slows down.battery lasts a day and half.", "1 users found this review helpful"], ["THIS IS TO INFORM YOU THAT RECENTLY I PURCHASE MOTO G5S PLUS MOBILE  FROM YOU.  MOBILE IS GOOD BUT CHARGERIS BAD.  BECAUSE WHILE CHARGING MOBILE WAS HEATING.  CHARGER PROBLEM.  IT WAS MADE IN CHINA CHARGER.IF POSSIBLE PL REPLACE MY CHARGER WITH GOOD CHARGER.  YOUR REPUTATION WILL BE INCREASE.I EXPECT YOUR FAVOURABLE REPLY VERY SOON.PHANI KUMAR,  VIJAYAWADA", "1 users found this review helpful"], ["Lovely phone at this price I got it very soon by Amazon in 3-4 days and the packing was also good by Amazon loved the phone and very good cameras even the battery backup and interface of phone is also good worth buying     ", "1 users found this review helpful"], ["It's a great phone for the price. Purchased it for my father. For his usage, it is fast, no lagging, great battery backup, and not to forget, gets the updated android.Camera is great on the price you pay. Compared to the competition on this price segment, it has the best camera. Love the Depth focus feature.", "1 users found this review helpful"], ["good mobile...camera was the USP of this mobile...but not able to impress with it yet.i think the camera of G5 plus is better..dual cameras are ok ok...but the built is really cool and corning gorilla glass another good thing...Better than Redmi phones since moto is a more reliable....You can go for it", "1 users found this review helpful"], ["Awesome phone with awesome built quality. decent camera with depth it doesn't give sharp images as compared to mi A1 or other phone.Not awesome at low light images but quite decent what u can expect from a mid range phone, front camera is awesome in low light as well with front falsh. Speaker is good Enough for a mid range phone. Phone gets heat while charging or if u use it continuously for half an hour, if u are a decent user of phone that it lasts for a day Otherwiseu have to charge it twice but i don't mind it to charge twice becoz it also have the turbo charging takes 1 hour 40min approx to charge it full from 0-100. Now its upto you", "1 users found this review helpful"], ["This is as much one can expect from a budget phone. I donot know why few people are giving one star but this is worth it. Camera in depth mode is bit laggy but that apart everything else seems to be good. For such a big phone with just 3000 mah, it easily lasts a day. So, I donot know what is the expectation of people giving 1 or 2 strar. For 15k do they expect DSLR level camera?", "1 users found this review helpful"], ["Worst gift I ever bought... Camera is not at all works fine. A noisy sound is coming from the backside camera. Amazon returned it for replacement after some test with some app and again got a same problem. So we returned it and got refund after the test.That app clearly showed them that this phone is defective. So Amazon helped in all the way for full refund. Worst phone! Not advisable at this price...", "1 users found this review helpful"], ["I have been using this mobile from last one month and till now it's working amazing.Multiple applications are running without any issue.The design is also very sleek n good lookingJust one reason I haven't given 5 star is the camera feature \"Depth Enabled\" is not strong. Same feature of xiomi A1 is far better.Rest I loved it.", "1 users found this review helpful"], ["I have been using this phone for a week now. Got it delivered next day itself. I am happy with the performance as well. Looks great, feels great. Performance smooth as butter. The only downer is the absence of a dedicated sd card slot. But if you're are not someone for whom storage is a priority, then the 64 gb internal memory is good enough. It gives you around 50 gb free out of the box.All in all a great deal!!", "1 users found this review helpful"]]}{"rating": "4.2", "based_on": "2,022", "reviews,useful": [["If you like the design and you want a big screen, the Moto G7 could be your best bet at this price. It   s also a great choice for anyone upgrading from older Moto phones, assuming you liked them. If you can scrape together an extra rupees go for other..CAMERA, BATTERY, SCREEN, CHARGING           ", "75 users found this review helpful"], ["finally I got it..nsearching for genuine 5000 Battery mobile after lenovo p2###search ends here.nbattery backup same or above than lenovo p2ncharging speed is good but not as good as mentioned.ncamera quality is averagenbuild quality🤸nsound averagenno noticeable heating during heavy usagenno lagging on PUBGnIt's far better than ASUS MAX PRO M2 nI used continuely 29 hours hardly without a single charge...played 8 PUBG matches..nlittle more weight than max pro// but result is theren###charging time..50 percentage ...it takes 57 minutesntype -Cnqood call qualitynif you are a heavy user no options as of now...", "68 users found this review helpful"], ["Moto G7 is a decent mid range phone with all the required utilities. Go for it without any doubt. I am writing this review after purchasing and exploring this phone.5000 mah battery and 4 Gb RAM that is what makes it even much better.           ", "54 users found this review helpful"], ["Moto G7 is a decent mid range phone with all the required utilities. Go for it without any doubt. I am writing this review after purchasing and exploring this phone.5000 mah battery and 4 Gb RAM that is what makes it even much better.           ", "53 users found this review helpful"], ["I don't have any problem with phone configuration, but the Amazon replacement service and call centre guys are pathetic. They forced me install app and continue with troubleshooting when they realised that technical team not available at my address. Also, I have already spent 45 mins talking to them on phone and on top of that they want me to install app and work with them to identify problem. Why I should invest a time when bought a new phone . If they don't have technical team to check phone then must cancel my order and initiate refund. Call centre guys was so rude and hang up the call when I was talking. This is really cheap and worst my first experience with Amazon, Amazon business team must get involved here and work on how this replacement gap can be fulfilled. Call centre guys are like handicapped and unable to take decision really they like helpless. I again request to cancel my order so I can buy another phone if you don't have technical team in my area.0 ratings for pathetic call centre guys who talk to me today on 30th March at around 11 AM for 45 mins, please check entire recording if you fell I am laying.           ", "52 users found this review helpful"]]}{"rating": "3.9", "based_on": "51,401", "reviews,useful": [["Phone is good. Performance of phone is also good. But while charging phone gets too hot but it also comes to normal after some time.", "4 users found this review helpful"], ["I did not like the product ....Because ....It gets heated up while charging .....n the battery also drains v soon.", "4 users found this review helpful"], ["Fantastic phone having sparking speed of processor this,phone does,not lagging during heavy game playing , camera is awesome in this range , battery backup is good, and the most important is the response of touch is owesome it take just twinkling of eye speed to change from one to another app .great I but this at very affordable price of 7250 during exchange period include 10% to I fully satisfied with this hand phone and recommended to all to go through ....", "4 users found this review helpful"], ["The phone is amazing. Early delivered by Amazon. Nicely packed. Light weighted phone, no lagging issues, camera is good, built quality is also good, class phone at this price. Thanks Moto & Amazon     ", "3 users found this review helpful"], ["I have been a Motorola loyalist and was very excited to buy this phone.. ordered the phone on the day of it's launch.. the delivery was delayed , amazon to blame!The phone is disappointing.. the metal is peeling off from all edges.. It has been only a month and I feel like giving up on this phone. Not a recommended one!", "3 users found this review helpful"], ["Good in overal performance but below thinks are still note able1. Camera quality is not much better,2. Camera application crashs very frequently.3. Getting heat while charging with power Banks4. Display flickr when phone is battery saver mode5. Contact seen only after importing to phone memory6. Ringtones setting limited to folder access.7. 24Hrs idle backup with 4G connect.8. Mobile network going down (not sure network or mobile issue)", "3 users found this review helpful"], ["Using from 15 days...when we use one sim network is fine but when i use 2 sims... network fluctuate too much between 4G and 3G.Its very irritating.", "3 users found this review helpful"], ["I had buy this in prize 13999/- with discount (10% dis.) using HDFC Card. Amazon gives such surprizes I like that.# I am writing this review after 1 month using.   It's premium look great.   Light weight & comfortable while using.   Battery performance is good.Minor heating issue while charging, because of Turbo Power charging.   Camera is good,but not upto the mark.Gives 13+13 rear camera for Depth effect.    one day when I click some pictures, camera does not get responded, it has suddenly stopped & close the camera app.when I  Restart the phone camera gets work. I request for Moto plzzz..give camera updates for such kind of problems. Rather than camera is well.   Storage capacity is great on this prize.   Finger print sensor is good but not scratch proof.   Sound quality is great.                Well.... If u have Moto lovers and want great experience.and your budget is in this prize range then go for it.            ", "2 users found this review helpful"], ["Bought this phone and sold it within the same week! I was at my friend's place and it would not connect to the TP-Link router. I did some research online that there's a known issue with this phone that it does not connect to certain routers from TP-Link! How ridiculous is that? Not buying another Moto phone again.", "2 users found this review helpful"], ["Good camera.No hang while playing games.Accepting high graphics games.High sensitivity finger print sensor.Quick charging.Little heat during charging. But that's due to turbo charger (fast charge). No heat while using normal charger.", "2 users found this review helpful"], ["Phone is good, Sound quality is awesome , feature is nice, camera quality is better  but only one sim having 4 g and another having 3 g , when I returned my phone cause of display issue again I got scratch cell phone from Amazon. I am requesting Amazon whenever return initiate please make sure that you are giving nice and new things to customer instead of used .I noticed one more thing which is my back side cover of cell phone was rubbed.", "2 users found this review helpful"], ["I have  been using this mobile for 2 months. But i am not satisfied with the over all performance.The USP camera is average the professional mode is good for nothing.Sime times while switching b/w d apps it gives black screen as if got hanged.. but manages to come out.Plz check other options before buying it.", "2 users found this review helpful"], ["Contacts can only be saved to Google mail I'd. There is no option for saving the contact on phone memory. There should be an option in the hands of user where he/she wants to save. It should not be forced which is not customer friendly. Rear camera output is not that good as said or publicised. Front camera output is still better. Processing is not that fast. Only plus point is 64gb internal memory. Overall it is just a normal phone. Cost seems to be bit on higher side. Buying Moto g 5s with external memory card can b better option at much lower cost.Think twice & compare fr better deal. Company is just twisting & presenting things differentlyThanks", "2 users found this review helpful"], ["I used many brands like sony,asus, Lenovo,Lg, Samsung but this moto g5s plus is one of the best phone i ever have !This phone has 4gb of ram ,which make it like  butter smooth,never hang I watched Full hd movie ,play high end games like asphalt,open many app in background but this beast performs very well.Now come to camera ,camera is double with dual flesh led.No doubt picture is decent and selfie camera also has led so in night no need to worry can click photo in power cut too ;)Latest nougat and waiting for oreo update soon.Guys go  and buy it without any second thoughtyou will never regret .Motorola name is enough.", "2 users found this review helpful"], ["Build and design are awesome, in terms of camera it dont satisfy my expectation , i dont know may be i expect too much?. I  was using moto g4 plus , as compare to it moto g5 s plus doesn't  beat  in terms of camera, i think g4 plus does better in front cam. Still good phone though.", "2 users found this review helpful"], ["Battery  -  9 hours of full usage from 100 percent to 0 percent when brightness is on 50 percent  ( gaming + webrowsing )sound quality nd loudness - perfect for me.camera - not as cool as it should be (keeping it mind that it has dual camera)turbo charging - amazing ( keep in mind that as phone heats up  turbo charging slows down automatically . I noticed 20 -25 percent increase in battery level in 15 mins, after that phone heats up so charging slows down .", "2 users found this review helpful"], ["Gets heated for some time , mostly in charging time....Used for over three weeks but didn't got any issues with the usage , battery power is not so good as it gives around 16 hours backup when using internet for around mostly goes whole day....", "2 users found this review helpful"], ["I have used Redmi Note 4, and then this one. Camera seems to be Good compared to Redmi...Battery should have been given more capacity it's just 3000 mah, if used little more, would only last half a day...Further, the options given in Redmi are more compared to this Moto...Finding this to be Hopeless in front of it...It doesn't have Call Recording, still pressing of buttons for Screen shot, Felt like going back...The thing which I like the design of Moto Phones...Everything else is Very Well Screwed by LENOVO..!! You don't get to  next level OS..!! Many More to List.!!", "2 users found this review helpful"], ["Hi..the phoneis fine but the charger is making quite a loud hissing sort of sound while charging. Please help it feels pretty unsafe charging it anywhere around you. I used a Moto phone with turbo charger earlier but had no sound. Please help.", "2 users found this review helpful"], ["Disappointed. Expected it to be an upgrade from Moto G4S plus.The back of the phone is very slippery ... your only choice is risk breaking it or get an ugly cover to make it thicker and heavier.Weight is more than G4S+Voice quality on phone call is poorer as compared to G4S plus.Camera is superior to G4S+Overall not very pleased with the performance.", "2 users found this review helpful"], ["It's been 15 days that i am using this phone, first 10 days battery performance is okay but i have noticed from last battery reducing very quickly even phone on stand by. it' really not good :(Camera performance : while clicking picture outside in sunlight, photos are good but not up to mark. i think this happened because of now moto has owned by Lenovo :(In low light picture are okay from primary camera but in want to take selfies, it's not good.Multi tasking on this phone is really good.Games are work well on this device.Turbo charger is good. 0 - 100 % charge in 1 hr 40 min perfectly.With single speaker, sound is really good. but headphones are one of the worst i have ever used.Even speaking on call while using headphone sounds comes very low.", "2 users found this review helpful"], ["BEST IN CLASS (WORTH IT)Some imp points to be noted: ( FOR PEOPLE USING THE DEVICE NOT FOR FLAUNTING BUT TO  PUT EVERY BIT OF TECHNOLOGY TO USE)1.Heats during charging but also cools fast.2.dual camera ( 2nd monochrome camera is not accessible separately.3.Dual camera system good..but sometimes it fails (very few times negligible)4.Noise cancellation  (camera picture noise cancellation is too strong it removes the details)not alarming but can be problematic for people buying only for camera purposes5.NO MAGNETOMETER (magnetic compass) only a hint to navigators rangers etc (who go all terrain voyages)", "2 users found this review helpful"], ["Great for the budget . Can consider mi a1Again writing after 2 months great phone although the dual camera setup could not justify itselfAgain after 1 year still not able to get Android update ......Damn what is is lenovo doing to moto lineup wish google would buy it back", "2 users found this review helpful"], ["Superb PhoneThere is no depth mode adjustment bar missing as given in previous reviews.Overall Nice , handy, classy, sexy phone.Just go for it without thinking.Moto is way far better than mi, coolpad or any other chinese devices.", "2 users found this review helpful"], ["Using phone since 18th Dec. Phone is good but charger is taking more than 5 hours in full charging. Moreover, while charging if I touch the phone, charging stops and I have to connect the charger again.", "2 users found this review helpful"], ["Though it is a Motorola device which was known for it's blazing fast SW updates but that's not the case with this one anymore. It has been a year now since it was launched into the market but no Android 8.1 till now. It runs on Android 7.1.1 which still is very buggy. Battery has not been optimized well, as it shows falls battery percentage. I would not recommend this phone at this point now. You can have a look at the new Nokia devices. They are actually doing what Motorola was suppose to do. Or even Xiomi phones are giving a really very good value for money. Which is not the case with Motorola.", "2 users found this review helpful"], ["The phone is truly efficient and has amazing features. The camera, display and other functions are superb. It is totally worth the price. After getting some system updates, there are no further heating problems while charging or using it. Love this phone. <3And I received the phone within two days of ordering, and in perfect condition. So kudos to Amazon.in!", "2 users found this review helpful"], ["I m not satisfied your this product because I have many issues facing in my handset. Charger Cable is Not Working from phone purchased 2 month after, Finger Print is Not Working properly , Network issues in my handset, Some time Phone systems stopped automatically, heating Issues etc . I really tell you dear when I look for advertising that time I'm very happy to see Motorola G5s plus is very nice handset but I tell you that time I m very frustrated & I have very nice experience im used many Motorola phones.Please do the reply I'm waiting for your good Answer.ThankAnurag9821206243", "2 users found this review helpful"], ["Hi guys, I'm giving this review after usage of 6 months.* Fast Charing is not happening.* Mobile getting switchoff with out any action.* Too much heating if you are not using the  mobile also.*  Even if you put charging also after one hour it  was getting charge only 10%*  Even 4gb ram is waste because mobile is  getting stuck for every action.In my point of you please don't buy this mobile. First 3-4 months it works properly but after that performance is nothing. Not a worth of money.", "1 users found this review helpful"], ["The Phone is awesome.I bought it for 14000rs from Amazon it worths every penny.Pros:Ram Management is goodExcellent build qualityNice Gaming experience- no lags or no frame dropsFaster finger print sensorAwesome displayGood Cameras-Use Professional mode you will get best resultsBattery performance is decentFast chargingCons:Portrait mode is not working perfectly in low light", "1 users found this review helpful"], ["Not at all up to the expectations. The phone has serious design flaw. The protruding camera is a real pain. You have to be very careful while placing the phone anywhere.3 weeks of usage:Battery is drainingDust getting inside the sealed packed camera lense, no idea howI have already been to service center twice for charging related issuesNOT WORTH 13-14k range[UPDATE]Rear Camera quality keeps deteriorating", "1 users found this review helpful"], ["awesome product ever used ,,,earlier i was always using and also suggesting every one for samsung  only...but latter on i changed my opinion as my younger brother suggested me about moto products,in fact in moto brand i am satisfied with the moto g5s+ the brand and model is outstanding... and readers i hope that you all will aso would like to give feedback after using the brand.. ***********and again i would say that in this price range you wont get so better product.", "1 users found this review helpful"], ["I have used both the g5 plus and the g5s plusIn first lookThe g5s plus is just same as g5 plus apart from the build quality and the larger screen sizeThe performance is also the sameBut these time there is bloatware includedAnd the colour for the moto display is fixed to blue and that was quite disappointingThe battery is capable for a day just like g5 plusAnd the turbocharger sure helps a lotThe camera is not what i expected it needs improvments on both front and the rear .Images from the Front camera gets dark when its exposed to light which many other camera in price bracket does but it was absent on the g5 plusAnd the low light capability is horrible .While the rear camera is more sharper than g5 plus but it lacks the brightness of g5 plus and the rgb sensor only works the other one is only for depth measuring .I believe that these issues could be solved by updatesApart from the camera this I a solid product", "1 users found this review helpful"], ["Good looking phone, but back of it is very slippery. Have to be extra careful in handling.Also what I didn't like is, there was no instruction manual in it. Not even starting up the phone.", "1 users found this review helpful"], ["One star less for the disappointing camera.Dual camera doesn't work much good even in proper lighting. Depth effect and single camera also not great in comparison to other phone(Redmi A1)If dual camera is your main factor to buy this, please avoid this one", "1 users found this review helpful"], ["One star less for the disappointing camera.Dual camera doesn't work much good even in proper lighting. Depth effect and single camera also not great in comparison to other phone(Redmi A1)If dual camera is your main factor to buy this, please avoid this one", "1 users found this review helpful"], ["Good phone at this price range. (I am writing this review after using it for 3 months and I know I am late :p )Pros1. Fast charging2. Memory managementConsCamera is okay kind. My expectation was little high because of dual rear camera feature.Thanks Amazon for swift delivery.Happy customer here:)", "1 users found this review helpful"], ["Good build qualityNice fingerprint sensor and oneway navigation buttonTurbo charging support (Great)Very decent camera performancePowerful 2GHz octa-core processor.4GB of RAM and 64GB of internal storage - Added advantage.3000mAh gives long lasting battery!Getting regular security updates!", "1 users found this review helpful"], ["The product was good and looks awesome. But the mobile was too slippery and the dual camera wasn't the best. At this price range they should have provided more", "1 users found this review helpful"], ["Fast delivery by Amazon and the Moto G5 a plus is too good nice phone by Motorola. Camera quality is good. No heating issue even you play 4-5 havey games like Modern combat, need for speed etc. Metal fenishing is too good. Speeker is too louder mice quality is good. Overall phone is awesome in this price range.", "1 users found this review helpful"], ["Fast delivery by Amazon and the Moto G5 a plus is too good nice phone by Motorola. Camera quality is good. No heating issue even you play 4-5 havey games like Modern combat, need for speed etc. Metal fenishing is too good. Speeker is too louder mice quality is good. Overall phone is awesome in this price range.", "1 users found this review helpful"], ["THIS IS TO INFORM YOU THAT RECENTLY I PURCHASE MOTO G5S PLUS MOBILE  FROM YOU.  MOBILE IS GOOD BUT CHARGERIS BAD.  BECAUSE WHILE CHARGING MOBILE WAS HEATING.  CHARGER PROBLEM.  IT WAS MADE IN CHINA CHARGER.IF POSSIBLE PL REPLACE MY CHARGER WITH GOOD CHARGER.  YOUR REPUTATION WILL BE INCREASE.I EXPECT YOUR FAVOURABLE REPLY VERY SOON.PHANI KUMAR,  VIJAYAWADA", "1 users found this review helpful"], ["Lovely phone at this price I got it very soon by Amazon in 3-4 days and the packing was also good by Amazon loved the phone and very good cameras even the battery backup and interface of phone is also good worth buying     ", "1 users found this review helpful"], ["It's a great phone for the price. Purchased it for my father. For his usage, it is fast, no lagging, great battery backup, and not to forget, gets the updated android.Camera is great on the price you pay. Compared to the competition on this price segment, it has the best camera. Love the Depth focus feature.", "1 users found this review helpful"], ["good mobile...camera was the USP of this mobile...but not able to impress with it yet.i think the camera of G5 plus is better..dual cameras are ok ok...but the built is really cool and corning gorilla glass another good thing...Better than Redmi phones since moto is a more reliable....You can go for it", "1 users found this review helpful"], ["Awesome phone with awesome built quality. decent camera with depth it doesn't give sharp images as compared to mi A1 or other phone.Not awesome at low light images but quite decent what u can expect from a mid range phone, front camera is awesome in low light as well with front falsh. Speaker is good Enough for a mid range phone. Phone gets heat while charging or if u use it continuously for half an hour, if u are a decent user of phone that it lasts for a day Otherwiseu have to charge it twice but i don't mind it to charge twice becoz it also have the turbo charging takes 1 hour 40min approx to charge it full from 0-100. Now its upto you", "1 users found this review helpful"], ["This is as much one can expect from a budget phone. I donot know why few people are giving one star but this is worth it. Camera in depth mode is bit laggy but that apart everything else seems to be good. For such a big phone with just 3000 mah, it easily lasts a day. So, I donot know what is the expectation of people giving 1 or 2 strar. For 15k do they expect DSLR level camera?", "1 users found this review helpful"], ["Worst gift I ever bought... Camera is not at all works fine. A noisy sound is coming from the backside camera. Amazon returned it for replacement after some test with some app and again got a same problem. So we returned it and got refund after the test.That app clearly showed them that this phone is defective. So Amazon helped in all the way for full refund. Worst phone! Not advisable at this price...", "1 users found this review helpful"], ["I have been using this mobile from last one month and till now it's working amazing.Multiple applications are running without any issue.The design is also very sleek n good lookingJust one reason I haven't given 5 star is the camera feature \"Depth Enabled\" is not strong. Same feature of xiomi A1 is far better.Rest I loved it.", "1 users found this review helpful"], ["I have been using this phone for a week now. Got it delivered next day itself. I am happy with the performance as well. Looks great, feels great. Performance smooth as butter. The only downer is the absence of a dedicated sd card slot. But if you're are not someone for whom storage is a priority, then the 64 gb internal memory is good enough. It gives you around 50 gb free out of the box.All in all a great deal!!", "1 users found this review helpful"]]}{"rating": "4.2", "based_on": "2,022", "reviews,useful": [["If you like the design and you want a big screen, the Moto G7 could be your best bet at this price. It   s also a great choice for anyone upgrading from older Moto phones, assuming you liked them. If you can scrape together an extra rupees go for other..CAMERA, BATTERY, SCREEN, CHARGING           ", "75 users found this review helpful"], ["Moto G7 is a decent mid range phone with all the required utilities. Go for it without any doubt. I am writing this review after purchasing and exploring this phone.5000 mah battery and 4 Gb RAM that is what makes it even much better.           ", "54 users found this review helpful"], ["Moto G7 is a decent mid range phone with all the required utilities. Go for it without any doubt. I am writing this review after purchasing and exploring this phone.5000 mah battery and 4 Gb RAM that is what makes it even much better.           ", "53 users found this review helpful"], ["I don't have any problem with phone configuration, but the Amazon replacement service and call centre guys are pathetic. They forced me install app and continue with troubleshooting when they realised that technical team not available at my address. Also, I have already spent 45 mins talking to them on phone and on top of that they want me to install app and work with them to identify problem. Why I should invest a time when bought a new phone . If they don't have technical team to check phone then must cancel my order and initiate refund. Call centre guys was so rude and hang up the call when I was talking. This is really cheap and worst my first experience with Amazon, Amazon business team must get involved here and work on how this replacement gap can be fulfilled. Call centre guys are like handicapped and unable to take decision really they like helpless. I again request to cancel my order so I can buy another phone if you don't have technical team in my area.0 ratings for pathetic call centre guys who talk to me today on 30th March at around 11 AM for 45 mins, please check entire recording if you fell I am laying.           ", "52 users found this review helpful"], ["Excellent phone, great display and great camera. The colors are very vivid and sharp. Sound quality is very good. The back is made of very hard polycarbonate. The camera sensor is Omnivision and even low light shots turn out good. If Apple's share in the US is slipping very fast and this phone is a hot seller in USA, then Motorola must have read what people really need. Mainly we Indians are obsessed about the useless aspects of a phone. First of all it must be reliable and not let you down. Then comes camera sound etc which is also great. Just go for it!           ", "41 users found this review helpful"], ["Moto G7 Power is a beautiful phone, in its price range with amazing features.The phone has incredible battery life which is compared to any other flagshipAs per camera It's fine and rather than much.. it can capture good day photos and not likely useful for low light photos.Screen resolution is amazing and display is beautiful.Overall I would rate this phone a good in its price range.           ", "38 users found this review helpful"], ["Excellent phone, great display and great camera. The colors are very vivid and sharp. Sound quality is very good. The back is made of very hard polycarbonate. The camera sensor is Omnivision and even low light shots turn out good. If Apple's share in the US is slipping very fast and this phone is a hot seller in USA, then Motorola must have read what people really need. Mainly we Indians are obsessed about the useless aspects of a phone. First of all it must be reliable and not let you down. Then comes camera sound etc which is also great. Just go for it!           ", "36 users found this review helpful"], ["If you like the design and you want a big screen, the Moto G7 could be your best bet at this price. It   s also a great choice for anyone upgrading from older Moto phones, assuming you liked them. If you can scrape together an extra rupees go for other..CAMERA, BATTERY, SCREEN, CHARGING           ", "31 users found this review helpful"], ["I purchase this phone, work properly without hanging and lacking, but camera quality is low compression other phone,All features are good,left camera quality.           ", "16 users found this review helpful"], ["I purchase this phone, work properly without hanging and lacking, but camera quality is low compression other phone,All features are good,left camera quality.           ", "16 users found this review helpful"], ["Very good phone, i m using since one week no heating noticed, display and sound is very good. Battery back is 2 days under normal uses.           ", "14 users found this review helpful"], ["Very good phone, i m using since one week no heating noticed, display and sound is very good. Battery back is 2 days under normal uses.           ", "14 users found this review helpful"], ["Excellent service by Amazon.The phone is also having lot of juice(power) in it.           ", "9 users found this review helpful"], ["Excellent service by Amazon.The phone is also having lot of juice(power) in it.           ", "8 users found this review helpful"], ["I am very pleased with this set           ", "6 users found this review helpful"], ["Good           ", "5 users found this review helpful"], ["Battery life is amazing. I have literally forgotten to charge my phone. Good phone at a decent price           ", "4 users found this review helpful"], ["User friendly,had no problems since it's my third Motorola phone in last 5 years           ", "4 users found this review helpful"], ["Over all good except camera           ", "3 users found this review helpful"], ["Super phone, super battery backup. 2 days charge for regular use with videos, music and calls. Worth it..           ", "3 users found this review helpful"], ["Positives - Great batter life, built quality superb, works seamlessly, decent photos (need to explore more)Negatives - little heavy because of the battery but it was anticipated, face recognition doesn't seem to work at times           ", "3 users found this review helpful"], ["I am not a gamer so this phone suits me. Great battery life (3 day). Great OS.           ", "2 users found this review helpful"], ["AFTER CHARGING 100 PERSENT END OF THE DAY STILL 80 PERCENT. ITS REALLY POWER FULL BATTERY.  IM ALWAYS MOTO LOVER BCS OF STRONG BATTERY AND BUILD QUALITY. WHO WANT A SOLID BATTERY AND BUILD AND QUALITY OF PHONE  U CAN CHOOSE moTO G7 POWER.  LOVE U MOTO..              ", "2 users found this review helpful"], ["I don't have any problem with phone configuration, but the Amazon replacement service and call centre guys are pathetic. They forced me install app and continue with troubleshooting when they realised that technical team not available at my address. Also, I have already spent 45 mins talking to them on phone and on top of that they want me to install app and work with them to identify problem. Why I should invest a time when bought a new phone . If they don't have technical team to check phone then must cancel my order and initiate refund. Call centre guys was so rude and hang up the call when I was talking. This is really cheap and worst my first experience with Amazon, Amazon business team must get involved here and work on how this replacement gap can be fulfilled. Call centre guys are like handicapped and unable to take decision really they like helpless. I again request to cancel my order so I can buy another phone if you don't have technical team in my area.0 ratings for pathetic call centre guys who talk to me today on 30th March at around 11 AM for 45 mins, please check entire recording if you fell I am laying.           ", "2 users found this review helpful"], ["Superb mobile..loved it..           ", "2 users found this review helpful"], ["Superb mobile..loved it..           ", "2 users found this review helpful"], ["Good touch and superb experience           ", "2 users found this review helpful"], ["The best phone by Moto by far. This phone has a great battery life , something that suits a gamer like me. Only one suggestion you could have made this phone an HD. As per me 4.5/5           ", "1 users found this review helpful"], ["One of the best Stock android phone in the market .....which Is filled with poor UI ,, RECOMMEND FOR EVERYONE           ", "1 users found this review helpful"], ["For battery backup this phone is the best           ", "1 users found this review helpful"], ["I loved the handset               ", "1 users found this review helpful"], ["It really is a good phone.The phone was packed and delivered decently and in a good condition.Battery life is working excellent.And definitely is a value for money.           ", "1 users found this review helpful"], ["Let's start off with what this mobile phone doesn't have ..You cannot play YouTube videos at 1080p , if you have unlimited internet connection, you would not want this phone.Animations not quite smooth.Selfie camera is average, finger print is not smooth, face recognition unlock feature is there but needs improvement. but hey that's not why you're buying this for, this has the best      battery life of all phones in the world, although Moto one power has same battery but not the same efficiency as G7 power, it is lighter than One power, Stock Pie 9 is glitch free, you don't see crashes, honor users will notice stability, better keyboard , I really mean fast keyboard, it will adapt to your typing . never gets hot, gets turbo charger plug & cable,You can work on this for hours, study your PDF files , when you used to wake up in the morning with battery low message, that will never happen with this phone,Phone comes with pre pasted screen guard which is nice. Rear camera despite single lens is good, attaching photo for reference, shoots 4k , better than honor in same price range .           ", "1 users found this review helpful"], ["Why you showing the phone as moto g7 but it is g7 power.? Why you are misleading the customers by putting wrong name           ", "0 users found this review helpful"], ["I like it but there is one thing that I didn't like.there is no front flash in this product..overall this is a amazing product.whts are the feature in this phone .they are really really amazing.superb.i will give 4.5 out of 5           ", "0 users found this review helpful"], ["Very nice           ", "0 users found this review helpful"], ["As always, Moto is excellent for everyday use - for those of us who are not tech savvy.Was attached to the Moto G5S Plus. The G7 Power is a far better and user-friendly upgrade.Thank you AMAZON for making life easier - even in the remote corners of Planet Earth :-)           ", "0 users found this review helpful"], ["Guys guys guys this phone has serious network problem, calls are not clear and call volume is low...Camera is poorer than 9k Realme phone..Fingerprint reader is awesome..Battery backup is good..           ", "0 users found this review helpful"], ["Features are good. But they wrongly mentioned the name as Moto g7. It is actually Moto g7 power. I ordered tempered glass and back cover for Moto g7 becoz of this name confusion. Pls change the name as Moto g7 power. Otherwise, features and all other things are good.           ", "0 users found this review helpful"], ["Camera quality is really worst. Lower version phones are really good, that is why I bought it.There are issues in the in built apps like FM radio! I dont know how the testings are passesd           ", "0 users found this review helpful"], ["Doesn   t connect to wifi           ", "0 users found this review helpful"], ["The phone is heavy don't forget that           ", "0 users found this review helpful"], ["Phone is not working properly. There is problem in internet access , when network is poor 2G is showing but when come in good network range the Internet access is still 2G. We have to re enter the sim card for 4G.           ", "0 users found this review helpful"], ["Very genuine and good product.           ", "0 users found this review helpful"], ["This is not Motorola G7. Chuna laga raha hey. Motorola G7 has teardrop notch. This is another variant of Motorola G7 and it is called Motorola Moto G7 Power.           ", "0 users found this review helpful"], ["Excellent phone. Good performance. Value for money.           ", "0 users found this review helpful"], ["The Phone is only LTE compatible not VoLTE enabled one, that's a disappointment. other than that everything is fine. The phone works perfectly well as the 4GB RAM, helps it to work seamlessly. Value for money.           ", "0 users found this review helpful"], ["Best ever phone in the world. It's fingerprint scanner is super fast it's camera quality is super cool it's display gives a good amount of area to play games           ", "0 users found this review helpful"], ["Let's start off with what this mobile phone doesn't have ..You cannot play YouTube videos at 1080p , if you have unlimited internet connection, you would not want this phone.Animations not quite smooth.Selfie camera is average, finger print is not smooth, face recognition unlock feature is there but needs improvement. but hey that's not why you're buying this for, this has the best      battery life of all phones in the world, although Moto one power has same battery but not the same efficiency as G7 power, it is lighter than One power, Stock Pie 9 is glitch free, you don't see crashes, honor users will notice stability, better keyboard , I really mean fast keyboard, it will adapt to your typing . never gets hot, gets turbo charger plug & cable,You can work on this for hours, study your PDF files , when you used to wake up in the morning with battery low message, that will never happen with this phone,Phone comes with pre pasted screen guard which is nice. Rear camera despite single lens is good, attaching photo for reference, shoots 4k , better than honor in same price range .           ", "0 users found this review helpful"], ["For battery backup this phone is the best           ", "0 users found this review helpful"]]}{"rating": "2.8", "based_on": "5", "reviews,useful": [["Bad Product           ", "21 users found this review helpful"], ["The phone is super and has amazing features and best for ping it was not lagging even tough I have both free fire and pubg           ", "1 users found this review helpful"], ["This mobile is really waste of money and overpriced. The performance is not as good as they are charging           ", "1 users found this review helpful"], ["I really wanted to buy this mobile phone but I will not because my mother got one and it is pathetic. Nothing about this is actually true and please be careful before buying it.           ", "1 users found this review helpful"], ["When the Techno Canon 12 Air phone was launched I was excited and had a lot of expectations. But within a few hours of making a purchase I have come to the conclusion that I have made the biggest blunder of my life. The phone is lagging in all departments. The screen is dull and insipid making it a painful experience to watch your favourite movie on Netflix. The phone has a camera, but that is just a formality!! The picture quality is pretty low. And the lesser said about the battery life the better. Within a few hours the battery ran out. Was not expecting such a below average product from Techno. Buying this product is like throwing your money in a garbage can. My advice; do not go for it.           ", "0 users found this review helpful"]]}{"rating": "4", "based_on": "277", "reviews,useful": [["Performance is good. Camera is awesome. but main issue is phone getting stuck sometimes and we need to switch off and switch on to make it work properly.", "0 users found this review helpful"], ["Advantages\nNo Other Phones Have these much of Features in camera like Sony Xperia Z5 Dual Having, Its also having DSLR Effect, Good Battery Backup,\nSound was Quit Good with 2 Speakers,\nAwesome Display, Smoothly Works on Heavy Games Like Asphalt 8, Front Camera Also Superb, No other Smartphones have Fingerprint sensor like this phone is having It works very fast like u don't know when lock opened\n\nDisadvantages\nHeats a little bit due to Waterproof Feature\nLED Flash Is not so strong\nNight mode photos came in light Blue colour due to flash is very near to Camera lens\nBut i don't warry about These disadvantages", "0 users found this review helpful"], ["Camera quality not up to the mark, features does not matches price of the product", "0 users found this review helpful"], ["Really...this mobile phone is very excellent for regular use or official use also, and expecially the camera 23.0 Mp. It is believable and this camera equal to DSLR, and many times I camper's to Apple 6s camera, pictures clarity what our it is about the futures this mobile is far better...and I fully very happy with this mobile and amazon also good with in the time they are delivered ...S Hari Krishna from kothakota srikakulam Andhra pradesh.", "0 users found this review helpful"], ["Awesome phone ! Love it, battery solid for 2days, lovely display built to last phone.", "0 users found this review helpful"], ["Please hit the helpful button if you find the review to be helpful! It helps a lot guys.....\n\nPROS:\nAn awesome 23 MegaPixel camera with hybrid autofocus-means they have both phase detection and contrast autofocus\n2.0 GHz Snapdragon 810 Octa-core 64bit processor + 3 GB RAM = Smooth Performance.\nIntegrated fingerprint sensor for quick and more secure access.\nGreat quality 4K recording.\nExpendable memory up to the 200 GB.\nIP 68 waterproof and dust tight prevent phone from accidental damage.\nDedicated Button for the camera.\n\nCONS:\nPhone lacks OIS (optical image stabilizer) which helps to reduce blurring associated with the motion of a camera.\nHeating issue is not completely resolved till date.\nFor Most of the people it is Expensive.\nNothing is there in Handset that is innovative, Everything is just a modification.\nNot qHD like other Flagship Samsung Galaxy Note5, OnePlus 2.", "0 users found this review helpful"], ["Over heating very badly, please be cautions before u buy", "0 users found this review helpful"], ["The best phone of sony xperia you will ever get in\nZ series being honest the phone looks pretty cool in your hand and the camera is good...after upgrading to marshmallow phone performance is better....close your eyes and buy this product Xperia Z5", "0 users found this review helpful"], ["Superb product", "0 users found this review helpful"], ["Heavy price and bad sony UI.\n\nCamera is awesome. Trust me when I say this, its same as the camera of apple iphone 6s. Sony UI is on top of android marshmallow and the UI is so boring and is useless. There is also a slight lag coz of this sony UI. The Price is very high for a 3gb ram product.\n\nOnly buy if you want an awesome camera phone thats it. In any other case try to avoid this.\n\nSony xperia z3 plus is 12k less than this. only difference is the finger print and less camera pixels.", "0 users found this review helpful"], ["Great Camera\nGreat Performance\nNice Build Quality\nSometimes it gets overheated which is the the only downside.\nSometimes Fingerprint scanner is not accurate.", "0 users found this review helpful"], ["Too much heating even after replaced .  issue not solved", "0 users found this review helpful"], ["Awsome colour just buy it                 ", "0 users found this review helpful"], ["It has a lighting speed guys, good for daily use , Awsome product ,                                                       ", "0 users found this review helpful"], ["Been using it for about 2 weeks and here are my observations\n- Feels warm on prolonged usage ( my previous phone did too )\n- Battery drains a bit faster and the usage seems to be mainly by the screen ( mine is at 50% brightness and 30 sec time out). Stamina mode seems to help to a great deal but reduces a few visual effects ( which is ok with me ).  Over all the battery life seems ok as long as I dont play some processor intensive game. Get about 10hrs average for normal use.\n- No complains on the performance and looks", "0 users found this review helpful"], ["Sony is best brand and super camera and 23. mp and 3gb ram", "0 users found this review helpful"], ["Xperia z5 dual is a Good phone for the last 3 months it has been a primary driver. Battery is just average and heating issues on gaming. Other than thay a true performance king!!", "0 users found this review helpful"], ["I want to specifically mention the performance of the phone with regards to Video shooting using the back camera. The phone manages no more than 4 minutes of continuous video shooting (in an AC room!!) before the thermal overload protection kicks in and the video shooting is stopped till the device cools down. You actually get an onscreen warning message about the high temperature within the device chipset.\n\nPhone heats up very quickly for camera, GPS, screen mirroring and gaming for more than 20 minutes. Supposedly Sony has stopped production of phones with SD 810 chipset (Z3+, Z5 variants etc) as per Reliance Digital and Vijay Sales outlets, as on May 2016.\n\nSuggest staying away from these phones, inspite of the fact that these phones are otherwise very good phones with respect to smooth performance on regular tasks, browsing and are rugged (water/dust proof) and look pretty unique compared to the curvy phones from other manufacturers.", "0 users found this review helpful"], ["Bad bad bad prosscng...", "0 users found this review helpful"], ["No otg- USB reversible type c", "0 users found this review helpful"], ["Awesome phone I ever seen", "0 users found this review helpful"], ["Amazon delivered it within 19 hours.\nThe phone is one of the best looking phone in the market. Whatever the reviews of other Samsungs and Apples tell about their superiority, Sony stands still with the classy garnish and excellent taste. Use it and you will know. Sony lasts longer when it comes to reliability.", "0 users found this review helpful"], ["worried about Z5 heating issues ???\nin my opinion is doesnt heat like how previous generation Xperia Z series smartphones used to heat inspite of having snapdragon 810 processor... moreover marshmallow update is pretty smooth nd clean... watchout my video for full indepth review... is the best of sony ??? findout here....\nLINK :[...]", "0 users found this review helpful"], ["Great phone, ok battery life", "0 users found this review helpful"], ["superb. trusting amazon.", "0 users found this review helpful"], ["Good product by Sony", "0 users found this review helpful"], ["fine", "0 users found this review helpful"], ["Phone look good and camera is perfect,battery is stand a day for 2 to 3 hours 4 g and standby 1.5 days,phone get warm playing games and long WiFi but cool down immediately,price wise heavy,it supports otg also...4k video for 1 min only....\nDisplay 9/10\nCamera 10/10\nSound.  8/10\nBattery. 7/10\nSpeed. 10/10\nBuild.  10/10", "0 users found this review helpful"], ["Awesome phone with best camera and battery life.\nNot any high warming issues as shown by other, Sony has literally tamed the dragon( S810 processor )", "0 users found this review helpful"], ["This model z5 is very heat .so plese take care.recharge somany times is vexing.", "0 users found this review helpful"], ["Super phone a flag ship cell from Sony", "0 users found this review helpful"], ["Nice product . Quick delivery", "0 users found this review helpful"], ["Too much      heated while playing online video or watching live match....don't buy it because iPhone is best option instead of it and with respect yr money.... 3d gaming is also not good", "0 users found this review helpful"], ["Super phone. But it heats up tremendously and please anyone tell me how to change font style and also how to copy text from notepad. Another issue is the fingerprint sensor does not work if your finger is even slightly sweating. Besides these it is a bomb. There is no comparison to the camera. I love it.", "0 users found this review helpful"], ["I am addicted to sony brand,since 8 years I use only Sony mobiles,that too only  highend mobiles of Sony,for the first time Sony disappointed me....Buyed two Sony Xperia z5 duos mobiles in another site not in amazon, in both phones the basic feature gyroscope gone faulty, gyroscope failured, not worked, so returned both mobiles in just two days of use.,it's a major flaw in z5 series,came from z3 and again gone back to z3, z3 the best ever model in z series, I suggest not to buy z5 series mobiles,better buy z3 if u are a Sony lover.", "0 users found this review helpful"], ["Best Smartphone of Sony", "0 users found this review helpful"], ["Dealing was excellent", "0 users found this review helpful"], ["This is one of the best mobile... Camera is awesome 23 m.p captured very detail crisp clear  images compaire to Samsung s6 ( yellow images)\nSony make.belive", "0 users found this review helpful"], ["Excellent phone with great camera features and design.", "0 users found this review helpful"], ["Sony Xperia Z3 & Z3+, style is very nice design & good looking phone, but Z5 look is very bad and very heavy looking,", "0 users found this review helpful"], ["Loving it.", "0 users found this review helpful"], ["Good job , this product availability in my pin code\nWoOw ......  It's awesome", "0 users found this review helpful"], ["Really beautiful device\nA monster with Snapdragon 810 and 3gigs of RAM\nReally fast and by far the best battery life on a phone ever\nBest camera too!", "0 users found this review helpful"], ["Please sony!!  You could have provided a better battery for a phone like this.. at least 4000mah..", "0 users found this review helpful"], ["Very good phone. Display is very sharp. Initially some heating issues were there but after few days it is good. Earlier purchased one plus two but that device was a small heater. Thanks to Sony.  Battery is also better than other similar capacity phones. Though price is quite high but brand matters bhai.", "0 users found this review helpful"], ["This is the only dual-SIM flagship smartphone from any mobile phone manufacturer. A dual-SIM is of vital importance to us Indians - one SIM is for personal use and the other for official use. So it makes a lot of sense to carry around one phone (It may be a problem if it gets stolen - you lose both SIMS, but then, conversely, it is easier to look after a single phone rather than juggle around two phones).\n\nUnlike its predecessors, the Xperia Z5 has no heating issues. It is sleek, well balanced and very ergonomic. The user interface is very simple and familiar to SONY mobile fans. The price has come down considerably now.\n\nThe Xperia logo on the side adds a lot of class. The start/stop oblong button incorporates the fingerprint sensor and it works beautifully. The sensitivity is amazing - loads better than Samsung.\n\nThe 23 MP camera is top top-class, rivaling DSLR cameras.\n\nThe display is brilliant showing natural colours, unlike the augmented and saturated colours on the Samsung Edge.\n\nEasily the best phone in India.", "0 users found this review helpful"], ["Almost everything about this phone is perfect -- great design- great screen- great battery backup- during video playback, battery consumption is fast, but at other times, battery is just amazing- good multitasking- great audio quality- great cameras in daylight- low light photography isn't upto flagship standards but still good- stereo speakers quality is amazing but the maximum volume isn't too high (sufficient for personal use)Overall a balanced phone. Recommended.", "0 users found this review helpful"], ["Best phone. The S6 may have better specs but the firmware isn't optimised. (Just search for RAM management on Samsung). This phone has awesome battery, camera (accurate colours, unlike Samsung where it is oversaturated), and is waterproof.", "0 users found this review helpful"], ["Osm phone, the phone is a beauty and beast\nBut does heat up a bit. Battery actually drains a bit faster when you keep on playing a game or use your camera.\nFor normal usage the different battery mode will pretty much extend it for close to two days.\nThe offers are really great, but no idea how to redeem the free ebooks, if anyone figured it out please ping me in on the details.\nBut that aside the phone performance is great it seems like virtually it can handle anything.\nAnd the most important from my perspective multitasking is fantastic.\nAnd if you smart enough you can get the mobile for 45k.\nHope you guys find this useful.", "0 users found this review helpful"], ["Amazing on amazon.in", "0 users found this review helpful"]]}